[
    {
        "type": "text",
        "text": "19 Sheet  Metalworking ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Chapter Contents ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "19.1 Cutting Operations ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "19.1.1 Shearing, Blanking, and  Punching 19.1.2 Engineering Analysis of  Sheet-Metal Cutting 19.1.3 Other Sheet-Metal Cutting  Operations "
    },
    {
        "type": "text",
        "text": "19.2 Bending Operations ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "19.2.1 V-Bending and Edge Bending 19.2.2 Engineering Analysis of Bending 19.2.3 Other Bending and Forming  Operations "
    },
    {
        "type": "text",
        "text": "19.3 Drawing ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "19.3.1 Mechanics of Drawing 19.3.2 Engineering Analysis of Drawing 19.3.3 Other Drawing Operations 19.3.4 Defects in Drawing "
    },
    {
        "type": "text",
        "text": "19.4 Other Sheet-Metal-Forming Operations "
    },
    {
        "type": "text",
        "text": "19.4.1 Operations Performed with  Metal Tooling 19.4.2 Rubber Forming Processes "
    },
    {
        "type": "text",
        "text": "19.5 Dies and Presses for Sheet-Metal  Processes 19.5.1 Dies 19.5.2 Presses "
    },
    {
        "type": "text",
        "text": "19.6 Sheet-Metal Operations Not  Performed on Presses 19.6.1 Stretch Forming 19.6.2 Roll Bending and Roll Forming 19.6.3 Spinning 19.6.4 High-Energy-Rate Forming "
    },
    {
        "type": "text",
        "text": "19.7 Bending of Tube Stock ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Sheet metalworking includes cutting and forming op- erations performed on relatively thin sheets of metal.  Typical sheet-metal thicknesses are between  $0.4\\,\\mathrm{\\mm}$   (1/64 in) and  $6~\\mathrm{mm}$  ( $(1/4\\ \\mathrm{in})$ . When thickness exceeds  about  $6~\\mathrm{mm}$ , the stock is usually referred to as plate  rather than sheet. The sheet or plate stock used in sheet  metalworking is produced by ﬂ  at rolling (Section 18.1).  The most commonly used sheet metal is low carbon  steel  $(0.06\\%–0.15\\%$  C is typical). Its low cost and good  formability, combined with sufﬁ  cient strength for most  product applications, make it ideal as a starting material.  "
    },
    {
        "type": "text",
        "text": "The commercial importance of sheet metalworking  is signiﬁ  cant. Consider the number of consumer and  industrial products that include sheet or plate metal  parts: automobile and truck bodies, airplanes, railway  cars, locomotives, farm and construction equipment,  appliances, ofﬁ  ce furniture, and more. Although these  examples are conspicuous because they have sheet- metal exteriors, many of their internal components are  also made of sheet or plate stock. Sheet-metal parts are  generally characterized by high strength, good dimen- sional accuracy, good surface ﬁ  nish, and relatively low  cost. For components that must be made in large quan- tities, economical mass-production operations can be  designed to process the parts. Aluminum beverage cans  are a prime example. "
    },
    {
        "type": "text",
        "text": "Sheet-metal processing is usually performed at room  temperature (cold working). The exceptions are when  the stock is thick, the metal is brittle, or the deformation  is signiﬁ  cant. These are usually cases of warm working  rather than hot working. "
    },
    {
        "type": "text",
        "text": "Most sheet-metal operations are performed on ma- chine tools called  presses . The term  stamping press  is  used to distinguish these presses from forging and ex- trusion presses. The tooling that performs sheet metal- work is called a  punch-and-die ; the term  stamping die   is also used. The sheet-metal products are called  stamp- ings . To facilitate mass production, the sheet metal  is often presented to the press as long strips or coils.  Various types of punch-and-die tooling and stamping  presses are described in Section 19.5. Final sections of the chapter cover various  operations that do not utilize conventional punch-and-die tooling, and most of them  are not performed on stamping presses.  "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "The three major categories of sheet-metal processes are (1) cutting, (2) bending,  and (3) drawing. Cutting is used to separate large sheets into smaller pieces, to cut  out part perimeters, and to make holes in parts. Bending and drawing are used to  form sheet-metal parts into their required shapes. "
    },
    {
        "type": "text",
        "text": " Cutting Operations ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Cutting of sheet metal is accomplished by a shearing action between two sharp  cutting edges. The shearing action is depicted in the four stop-action sketches of  Figure 19.1, in which the upper cutting edge (the punch) sweeps down past a station- ary lower cutting edge (the die). As the punch begins to push into the work,  plastic  deformation  occurs in the surfaces of the sheet. As the punch moves downward,  penetration  occurs in which the punch compresses the sheet and cuts into the metal.  This penetration zone is generally about one-third the thickness of the sheet. As the  punch continues to travel into the work,  fracture  is initiated in the work at the two  cutting edges. If the clearance between the punch and die is correct, the two fracture  lines meet, resulting in a clean separation of the work into two pieces. "
    },
    {
        "type": "text",
        "text": "The sheared edges of the sheet have characteristic features as in Figure 19.2. At  the top of the cut surface is a region called the  rollover . This corresponds to the  depression made by the punch in the work prior to cutting. It is where initial plastic  "
    },
    {
        "type": "image",
        "img_path": "images/52488ba3a68565ceeda22bb319900f92274c40a6a994ead7c87d19f9f48baf4d.jpg",
        "img_caption": "FIGURE 19.1  Shearing of sheet metal between two cutting edges: (1) just before the punch contacts work; (2) punch  begins to push into work, causing plastic deformation; (3) punch compresses and penetrates into work causing a smooth  cut surface; and (4) fracture is initiated at the opposing cutting edges that separate the sheet. Symbols  v  and $F$ indicate  motion and applied force, respectively, $t\\!=\\!\\mathfrak{s t o c k}$  thickness,  $c=$  clearance. "
    },
    {
        "type": "image",
        "img_path": "images/37ec7b1a625177be1c457b7f43b2a9ec21e7eb424a124649a87ec37fea84c91b.jpg"
    },
    {
        "type": "image",
        "img_path": "images/35ddcf71d7a927ebd1470d82b538d983f412fa0a64b7783440dad9e9be65e705.jpg",
        "img_caption": "FIGURE 19.3  Shearing  operation: (a) side view of  the shearing operation;  (b) front view of power  shears equipped with  inclined upper cutting  blade. Symbol  v  indicates  motion. "
    },
    {
        "type": "text",
        "text": "deformation occurred in the work. Just below the rollover is a relatively smooth  region called the  burnish . This results from penetration of the punch into the work  before fracture began. Beneath the burnish is the  fractured zone , a relatively rough  surface of the cut edge where continued downward movement of the punch caused  fracture of the metal. Finally, at the bottom of the edge is a  burr , a sharp corner on  the edge caused by elongation of the metal during ﬁ  nal separation of the two pieces. "
    },
    {
        "type": "text",
        "text": "19.1.1  SHEARING, BLANKING, AND PUNCHING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The three most important operations in pressworking that cut metal by the shearing  mechanism just described are shearing, blanking, and punching. "
    },
    {
        "type": "text",
        "text": "Shearing  is a sheet-metal cutting operation along a straight line between two cut- ting edges, as shown in Figure 19.3(a). Shearing is typically used to cut large sheets  into smaller sections for subsequent pressworking operations. It is performed on a  machine called a  power shears , or  squaring shears . The upper blade of the power  shears is often inclined, as shown in Figure 19.3(b), to reduce the required cutting  force. "
    },
    {
        "type": "text",
        "text": "Blanking  involves cutting of the sheet metal along a closed outline in a single step  to separate the piece from the surrounding stock, as in Figure 19.4(a). The part that  is cut out is the desired product in the operation and is called the  blank .  Punching   is similar to blanking except that it produces a hole, and the separated piece is scrap,  called the  slug . The remaining stock is the desired part. The distinction is illustrated  in Figure 19.4(b). "
    },
    {
        "type": "image",
        "img_path": "images/41b9e9eb8df81ec265e141a195dbcf32efb1e09e3501687d31a22aa852649619.jpg"
    },
    {
        "type": "image",
        "img_path": "images/66aa5bd424cc8170e96a13082ca85ea6600e353931b305d50e2f77adbd2f4f18.jpg",
        "img_caption": "FIGURE 19.5  Effect of  clearance: (a)   clearance  too small causes less- than-optimal   fracture  and excessive forces;  and (b) clearance too  large causes   oversized  burr. Symbols  v  and  $F$  indicate motion  and   applied force,  respectively. "
    },
    {
        "type": "text",
        "text": "19.1.2  ENGINEERING ANALYSIS OF SHEET-METAL CUTTING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Process parameters in sheet-metal cutting are clearance between punch and die,  stock thickness, type of metal and its strength, and length of the cut. This section  deﬁ  nes these parameters and some of the relationships among them. "
    },
    {
        "type": "text",
        "text": "Clearance  The clearance   $c$  in a shearing operation is the distance between the  punch and die, as shown in Figure 19.1(a). Typical clearances in conventional press- working range between  $4\\%$  and  $8\\%$  of the sheet-metal thickness $t.$  The effect of im- proper clearances is illustrated in Figure 19.5. If the clearance is too small, then the  fracture lines tend to pass each other, causing a double burnishing and larger cutting  forces. If the clearance is too large, the metal becomes pinched between the cutting  edges and an excessive burr results. In special operations requiring very straight  edges, such as shaving and ﬁ  ne blanking (Section 19.1.3), clearance is only about $1\\%$ of stock thickness. "
    },
    {
        "type": "text",
        "text": "The correct clearance depends on sheet-metal type and thickness. The recom- mended clearance can be calculated by the following formula: "
    },
    {
        "type": "equation",
        "text": "\n$$\nc=A_{c}t\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $c=$  clearance, mm (in);  $A_{c}=$  clearance allowance; and  $t=$  stock thickness,  mm (in). The clearance allowance is determined according to type of metal. For  convenience, metals are classiﬁ  ed into three groups given in Table 19.1, with an as- sociated allowance value for each group. "
    },
    {
        "type": "table",
        "img_path": "images/94ecd401bf097a63053ea961d74f44aeb66bac7139d64ad0bdf150ff9388f26c.jpg",
        "table_caption": "TABLE  •  19.1  Clearance allowance value for three sheet-metal groups. "
    },
    {
        "type": "image",
        "img_path": "images/bcc28a2b2cb6b747ad3f94f5c1c8b9141d3a7847d27b4a186f9e5c5493173a44.jpg",
        "img_caption": "FIGURE 19.6  Die size determines  blank size  $D_{b};$  punch size determines  hole size $D_{h};$ ;  $c=$  clearance. "
    },
    {
        "type": "text",
        "text": "These calculated clearance values can be applied to conventional blanking and  hole-punching operations to determine the proper punch and die sizes. The die  opening must always be larger than the punch size (obviously). Whether to add the  clearance value to the die size or subtract it from the punch size depends on whether  the part being cut out is a blank or a slug, as illustrated in Figure 19.6 for a circular  part. Because of the geometry of the sheared edge, the outer dimension of the part  cut out of the sheet will be larger than the hole size. Thus, punch and die sizes for a  round blank of diameter $D_{b}$  are determined as "
    },
    {
        "type": "equation",
        "text": "",
        "text_format": "latex"
    },
    {
        "type": "equation",
        "text": "",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Punch and die sizes for a round hole of diameter $D_{h}$  are determined as: "
    },
    {
        "type": "equation",
        "text": "",
        "text_format": "latex"
    },
    {
        "type": "equation",
        "text": "",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "In order for the slug or blank to drop through the die, the die opening must have  an  angular clearance  (see Figure 19.7) of $0.25^{\\circ}$  to  $1.5^{\\circ}$  on each side. "
    },
    {
        "type": "text",
        "text": "Cutting Forces  Estimates of cutting force are important because this force deter- mines the size (tonnage) of the press needed. Cutting force $F$  in sheet metalworking  can be determined by "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=S t L\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "image",
        "img_path": "images/6e47cbd315b8a6d29ef8f001918e81acfdf2483c7ded710407f0ef750b5e5408.jpg",
        "img_caption": "FIGURE 19.7  Angular clearance. "
    },
    {
        "type": "text",
        "text": "where  $S\\,=$  shear strength of the sheet metal, MPa  $\\mathrm{(lb/in^{2})}$ ;  $t~=$  stock thickness,  $\\mathrm{mm}$  (in), and  $L=$ length of the cut edge, mm (in). In blanking, punching, slotting,  and similar operations, $L$  is the perimeter length of the blank or hole being cut. The  minor effect of clearance in determining the value of  $L$  can be neglected. If shear  strength is unknown, an alternative way of estimating the cutting force is to use the  tensile strength: "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=0.7(T S)t L\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $T S=$  ultimate tensile strength MPa  $\\mathrm{(lb/in^{2})}$ . "
    },
    {
        "type": "text",
        "text": "These equations for estimating cutting force assume that the entire cut along the  sheared edge length $L$  is made at the same time. In this case the cutting force will be  a maximum. It is possible to reduce the maximum force by using an angled cutting  edge on the punch or die, as in Figure 19.3(b). The angle (called the  shear angle ),  spreads the cut over time and reduces the force experienced at any one moment.  However, the total energy required in the operation is the same, whether it is con- centrated into a brief moment or distributed over a longer time period. "
    },
    {
        "type": "text",
        "text": "Example 19.1  Blanking  clearance  and force ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A round disk of  $150{\\mathrm{-mm}}$  diameter is to be blanked from a strip of $3.2\\mathrm{-mm}$ ,  half-hard cold-rolled steel whose shear strength $=310$  MPa. Determine (a) the  appropriate punch and die diameters, and (b) blanking force. "
    },
    {
        "type": "text",
        "text": "Solution:  (a) From Table 19.1, the clearance allowance for half-hard cold- rolled steel is $A_{c}=0.075.$ . Accordingly, "
    },
    {
        "type": "equation",
        "text": "\n$$\nc=0.075(3.2\\,\\mathrm{mm})=0.24\\,\\mathrm{mm}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The blank is to have a diameter $=150\\:\\mathrm{mm}$ , and die size determines blank size.  Therefore, "
    },
    {
        "type": "text",
        "text": "$\\begin{array}{r}{\\mathrm{De\\opening\\;diameter}=150.00\\;\\mathrm{mm}\\;}\\\\ {\\mathrm{Psuch\\;diameter}=150-2\\;(0.24)=149.52\\;\\mathrm{mm}}\\end{array}$ "
    },
    {
        "type": "text",
        "text": "(b) To determine the blanking force, assume that the entire perimeter of the  part is blanked at one time. The length of the cut edge is "
    },
    {
        "type": "equation",
        "text": "\n$$\nL=\\pi D_{b}=150\\pi=471.2\\,\\mathrm{mm}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "and the force is "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=310(471.2)(3.2)=467,\\!469\\,\\mathrm{N}\\,(\\sim53\\,\\mathrm{tons})\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "19.1.3 OTHER SHEET-METAL-CUTTING OPERATIONS",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "In addition to shearing, blanking, and punching, there are several other cutting op- erations in pressworking. The cutting mechanism in each case involves the same  shearing action discussed above. "
    },
    {
        "type": "text",
        "text": "Cutoff and Parting  Cutoff is a shearing operation in which blanks are separat- ed from a sheet-metal strip by cutting the opposite sides of the part in sequence,  as shown in Figure 19.8(a). With each cut, a new part is produced. The features of  "
    },
    {
        "type": "image",
        "img_path": "images/e3f03d1dc072f984c28a668559b8d6b53669a1351142acecd0cd08d395b88004.jpg",
        "img_caption": "FIGURE 19.8  (a) Cutoff  and (b) parting. "
    },
    {
        "type": "text",
        "text": "a   cutoff operation that distinguish it from a conventional shearing operation are  (1) the cut edges are not necessarily straight, and (2) the blanks can be nested on the  strip in such a way that scrap is avoided. "
    },
    {
        "type": "text",
        "text": "Parting  involves cutting a sheet-metal strip by a punch with two cutting edges  that match the opposite sides of the blank, as shown in Figure 19.8(b). This might be  required because the part outline has an irregular shape that precludes perfect nest- ing of the blanks on the strip. Parting is less efﬁ  cient than cutoff in the sense that it  results in some wasted material. "
    },
    {
        "type": "text",
        "text": "Slotting, Perforating, and Notching  Slotting is the term sometimes used for a  punching operation that cuts out an elongated or rectangular hole, as pictured in  Figure 19.9(a).  Perforating  involves the simultaneous punching of a pattern of holes  in sheet metal, as in Figure 19.9(b). The hole pattern is usually for decorative pur- poses, or to allow passage of light, gas, or ﬂ  uid. "
    },
    {
        "type": "text",
        "text": "To obtain the desired outline of a blank, portions of the sheet metal are often  removed by notching and seminotching.  Notching  involves cutting out a portion of  metal from the side of the sheet or strip.  Seminotching  removes a portion of metal  from the interior of the sheet. These operations are depicted in Figure 19.9(c). Semi- notching might seem to the reader to be the same as a punching or slotting opera- tion. The difference is that the metal removed by seminotching creates part of the  blank outline, while punching and slotting create holes in the blank. "
    },
    {
        "type": "image",
        "img_path": "images/51a6112bbc72b9dd7e9b1da41844c72e04514aa8533da553f2f024a8fb423112.jpg",
        "img_caption": "FIGURE 19.9  (a) Slotting, (b) perforating, (c) notching and seminotching. Symbol  v  indicates motion of strip. "
    },
    {
        "type": "image",
        "img_path": "images/55edf53480e4204c89f59656d5b91a579f39c9071f29f202415292b593337ee1.jpg",
        "img_caption": "FIGURE 19.10  (a) Shaving, and (b) ﬁ  ne  blanking. Symbols:  $V=$   motion of punch, $F_{h}=$   blank holding force. "
    },
    {
        "type": "text",
        "text": "Trimming, Shaving, and Fine Blanking  Trimming is a cutting operation per- formed on a formed part to remove excess metal and establish size. The term has  the same basic meaning here as in forging (Section 18.4). A typical example in sheet  metalwork is trimming the upper portion of a deep drawn cup to leave the desired  dimensions on the cup. "
    },
    {
        "type": "text",
        "text": "Shaving  is a shearing operation performed with very small clearance to obtain  accurate dimensions and cut edges that are smooth and straight, as pictured in Fig- ure 19.10(a). Shaving is typically performed as a secondary or ﬁ  nishing operation on  parts that have been previously cut. "
    },
    {
        "type": "text",
        "text": "Fine blanking  is a shearing operation used to blank sheet-metal parts with close  tolerances and smooth, straight edges in one step, as illustrated in Figure 19.10(b).  At the start of the cycle, a pressure pad with a V-shaped projection applies a holding  force $F_{h}$  against the work adjacent to the punch in order to compress the metal and  prevent distortion. The punch then descends with a slower-than-normal velocity and  smaller clearances to provide the desired dimensions and cut edges. The process is  usually reserved for relatively small stock thicknesses. "
    },
    {
        "type": "text",
        "text": " Bending Operations ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Bending in sheet-metal work is deﬁ  ned as the straining of the metal around a straight  axis, as in Figure 19.11. During the bending operation, the metal on the inside of the neu- tral plane is compressed, while the metal on the outside of the neutral plane is stretched.  These strain conditions can be seen in Figure 19.11(b). The metal is plastically deformed  "
    },
    {
        "type": "image",
        "img_path": "images/e6d282ae7638645ca0e6f9201de44b74e34ceca951460e1dc376bcde28fb78fa.jpg",
        "img_caption": "FIGURE 19.11  (a) Bending of sheet metal;  (b) both compression and  tensile elongation of the  metal occur in bending. "
    },
    {
        "type": "image",
        "img_path": "images/34fb901bb0713f6d61aa45b621a430d671f57a50e31d84321921626000409846.jpg",
        "img_caption": "FIGURE 19.12  Two common bending methods: (a) V-bending and (b) edge bending; (1) before and (2) after bending.  Symbols: $V=$  motion, $F\\!=$  applied bending force,  $F_{h}=$  blank "
    },
    {
        "type": "text",
        "text": "so that the bend takes a permanent set upon removal of the stresses that caused it.  Bending produces little or no change in the thickness of the sheet metal. "
    },
    {
        "type": "text",
        "text": "19.2.1  V-BENDING AND EDGE BENDING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Bending operations are performed using punch and die tooling. The two common  bending methods and associated tooling are V-bending, performed with a V-die;  and edge bending, performed with a wiping die. These methods are illustrated in  Figure 19.12. "
    },
    {
        "type": "text",
        "text": "In  V-bending , the sheet metal is bent between a V-shaped punch and die. Included  angles ranging from very obtuse to very acute can be made with V-dies. V-bending is  generally used for low-production operations. It is often performed on a press brake  (Section 19.5.2), and the associated V-dies are relatively simple and inexpensive. "
    },
    {
        "type": "text",
        "text": "Edge bending  involves cantilever loading of the sheet metal. A pressure pad is  used to apply a force $F_{h}$  to hold the base of the part against the die, while the punch  forces the part to yield and bend over the edge of the die. In the setup shown in  Figure 19.12(b), edge bending is limited to bends of  $90^{\\circ}$  or less. More complicated  wiping dies can be designed for bend angles greater than $90^{\\circ}$ . Because of the pres- sure pad, wiping dies are more complicated and costly than V-dies and are generally  used for high-production work. "
    },
    {
        "type": "text",
        "text": "19.2.2  ENGINEERING ANALYSIS OF BENDING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Some of the important terms in sheet-metal bending are identiﬁ  ed in Figure 19.11.  The metal of thickness $t$  is bent through an angle called the bend angle $\\alpha$ . This results  in a sheet-metal part with an included angle $\\alpha^{\\prime}$ , where  $\\alpha\\,+\\,\\alpha^{\\prime}\\,=\\,180^{\\circ}$ . The bend ra- dius $R$  is normally speciﬁ  ed on the inside of the part, rather than at the neutral axis,  and is determined by the radius on the tooling used to perform the operation. The  bend is made over the width of the workpiece $w$ . "
    },
    {
        "type": "text",
        "text": "Bend Allowance  If the bend radius is small relative to stock thickness, the metal  tends to stretch during bending. It is important to be able to estimate the amount  of stretching that occurs, if any, so that the ﬁ  nal part length will match the speciﬁ  ed  dimension. The problem is to determine the length of the neutral axis before bend- ing to account for stretching of the ﬁ  nal bent section. This length is called the  bend  allowance , and it can be estimated as follows: "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "equation",
        "text": "\n$$\nA_{b}=2\\pi\\frac{\\alpha}{360}(R+K_{b a}t)\n$$\n )  ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $A_{b}=$  bend allowance, mm (in);  $\\alpha\\,=$  bend angle, degrees;  $R\\,=$ bend radius,  mm (in); $t=$  stock thickness, mm (in); and  $K_{b a}$  is factor to estimate stretching. The  following design values are recommended for $K_{b a}$  [3]: if $R<\\!2t$ , $K_{b a}=0.33$ ; and if $R\\ge$   2 t, $K_{b a}=0.50$ . The values of  $K_{b a}$  predict that stretching occurs only if bend radius is  small relative to sheet thickness. "
    },
    {
        "type": "text",
        "text": "Springback  When the bending pressure is removed at the end of the deforma- tion operation, elastic energy remains in the bent part, causing it to recover par- tially toward its original shape. This elastic recovery is called  springback , deﬁ  ned  as the increase in included angle of the bent part relative to the included angle of  the forming tool after the tool is removed. This is illustrated in Figure 19.13 and is  expressed: "
    },
    {
        "type": "equation",
        "text": "\n$$\nS B=\\frac{\\alpha^{\\prime}-\\alpha_{\\;b}^{\\prime}}{\\alpha_{\\;b}^{\\prime}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $S B\\,=$  springback;  $\\alpha^{\\prime}\\,=$  included angle of the sheet-metal part, degrees; and  $\\alpha_{\\,\\,b}^{\\prime}=$  included angle of the bending tool, degrees. Although not as obvious, an in- crease in the bend radius also occurs due to elastic recovery. The amount of spring- back increases with modulus of elasticity $E$  and yield strength  $Y$ of the work metal. "
    },
    {
        "type": "text",
        "text": "Compensation for springback can be accomplished by several methods. Two com- mon methods are overbending and bottoming. In  overbending , the punch angle and  radius are fabricated slightly smaller than the speciﬁ  ed angle on the ﬁ  nal part so that  the sheet metal springs back to the desired value.  Bottoming  involves squeezing the  part at the end of the stroke, thus plastically deforming it in the bend region. "
    },
    {
        "type": "image",
        "img_path": "images/1fcc2be727d559358eef4e16dc6b943ede3ae5d74954cef3ba03ab9b235dcb38.jpg",
        "img_caption": "FIGURE 19.13  Springback in bending shows itself as a decrease in bend angle and an  increase in bend radius: (1) during the operation, the work is forced to take the radius  $R_{t}$  and included angle $\\alpha_{\\,\\,b}^{\\prime}=$  determined by the bending tool (punch in $\\vee$ -bending); (2) after  the punch is removed, the work springs back to radius $R$ and included angle $\\alpha^{\\prime}$ . Symbol:  $F\\!=$  applied bending force. "
    },
    {
        "type": "image",
        "img_path": "images/2a4453c86ecdc549a449b4c30becf2d1d1827807150dbe9169b1a13245e38ee9.jpg",
        "img_caption": "FIGURE 19.14  Die opening  dimension  D : (a) V-die, (b) wiping die. "
    },
    {
        "type": "text",
        "text": "Bending Force  The force required to perform bending depends on the geometry  of the punch-and-die and the strength, thickness, and length of the sheet metal. The  maximum bending force can be estimated by means of the following equation: "
    },
    {
        "type": "equation",
        "text": "\n$$\nF={\\frac{K_{b f}\\left(T S\\right)w t^{2}}{D}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $F=$  bending force,  $\\mathbf{N}$  (lb);  $T S=$  tensile strength of the sheet metal, MPa  $\\mathrm{(lb/in^{2})}$ ;  $w=$  width of part in the direction of the bend axis, mm (in);  $t=$  stock  thickness, mm (in); and  $D\\;=\\;$  die opening dimension as deﬁ  ned in Figure 19.14,  $\\mathrm{mm}$  (in). Equation (19.8) is based on bending of a simple beam in mechanics, and  $K_{b f}$  is a constant that accounts for differences encountered in an actual bending  process. Its value depends on type of bending: for V-bending, $K_{b f}=1.33$ ; and for  edge bending, $K_{b f}=0.33$ . "
    },
    {
        "type": "text",
        "text": "Example 19.2  Sheet-metal  bending ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A sheet-metal blank is to be bent as shown in Figure 19.15. The metal has a  modulus of elasticity $=205$  (10 3 ) MPa, yield strength $=275\\,\\mathrm{MPa}$ , and tensile  strength $=450\\:\\mathrm{MPa}$ . Determine (a) the starting blank size and (b) the bending  force if a V-die is used with a die opening dimension $=25\\:\\mathrm{mm}$ . "
    },
    {
        "type": "text",
        "text": "Solution:  (a) The starting blank $=44.5\\:\\mathrm{mm}$  wide. Its length $=38+A_{b}+25$   (mm). For the included angle $\\alpha^{\\prime}=120^{\\circ}$ , the bend angle  $\\alpha=60^{\\circ}$ . The value of  $K_{b a}$  in Equation  $(19.6)=0.33$  since $R/t=4.75/3.2=1.48$  (less than 2.0). "
    },
    {
        "type": "equation",
        "text": "\n$$\nA_{b}=2\\pi\\frac{60}{360}(4.75+0.33\\times3.2)=6.08\\:\\mathrm{mm}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Length of the blank is therefore $38+6.08+25=\\bf{69.08\\mm}$ . "
    },
    {
        "type": "text",
        "text": "(b) Force is obtained from Equation (19.8) using $K_{b f}=1.33$ . "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=\\frac{1.33(450)(44.5)(3.2)^{2}}{25}{=}\\,{\\bf10,}909\\mathrm{\\;N}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "image",
        "img_path": "images/777d391a52e719bb6e9370d2a531b5b19ba04b79c4b51d9b206f0c1d1c2ddddc.jpg",
        "img_caption": "FIGURE 19.15  Sheet-metal  part of Example 19.2 (dimensions  in mm). "
    },
    {
        "type": "image",
        "img_path": "images/7bbca4e6c97b6e7cc724cb0281d302be6632215e9a916d8195cfe09ff8dea06a.jpg"
    },
    {
        "type": "image",
        "img_path": "images/1d9c90cafe6018a600ec5eabe16788bb229466811ca94e09e8ab9374a79bd825.jpg",
        "img_caption": "FIGURE 19.16  Flanging: (a) straight ﬂ  anging, (b) stretch ﬂ  anging, and (c) shrink ﬂ  anging. "
    },
    {
        "type": "text",
        "text": "19.2.3 OTHER BENDING AND FORMING OPERATIONS",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Some sheet-metal operations involve bending over a curved axis rather than a  straight axis, or they have other features that differentiate them from the bending  operations described above. "
    },
    {
        "type": "text",
        "text": "Flanging, Hemming, Seaming, and Curling  Flanging is a bending operation in  which the edge of a sheet-metal part is bent at a $90^{\\circ}$  angle (usually) to form a rim or  ﬂ  ange. It is often used to strengthen or stiffen sheet metal. The ﬂ  ange can be formed  over a straight bend axis, as illustrated in Figure 19.16(a), or it can involve some  stretching or shrinking of the metal, as in (b) and (c). "
    },
    {
        "type": "text",
        "text": "Hemming  involves bending the edge of the sheet over on itself, in more than one  bending step. This is often done to eliminate the sharp edge on the piece, to increase  stiffness, and to improve appearance.  Seaming  is a related operation in which two  sheet-metal edges are assembled. Hemming and seaming are illustrated in Figure  19.17(a) and (b). "
    },
    {
        "type": "text",
        "text": "Curling , also called  beading , forms the edges of the part into a roll or curl, as in  Figure 19.17(c). As in hemming, it is done for purposes of safety, strength, and aes- thetics. Examples of products in which curling is used include hinges, pots and pans,  and pocket-watch cases. These examples show that curling can be performed over  straight or curved bend axes. "
    },
    {
        "type": "text",
        "text": "Miscellaneous Bending Operations  Various other bending operations are de- picted in Figure 19.18 to illustrate the variety of shapes that can be bent. Most of  these operations are performed in relatively simple dies similar to V-dies. "
    },
    {
        "type": "image",
        "img_path": "images/81c0d20ac2bc84f90dcb7527441560b3d055b751dabf131057e8de75a93ed9cb.jpg",
        "img_caption": "FIGURE 19.17  (a) Hemming, (b) seaming, and (c) curling. "
    },
    {
        "type": "image",
        "img_path": "images/65d620324bb43e85c56ba30c501f2a05feb525a63740a506d25062d241930ea5.jpg",
        "img_caption": "FIGURE 19.18  Miscellaneous bending operations: (a) channel bending, (b) U-bending,  (c) air bending, (d) offset bending, (e) corrugating, and (f) tube forming. Symbol: $F\\!=$   applied force. "
    },
    {
        "type": "text",
        "text": "Drawing is a sheet-metal-forming operation used to make cup-shaped, box-shaped,  or other complex-curved and concave parts. It is performed by placing a piece of  sheet metal over a die cavity and then pushing the metal into the opening with a  punch, as in Figure 19.19. The blank must usually be held down ﬂ  at against the die by  a blankholder. Common parts made by drawing include beverage cans, ammunition  shells, sinks, cooking pots, and automobile body panels. "
    },
    {
        "type": "text",
        "text": "19.3.1  MECHANICS OF DRAWING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Drawing of a cup-shaped part is the basic drawing operation, with dimensions and  parameters as pictured in Figure 19.19. A blank of diameter $D_{b}$  is drawn into a die cav- ity by means of a punch with diameter $D_{p}.$  The punch and die must have corner radii,  given by $R_{p}$  and $R_{d}$ . If the punch and die were to have sharp corners ( ${\\cal R}_{p}$  and $R_{d}=0$ ),  a hole-punching operation (and not a very good one) would be accomplished rather  than a drawing operation. The sides of the punch and die are separated by a clearance $c$ . This clearance in drawing is about $10\\%$  greater than the stock thickness: "
    },
    {
        "type": "image",
        "img_path": "images/d79001ce1fdc5f8b6d4afd580f3c2aa393c35e1da1b49e5db48fca6d8a1c158a.jpg",
        "img_caption": "FIGURE 19.19  (a) Drawing of a cup- shaped part: (1) start of  operation before punch  contacts work, and  (2) near end of stroke;  and (b) corresponding  work part: (1) starting  blank, and (2) drawn  part. Symbols:  $c=$   clearance, $D_{b}=$  blank  diameter, $D_{p}=$  punch  diameter, $R_{d}^{'}=$  die  corner radius, $R_{p_{\\ast}}\\mathrm{=}$   punch corner radius,  $F\\!=$  drawing force,  $F_{h}=$  holding force. "
    },
    {
        "type": "text",
        "text": "The punch applies a downward force $F$  to accomplish the deformation of the metal,  and a downward holding force  $F_{h}$  is applied by the blankholder, as shown in the  sketch. "
    },
    {
        "type": "text",
        "text": "As the punch proceeds downward toward its ﬁ  nal bottom position, the work ex- periences a complex sequence of stresses and strains as it is gradually formed into  the shape deﬁ  ned by the punch and die cavity. The stages in the deformation process  are illustrated in Figure 19.20. As the punch ﬁ  rst begins to push into the work, the  metal is subjected to a  bending  operation. The sheet is simply bent over the corner  of the punch and the corner of the die, as in Figure 19.20(2). The outside perimeter  of the blank moves in toward the center in this ﬁ  rst stage, but only slightly. "
    },
    {
        "type": "text",
        "text": "As the punch moves further down, a  straightening  action occurs in the metal that  was previously bent over the die radius, as in Figure 19.20(3). The metal at the bot- tom of the cup, as well as along the punch radius, has been moved downward with  the punch, but the metal that was bent over the die radius must now be straightened  in order to be pulled into the clearance to form the wall of the cylinder. At the same  time, more metal must be added to replace that being used in the cylinder wall. This  new metal comes from the outside edge of the blank. The metal in the outer portions  of the blank is pulled or  drawn  toward the die opening to resupply the previously  bent and straightened metal now forming the cylinder wall. This type of metal ﬂ  ow  through a constricted space gives the drawing process its name. "
    },
    {
        "type": "text",
        "text": "During this stage of the process, friction and compression play important roles in  the ﬂ  ange of the blank. In order for the material in the ﬂ  ange to move toward the  die opening,  friction  between the sheet metal and the surfaces of the blankholder  and the die must be overcome. Initially, static friction is involved until the metal  starts to slide; then, after metal ﬂ  ow begins, dynamic friction governs the process.  "
    },
    {
        "type": "image",
        "img_path": "images/5e1bd3a41b7f07a0933542fc1979ab7c72b8da52ec368acdf9549c11b20225b7.jpg",
        "img_caption": "FIGURE 19.20  Stages in deformation of the work in deep drawing: (1) punch just before contact with work, (2) bending,  (3) straightening, (4) friction and compression, and (5) ﬁ  nal cup shape showing effects of thinning in the cup walls.  Symbols: $V=$  motion of punch, $F\\!=$  punch force, $F_{h}=$  blankholder force. "
    },
    {
        "type": "text",
        "text": "The   magnitude of the holding force applied by the blankholder, as well as the fric- tion conditions at the two interfaces, are determining factors in the success of this as- pect of the drawing operation. Lubricants or drawing compounds are generally used  to reduce friction forces. In addition to friction,  compression  is also occurring in the  outer edge of the blank. As the metal in this portion of the blank is drawn toward the  center, the outer perimeter becomes smaller. Because the volume of metal remains  constant, the metal is squeezed and becomes thicker as the perimeter is reduced.  This often results in wrinkling of the remaining ﬂ  ange of the blank, especially when  thin sheet metal is drawn, or when the blankholder force is too low. It is a condition  which cannot be corrected once it has occurred. The friction and compression effects  are illustrated in Figure 19.20(4). "
    },
    {
        "type": "text",
        "text": "The holding force applied by the blankholder is now seen to be a critical factor  in deep drawing. If it is too small, wrinkling occurs. If it is too large, it prevents the  metal from ﬂ  owing properly toward the die cavity, resulting in stretching and pos- sible tearing of the sheet metal. Determining the proper holding force involves a  delicate balance between these opposing factors. "
    },
    {
        "type": "text",
        "text": "Progressive downward motion of the punch results in a continuation of the metal  ﬂ  ow caused by drawing and compression. In addition, some  thinning  of the cylinder  wall occurs, as in Figure 19.20(5). The force being applied by the punch is opposed  by the metal in the form of deformation and friction in the operation. A portion of  the deformation involves stretching and thinning of the metal as it is pulled over the  edge of the die opening. Up to $25\\%$  thinning of the side wall may occur in a success- ful drawing operation, mostly near the base of the cup. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "19.3.2  ENGINEERING ANALYSIS OF DRAWING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "It is important to assess the limitations on the amount of drawing that can be accom- plished. This is often guided by simple measures that can be readily calculated for a  given operation. In addition, drawing force and holding force are important process  variables. Finally, the starting blank size must be determined. "
    },
    {
        "type": "text",
        "text": "Measures of Drawing  One of the measures of the severity of a deep drawing op- eration is the  drawing ratio $D R$ .  This is most easily deﬁ  ned for a cylindrical shape as  the ratio of blank diameter  $D_{b}$  to punch diameter  $D_{p}$ .  In equation form, "
    },
    {
        "type": "equation",
        "text": "\n$$\nD R=\\frac{D_{b}}{D_{p}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The drawing ratio provides an indication, albeit a crude one, of the severity of a  given drawing operation. The greater the ratio, the more severe the operation. An  approximate upper limit on the drawing ratio is a value of 2.0. The actual limiting  value for a given operation depends on punch and die corner radii ( ${\\cal R}_{p}$  and $R_{d,}$ ), fric- tion conditions, depth of draw, and characteristics of the sheet metal (e.g., ductility,  degree of directionality of strength properties in the metal). "
    },
    {
        "type": "text",
        "text": "Another way to characterize a given drawing operation is by the  reduction   $r$ ,  where "
    },
    {
        "type": "equation",
        "text": "\n$$\nr=\\frac{D_{b}-D_{p}}{D_{b}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "It is very closely related to drawing ratio. Consistent with the previous limit on  $D R$ ( $(D R=2.0\\$ ), the value of reduction $r$  should be less than 0.50. "
    },
    {
        "type": "text",
        "text": "A third measure in deep drawing is the  thickness-to-diameter ratio   $t/D_{b}$  (thick- ness of the starting blank $t$  divided by the blank diameter $D_{b}$ ). Often expressed as  a percent, it is desirable for the  $\\mathit{t}/D_{b}$  ratio to be greater than  $1\\%$ . As  $\\mathit{t}/D_{b}$  decreases,  tendency for wrinkling (Section 19.3.4) increases. "
    },
    {
        "type": "text",
        "text": "In cases where these limits on drawing ratio, reduction, and  $\\mathit{t}/D_{b}$  ratio are exceeded  by the design of the drawn part, the blank must be drawn in two or more steps, some- times with annealing between the steps. "
    },
    {
        "type": "text",
        "text": "Example 19.3  Cup drawing ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A drawing operation is used to form a cylindrical cup with inside diameter $=$ $75\\,\\mathrm{mm}$  and height $=50\\:\\mathrm{mm}$ . The starting blank size $=138\\,\\mathrm{mm}$  and the stock  thickness $=2.4\\:\\mathrm{mm}$ . Based on these data, is the operation feasible? "
    },
    {
        "type": "text",
        "text": "Solution:  To assess feasibility, the drawing ratio, reduction, and thickness-to- diameter ratio is determined. "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\begin{array}{c}{{D R=138/75=1.84}}\\\\ {{r=(138-75)/138=0.4565=45.65\\%}}\\\\ {{t/D_{b}=2.4/138=0.017=1.7\\%}}\\end{array}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "According to these measures, the drawing operation is feasible. The draw- ing ratio is less than 2.0, the reduction is less than $50\\%$ , and the $t/D_{b}$  ratio is  greater than $1\\%$ . These are general guidelines frequently used to indicate  technical feasibility. "
    },
    {
        "type": "text",
        "text": "Forces  The  drawing force  required to perform a given operation can be estimated  roughly by the formula: "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=\\pi D_{p}t\\;(T S)\\biggl(\\frac{D_{b}}{D_{p}}-0.7\\biggr)\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $F=$  drawing force, $\\mathbf{N}\\left(\\mathbf{lb}\\right)\\!;t=$  original blank thickness, mm (in);  $T S=$  tensile  strength, MPa  $\\left(1\\mathbf{b}/\\mathrm{in}^{2}\\right)$ ; and  $D_{b}$  and  $D_{p}$  are the starting blank diameter and punch  diameter, respectively, mm (in). The constant 0.7 is a correction factor to account for  friction. Equation (19.12) estimates the maximum force in the operation. The draw- ing force varies throughout the downward movement of the punch, usually reaching  its maximum value at about one-third the length of the punch stroke. "
    },
    {
        "type": "text",
        "text": "The  holding force  is an important factor in a drawing operation. As a rough  approximation, the holding pressure can be set at a value  $\\,=\\,0.015$  of the yield  strength of the sheet metal [9]. This value is then multiplied by that portion of the  starting area of the blank that is to be held by the blankholder. In equation form, "
    },
    {
        "type": "equation",
        "text": "\n$$\nF_{h}=0.015Y\\pi\\{D_{b}^{2}-(D_{p}+2.2t+2R_{d})^{2}\\}\n$$\n }  ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $F_{h}=$  holding force in drawing,  $\\mathbf{N}$  (lb);  $Y=$  yield strength of the sheet metal,  MPa  $\\mathrm{(lb/in^{2})}$ ); $t=$  starting stock thickness, mm (in);  $R_{d}=$  die corner radius, mm (in);  and the other terms have been previously deﬁ  ned. The holding force is usually about  one-third the drawing force [10]. "
    },
    {
        "type": "text",
        "text": "Example 19.4  Forces in deep  ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "For the drawing operation of Example 19.3, determine (a) drawing force and  (b) holding force, given that the tensile strength of the sheet metal (low-carbon  steel) $=300$  MPa and yield strength $=175$  MPa. The die corner radius  $=$   $6\\,\\mathrm{mm}$ . "
    },
    {
        "type": "text",
        "text": "Solution:  (a) Maximum drawing force is given by Equation (19.12): "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=\\pi(75)(2.4)(300)\\left({\\frac{138}{75}}-0.7\\right)=193,396\\;\\mathrm{N}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "(b) Holding force is estimated by Equation (19.13): $F_{h}=0.015(175)\\,p(138^{2}-(75+2.2\\times2.4+2\\times6)^{2})=\\mathbf{86.824}\\,\\mathbf{N}$ "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Blank Size Determination  For the ﬁ  nal dimensions to be achieved on the cylin- drical drawn shape, the correct starting blank diameter is needed. It must be large  enough to supply sufﬁ  cient metal to complete the cup. Yet if there is too much material,  unnecessary waste will result. For drawn shapes other than cylindrical cups, the same  problem of estimating the starting blank size exists, only the shape of the blank may  be other than round. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "The following is a reasonable method for estimating the starting blank diameter  in a deep drawing operation that produces a round part (e.g., cylindrical cup and  more complex shapes so long as they are axisymmetric). Because the volume of the  ﬁ  nal product is the same as that of the starting sheet-metal blank, then the blank  diameter can be calculated by setting the initial blank volume equal to the ﬁ  nal  volume of the product and solving for diameter $D_{b}$ . To facilitate the calculation, it is  often assumed that negligible thinning of the part wall occurs. "
    },
    {
        "type": "text",
        "text": "19.3.3 OTHER DRAWING OPERATIONS",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The discussion has focused on a conventional cup-drawing operation that produces  a simple cylindrical shape in a single step and uses a blankholder to facilitate the  process. Some of the variations of this basic operation are considered in this section. "
    },
    {
        "type": "text",
        "text": "Redrawing  If the shape change required by the part design is too severe (drawing  ratio is too high), complete forming of the part may require more than one drawing  step. The second drawing step, and any further drawing steps if needed, are referred  to as  redrawing . A redrawing operation is illustrated in Figure 19.21. "
    },
    {
        "type": "text",
        "text": "When the part design indicates a drawing ratio that is too large to form the part  in a single step, the following is a general guide to the amount of reduction that can  be taken in each drawing operation [10]: For the ﬁ  rst draw, the maximum reduction  of the starting blank should be $40\\%$  to $45\\%$ ; for the second draw (ﬁ  rst redraw), the  maximum reduction should be  $30\\%$ ; and for the third draw (second redraw), the  maximum reduction should be $16\\%$ . "
    },
    {
        "type": "text",
        "text": "A related operation is  reverse drawing , in which a drawn part is positioned face  down on the die so that the second drawing operation produces a conﬁ  guration such  as that shown in Figure 19.22. Although it may seem that reverse drawing would  produce a more severe deformation than redrawing, it is actually easier on the metal.  The reason is that the sheet metal is bent in the same direction at the outside and  inside corners of the die in reverse drawing; while in redrawing the metal is bent  in the opposite directions at the two corners. Because of this difference, the metal  experiences less strain hardening in reverse drawing and the drawing force is lower. "
    },
    {
        "type": "text",
        "text": "FIGURE 19.21  Redrawing of a cup:  (1) start of redraw,  and (2) end of stroke.  Symbols: $V=$  punch  velocity, $F\\!=$  applied  punch force, $\\bar{F}_{h}=$   blankholder force. "
    },
    {
        "type": "image",
        "img_path": "images/e904891cbeb6dafec89e8c9254c83e37811231e754a31a962e5c323a79b1e49a.jpg",
        "img_caption": ""
    },
    {
        "type": "image",
        "img_path": "images/c1474b019c00576c90636a0d04c468394f0e168b321ce09b90c649378926ed21.jpg"
    },
    {
        "type": "image",
        "img_path": "images/c81185609707e111754b5ad9cc09fed3ee6166197524d15c1942386ce6593feb.jpg",
        "img_caption": "FIGURE 19.22  Reverse  drawing: (1) start and  (2) completion. Symbols:  $V=$  punch velocity,  $F\\!=$  applied punch force,  $F_{h}=$  blankholder force. "
    },
    {
        "type": "text",
        "text": "Drawing of Shapes Other than Cylindrical Cups  Many products require draw- ing of shapes other than cylindrical cups. The variety of drawn shapes include square  or rectangular boxes (as in sinks), stepped cups, cones, cups with spherical rather  than ﬂ  at bases, and irregular curved forms (as in automobile body panels). Each  shape presents unique technical problems in drawing. Eary and Reed [2] provide a  detailed discussion of the drawing of these kinds of shapes. "
    },
    {
        "type": "text",
        "text": "Drawing Without a Blankholder  One of the primary functions of the blankhold- er is to prevent wrinkling of the ﬂ  ange while the cup is being drawn. The tendency  for wrinkling is reduced as the thickness-to-diameter ratio of the blank increases. If  the $t/D_{b}$  ratio is large enough, drawing can be accomplished without a blankholder,  as in Figure 19.23. The limiting condition for drawing without a blankholder can be  estimated from the following [5]: "
    },
    {
        "type": "equation",
        "text": "\n$$\nD_{b}-D_{p}<5t\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The draw die must have the shape of a funnel or cone to permit the material to be  drawn properly into the die cavity. When drawing without a blankholder is feasible,  it has the advantages of lower cost tooling and a simpler press, because the need to  separately control the movements of the blankholder and punch can be avoided. "
    },
    {
        "type": "image",
        "img_path": "images/749b9086e477738fa712160f5bdd1afb84fd23688c669a788b313dc272572434.jpg",
        "img_caption": "FIGURE 19.23  Drawing  without a blankholder:  (1) start of process, (2) end  of stroke.   Symbols  v  and  F    indicate motion and  applied force, respectively. "
    },
    {
        "type": "image",
        "img_path": "images/9e0e7c2286570808e3679e21fd936133db63eca7962048fe8078fa9ca96536fd.jpg",
        "img_caption": "FIGURE 19.24  Common defects in drawn parts: (a) wrinkling can occur either in the ﬂ  ange or (b) in the wall,  (c) tearing, (d) earing, and (e) surface scratches. "
    },
    {
        "type": "text",
        "text": "19.3.4  DEFECTS IN DRAWING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Sheet-metal drawing is a more complex operation than cutting or bending, and  more things can go wrong. A number of defects can occur in a drawn product, some  of which have already been alluded to. Following is a list of common defects, with  sketches in Figure 19.24:\n\n "
    },
    {
        "type": "text",
        "text": "(a)  Wrinkling in the ﬂ  ange . Wrinkling in a drawn part consists of a series of ridges  that form radially in the undrawn ﬂ  ange of the work part due to compressive  buckling.\n\n (b)  Wrinkling in the wall . If and when the wrinkled ﬂ  ange is drawn into the cup,  these ridges appear in the vertical wall.\n\n (c)  Tearing . Tearing is an open crack in the vertical wall, usually near the base of  the drawn cup, due to high tensile stresses that cause thinning and failure of the  metal at this location. This type of failure can also occur as the metal is pulled  over a sharp die corner.\n\n (d)  Earing . This is the formation of irregularities (called  ears ) in the upper edge  of a deep drawn cup, caused by anisotropy in the sheet metal. If the material is  perfectly isotropic, ears do not form.\n\n (e)  Surface scratches . Surface scratches can occur on the drawn part if the punch  and die are not smooth or if lubrication is insufﬁ  cient. "
    },
    {
        "type": "text",
        "text": " Other Sheet-Metal-Forming Operations ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "In addition to bending and drawing, several other sheet-metal forming operations can  be accomplished on conventional presses. These are classiﬁ  ed as (1) operations per- formed with metal tooling and (2) operations performed with ﬂ  exible rubber tooling. "
    },
    {
        "type": "text",
        "text": "19.4.1 OPERATIONS PERFORMED WITH METAL TOOLING",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Operations performed with metal tooling include (1) ironing, (2) coining and em- bossing, (3) lancing, and (4) twisting. "
    },
    {
        "type": "text",
        "text": "Ironing  In deep drawing the ﬂ  ange is compressed by the squeezing action of the  blank perimeter seeking a smaller circumference as it is drawn toward the die open- ing. Because of this compression, the sheet metal near the outer edge of the blank  "
    },
    {
        "type": "image",
        "img_path": "images/01a5ef5e3ad506101c78f8b7206eb70b63347a5ca436bd573e34be72c751d216.jpg",
        "img_caption": "FIGURE 19.25  Ironing to  achieve a more uniform wall  thickness in a drawn cup:  (1) start of process; (2) during  process. Note thinning and  elongation of walls. Symbols  v  and $F$  indicate motion and  applied force, respectively. "
    },
    {
        "type": "text",
        "text": "becomes thicker as it moves inward. If the thickness of this stock is greater than the  clearance between the punch and die, it will be squeezed to the size of the clearance,  a process known as  ironing . "
    },
    {
        "type": "text",
        "text": "Sometimes ironing is performed as a separate step that follows drawing. This case  is illustrated in Figure 19.25. Ironing makes the cylindrical cup more uniform in wall  thickness. The drawn part is therefore longer and more efﬁ  cient in terms of material  usage. Beverage cans and artillery shells, two very high-production items, include  ironing among their processing steps to achieve economy in material usage. "
    },
    {
        "type": "text",
        "text": "Coining and Embossing  Coining is a bulk deformation operation discussed in  the previous chapter. It is frequently used in sheet-metal work to form indentations  and raised sections in the part. The indentations result in thinning of the sheet metal,  and the raised sections result in thickening of the metal. "
    },
    {
        "type": "text",
        "text": "Embossing  is a forming operation used to create indentations in the sheet, such  as raised (or indented) lettering or strengthening ribs, as depicted in Figure 19.26.  Some stretching and thinning of the metal are involved. This operation may seem  similar to coining. However, embossing dies possess matching cavity contours, the  punch containing the positive contour and the die containing the negative; whereas  coining dies may have quite different cavities in the two die halves, thus causing  more signiﬁ  cant metal deformation than embossing. "
    },
    {
        "type": "text",
        "text": "Lancing  Lancing is a combined cutting and bending or cutting and forming opera- tion performed in one step to partially separate the metal from the sheet. Several ex- amples are shown in Figure 19.27. Among other applications, lancing is used to make  louvers in sheet-metal air vents for heating and air conditioning systems in buildings. "
    },
    {
        "type": "image",
        "img_path": "images/1fef90f432d316d165142af3d896109d8218ec2aa4eabda2f762091dda38ccfc.jpg",
        "img_caption": "FIGURE 19.26  Embossing: (a) cross  section of punch and  die conﬁ  guration   during  pressing; (b) ﬁ  nished  part with embossed ribs. "
    },
    {
        "type": "image",
        "img_path": "images/d5b7f4fe0f9f4efc18b472263358d51bc35b454dca13f2130974059fb71ca142.jpg"
    },
    {
        "type": "image",
        "img_path": "images/381b101cecd3c1d608a3ecaea6d6837c548b6f92abd3d4b81a105ea8d390765b.jpg",
        "img_caption": "FIGURE 19.27  Lancing in several  forms: (a) cutting and  bending; (b) and (c) two  types of cutting and  forming. "
    },
    {
        "type": "text",
        "text": "Twisting  Twisting subjects the sheet metal to a torsion loading rather than a bend- ing load, thus causing a twist in the sheet over its length. This type of operation has  limited applications. It is used to make such products as fan and propeller blades.  It can be performed in a conventional punch and die which has been designed to  deform the part in the required twist shape. "
    },
    {
        "type": "text",
        "text": "19.4.2  RUBBER FORMING PROCESSES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The two operations discussed in this article are performed on conventional presses,  but the tooling is unusual in that it uses a ﬂ  exible element (made of rubber or similar  material) to effect the forming operation. The operations are (1) the Guerin process,  and (2) hydroforming. "
    },
    {
        "type": "text",
        "text": "Guerin Process  The  Guerin process  uses a thick rubber pad (or other ﬂ  exible mate- rial) to form sheet metal over a positive form block, as in Figure 19.28. The rubber pad  is conﬁ  ned in a steel container. As the ram descends, the rubber gradually surrounds  the sheet, applying pressure to deform it to the shape of the form block. It is limited to  relatively shallow forms, because the pressures developed by the rubber—up to about  $10\\,\\mathrm{MPa}$   $(1500\\,\\mathrm{lb/in^{2}})$  —are not sufﬁ  cient to prevent wrinkling in deeper formed parts. "
    },
    {
        "type": "text",
        "text": "The advantage of the Guerin process is the relatively low cost of the tooling.  The form block can be made of wood, plastic, or other materials that are easy to  shape, and the rubber pad can be used with different form blocks. These factors  "
    },
    {
        "type": "image",
        "img_path": "images/216e91f53be6748bda896afb13fbb2bd8c7d48b0446a1a00b8907cabf2a8fe99.jpg",
        "img_caption": "FIGURE 19.28  Guerin  process: (1) before  and (2) after. Symbols  v  and  F  indicate   motion  and applied force  respectively. "
    },
    {
        "type": "image",
        "img_path": "images/9917283c51aa1577b34cc8a9faeb5d6df8e88ce23daf35ff6ab05e48284415e8.jpg",
        "img_caption": "FIGURE 19.29  Hydroform process: (1) start-up, no ﬂ  uid in cavity; (2) press closed, cavity  pressurized with hydraulic ﬂ  uid; (3) punch pressed into work to form part. Symbols: $V=$  velocity,  $F\\!=$   applied force, $p=$  hydraulic pressure. "
    },
    {
        "type": "text",
        "text": "make rubber forming attractive in small-quantity production, such as the aircraft  industry, where the process was developed. "
    },
    {
        "type": "text",
        "text": "Hydroforming  Hydroforming is similar to the Guerin process; the difference  is that it substitutes a rubber diaphragm ﬁ  lled with hydraulic ﬂ  uid in place of the  thick rubber pad, as illustrated in Figure 19.29. This allows the pressure that forms  the work part to be increased—to around  $100\\;\\mathrm{MPa}$  ( $\\cdot15{,}000\\ \\mathrm{lb/in}^{2}\\$ ) —thus prevent- ing wrinkling in deep formed parts. In fact, deeper draws can be achieved with the  hydroform process than with conventional deep drawing. This is because the uni- form pressure in hydroforming forces the work to contact the punch throughout its  length, thus increasing friction and reducing the tensile stresses that cause tearing at  the base of the drawn cup. "
    },
    {
        "type": "text",
        "text": " Dies and Presses for Sheet-Metal Processes ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "This section examines the punch-and-die tooling and production equipment used in  conventional sheet-metal processing. "
    },
    {
        "type": "text",
        "text": "19.5.1  DIES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Nearly all of the preceding pressworking operations are performed with conventional  punch-and-die tooling. The tooling is referred to as a  die . It is custom-  designed for  the particular part to be produced. The term  stamping die  is sometimes used for high- production dies. Typical materials for stamping dies are tool steel types D, A, O, and  S (Table 6.5). "
    },
    {
        "type": "text",
        "text": "Components of a Stamping Die  The components of a stamping die to perform  a simple blanking operation are illustrated in Figure 19.30. The working components  are the  punch  and  die , which perform the cutting operation. They are attached to  "
    },
    {
        "type": "image",
        "img_path": "images/ad5b406287c0422b07a6d716257e3ef4107701464a4c80568af0eb44e00268ea.jpg",
        "img_caption": "FIGURE 19.30  Components of a punch  and die for a blanking  operation. "
    },
    {
        "type": "text",
        "text": "the upper and lower portions of the  die set , respectively called the  punch holder  (or  upper shoe ) and  die holder  ( lower shoe ). The die set also includes guide pins and  bushings to ensure proper alignment between the punch and die during the stamping  operation. The die holder is attached to the base of the press, and the punch holder is  attached to the ram. Actuation of the ram accomplishes the pressworking operation. "
    },
    {
        "type": "text",
        "text": "In addition to these components, a die used for blanking or hole-punching must  include a means of preventing the sheet metal from sticking to the punch when it is  retracted upward after the operation. The newly created hole in the stock is the same  size as the punch, and it tends to cling to the punch on its withdrawal. The device  in the die that strips the sheet metal from the punch is called a  stripper . It is often  a simple plate attached to the die as in Figure 19.30, with a hole slightly larger than  the punch diameter. "
    },
    {
        "type": "text",
        "text": "For dies that process strips or coils of sheet metal, a device is required to stop the  sheet metal as it advances through the die between press cycles. That device is called  (try to guess) a  stop . Stops range from simple solid pins located in the path of the  strip to block its forward motion, to more complex mechanisms synchronized to rise  and retract with the actuation of the press. The simpler stop is shown in Figure 19.30. "
    },
    {
        "type": "text",
        "text": "There are other components in pressworking dies, but the preceding description  provides an introduction to the terminology. "
    },
    {
        "type": "text",
        "text": "Types of Stamping Dies  Aside from differences in stamping dies related to the  operations they perform (e.g., cutting, bending, drawing), other differences deal with  the number of separate operations to be performed in each press actuation and how  they are accomplished. "
    },
    {
        "type": "text",
        "text": "The type of die considered above performs a single blanking operation with each  stroke of the press and is called a  simple die . Other dies that perform a single opera- tion include V-dies (Section 19.2.1). More complicated pressworking dies include  compound dies, combination dies, and progressive dies. A  compound die  performs  two operations at a single station, such as blanking and punching, or blanking and  drawing [2]. A good example is a compound die that blanks and punches a washer.  A  combination die  is less common; it performs two operations at two different sta- tions in the die. Examples of applications include blanking two different parts (e.g.,  right-hand and left-hand parts), or blanking and then bending the same part [2]. "
    },
    {
        "type": "image",
        "img_path": "images/4c5ed4d2e237340866f1b40d1ff57988b907511e3ec9b6dc14dbc82df1250c35.jpg",
        "img_caption": "FIGURE 19.31  (a) Progressive die  and (b) associated  strip development. "
    },
    {
        "type": "text",
        "text": "A  progressive die  performs two or more operations on a sheet-metal coil at two  or more stations with each press stroke. The part is fabricated progressively. The coil  is fed from one station to the next and different operations (e.g., punching, notching,  bending, and blanking) are performed at each station. When the part exits the ﬁ  nal  station it has been completed and separated (cut) from the remaining coil. Design of  a progressive die begins with the layout of the part on the strip or coil and the deter- mination of which operations are to be performed at each station. The result of this  procedure is called the  strip development . A progressive die and associated strip de- velopment are illustrated in Figure 19.31. Progressive dies can have a dozen or more  stations. They are the most complicated and most costly stamping dies, economically  justiﬁ  ed only for complex parts requiring multiple operations at high-production  rates. "
    },
    {
        "type": "text",
        "text": "19.5.2  PRESSES "
    },
    {
        "type": "text",
        "text": "A press used for sheet metalworking is a machine tool with a stationary  bed  and a  powered  ram  (or  slide ) that can be driven toward and away from the bed to perform  various cutting and forming operations. A typical press, with principal components  labeled, is diagrammed in Figure 19.32. The relative positions of the bed and ram are  established by the  frame , and the ram is driven by mechanical or hydraulic power.  When a die is mounted in the press, the punch holder is attached to the ram, and the  die holder is attached to a  bolster plate  of the press bed. "
    },
    {
        "type": "text",
        "text": "Presses are available in a variety of capacities, power systems, and frame types.  The capacity of a press is its ability to deliver the required force and energy to  "
    },
    {
        "type": "image",
        "img_path": "images/88561b98404c92648d1a999aaed432fa1b20a8e253d8ba88f567e65faa104fee.jpg",
        "img_caption": "FIGURE 19.32  Components  of a typical (mechanical drive)  stamping press. "
    },
    {
        "type": "text",
        "text": "accomplish the stamping operation. This is determined by the physical size of the  press and by its power system. The power system refers to whether mechanical or  hydraulic power is used and the type of drive used to transmit the power to the ram.  Production rate is another important aspect of capacity. Type of frame refers to the  physical construction of the press. There are two frame types in common use: gap  frame and straight-sided frame. "
    },
    {
        "type": "text",
        "text": "Gap Frame Presses  The  gap frame  has the general conﬁ  guration of the letter C  and is often referred to as a $c$ -frame . Gap frame presses provide good access to the  die, and they are usually open in the back to permit convenient ejection of stampings  or scrap. The principal types of gap frame press are (a) solid gap frame, (b) adjust- able bed, (c) open back inclinable, (d) press brake, and (e) turret press. "
    },
    {
        "type": "text",
        "text": "The  solid gap frame  (sometimes called simply a  gap press ) has one-piece con- struction, as shown in Figure 19.32. Presses with this frame are rigid, yet the C-shape  allows convenient access from the sides for feeding strip or coil stock. They are avail- able in a range of sizes, with capacities up to around  $9000\\,\\mathrm{kN}$  (1000 tons). The model  shown in Figure 19.33 has a capacity of  $1350~\\mathrm{kN}$  (150 tons). The  adjustable bed  frame  press is a variation of the gap frame, in which an adjustable bed is added to ac- commodate various die sizes. The adjustment feature results in some sacriﬁ  ce of ton- nage capacity. The  open-back inclinable  press has a C-frame assembled to a base in  such a way that the frame can be tilted back to various angles so that the stampings  fall through the rear opening by gravity. Capacities of OBI presses range between  one ton and around $2250\\,\\mathrm{kN}$  (250 tons). They can be operated at high speeds—up to  around 1000 strokes per minute. "
    },
    {
        "type": "text",
        "text": "The  press brake  is a gap frame press with a very wide bed, as shown in Figure 19.34.  This allows a number of separate dies (simple V-bending dies are typical) to be set  up in the bed, so that small quantities of stampings can be made economically. These  low quantities of parts, sometimes requiring multiple bends at different angles, ne- cessitate a manual operation. For a part requiring a series of bends, the operator  moves the starting piece of sheet metal through the desired sequence of bending  dies, actuating the press at each die, to complete the work needed. "
    },
    {
        "type": "image",
        "img_path": "images/4501d8222f39dbe6542cb4ac88f2c80038eb804f8854ba98e3774e1334c1378d.jpg",
        "img_caption": "FIGURE 19.33  Gap  frame press for sheet  metalworking. (Photo  courtesy of BCN  Technology Services).  Capacity $\\stackrel{\\cdot\\cdot}{=}1350\\;\\mathrm{kN}$   (150 tons). "
    },
    {
        "type": "image",
        "img_path": "images/827dafab0006aef6c73fdb5d8ff0a642e64b34e1323c6685c39315972fffe3ed.jpg",
        "img_caption": "FIGURE 19.34  Press  brake. (Photo courtesy  of Strippit, Inc.) "
    },
    {
        "type": "image",
        "img_path": "images/6ef7080dfb1ac82c1841906550a4e6ecf10a0820a3b3e78decff299bc19773b6.jpg",
        "img_caption": "FIGURE 19.35  Several sheet-metal  parts produced on a  turret press, showing  variety of possible hole  shapes. (Photo  courtesy of Strippit,  Inc.) "
    },
    {
        "type": "text",
        "text": "Whereas press brakes are well adapted to bending operations,  turret presses  are  suited to situations in which a sequence of punching, notching, and related cutting  operations must be accomplished on sheet-metal parts, as in Figure 19.35. Turret  presses have a C-frame, although this construction is not obvious in Figure 19.36.  The conventional ram and punch is replaced by a turret containing many punches  of different sizes and shapes. The turret works by indexing (rotating) to the position  holding the punch to perform the required operation. Beneath the punch turret is  a corresponding die turret that positions the die opening for each punch. Between  the punch and die is the sheet-metal blank, held by an $x{-}y$  positioning system that  operates by computer numerical control (Section 37.3). The blank is moved to the  required coordinate position for each cutting operation. "
    },
    {
        "type": "text",
        "text": "Straight-sided Frame Presses  For jobs requiring high tonnage, press frames with  greater structural rigidity are needed. Straight-sided presses have full sides, giving  it a box-like appearance as in Figure 19.37. This construction increases the strength  and stiffness of the frame. As a result, capacities up to  $35{,}000~\\mathrm{kN}$  (4000 tons) are  available in straight-sided presses for sheet metalwork. Large presses of this frame  type are used for forging (Section 18.3). "
    },
    {
        "type": "text",
        "text": "In all of these presses, gap frame and straight-sided frame, the size is closely cor- related to tonnage capacity. Larger presses are built to withstand higher forces in  pressworking. Press size is also related to the speed at which it can operate. Smaller  presses are generally capable of higher production rates than larger presses. "
    },
    {
        "type": "text",
        "text": "Power and Drive Systems  Power systems on presses are either hydraulic or me- chanical.  Hydraulic presses  use a large piston and cylinder to drive the ram. This  "
    },
    {
        "type": "image",
        "img_path": "images/48712f083351f6973735ca8ee00df3ab09175a8e15e118de64f294a8c3afa235.jpg",
        "img_caption": "FIGURE 19.36  Computer numerical  control turret press.  (Photo courtesy of  Strippit, Inc.) "
    },
    {
        "type": "image",
        "img_path": "images/b16f34ac4cd497f70271cff22defa733b611fd5613d5a4709385dcfe0ee9caa6.jpg",
        "img_caption": "FIGURE 19.37  Straight-sided frame  press. (Photo courtesy  of Greenerd Press &  Machine Company,  Inc.) "
    },
    {
        "type": "image",
        "img_path": "images/fb007cb2100187d7a6e2a176e6f48402ea817745f28239c66dee3b9ba1bfe619.jpg",
        "img_caption": "FIGURE 19.38  Types  of drives for sheet-  metal presses:  (a) eccentric, (b) crankshaft, and  (c) knuckle joint. "
    },
    {
        "type": "text",
        "text": "power system typically provides longer ram strokes than mechanical drives and can  develop the full tonnage force throughout the entire stroke. However, it is slower. Its  application for sheet metal is normally limited to deep drawing and other forming  operations where these load-stroke characteristics are advantageous. These presses  are available with one or more independently operated slides, called single action  (single slide), double action (two slides), and so on. Double-action presses are use- ful in deep drawing operations where it is required to separately control the punch  force and the blankholder force. "
    },
    {
        "type": "text",
        "text": "There are several types of drive mechanisms used on  mechanical presses . These  include eccentric, crankshaft, and knuckle joint, illustrated in Figure 19.38. They con- vert the rotational motion of a drive motor into the linear motion of the ram. A  ﬂ  ywheel  is used to store the energy of the drive motor for use in the stamping opera- tion. Mechanical presses using these drives achieve very high forces at the bottom  of their strokes, and are therefore quite suited to blanking and punching operations.  The knuckle joint delivers very high force when it bottoms, and is therefore often  used in coining operations. "
    },
    {
        "type": "text",
        "text": "Sheet-Metal Operations Not Performed on  Presses ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A number of sheet-metal operations are not performed on conventional stamping  presses. This section examines several of these processes: (1) stretch forming, (2) roll  bending and forming, (3) spinning, and (4) high-energy-rate forming processes. "
    },
    {
        "type": "text",
        "text": "19.6.1  STRETCH FORMING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Stretch forming is a sheet-metal deformation process in which the sheet metal is  intentionally stretched and simultaneously bent in order to achieve shape change.  The process is illustrated in Figure 19.39 for a relatively simple and gradual bend.  The work part is gripped by one or more jaws on each end and then stretched and  bent over a positive die containing the desired form. The metal is stressed in ten- sion to a level above its yield point. When the tension loading is released, the metal  has been plastically deformed. The combination of stretching and bending results in  relatively little springback in the part. An estimate of the force required in stretch  "
    },
    {
        "type": "image",
        "img_path": "images/fa7e6ae1ce80c85b429ee7c1776ea1e02dea6283671be37bab00191624f27ee4.jpg",
        "img_caption": "FIGURE 19.39  Stretch  forming: (1) start of  process; (2) form die is  pressed into the work  with force $F_{\\mathrm{det}},$  causing  it to be stretched and  bent over the form. $F\\!=$   stretching force. "
    },
    {
        "type": "text",
        "text": "forming can be obtained by multiplying the cross-sectional area of the sheet in the  direction of pulling by the ﬂ  ow stress of the metal. In equation form, "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\boldsymbol{F}=\\boldsymbol{L}t\\boldsymbol{Y}_{f}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $F=$  stretching force, N (lb);  $L=$ length of the sheet in the direction perpen- dicular to stretching, mm (in); $t=$  instantaneous stock thickness, mm (in); and  $Y_{f}=$ ﬂ  ow stress of the work metal, MPa  $\\mathrm{(lb/in^{2})}$ ). The die force $F_{\\mathrm{dire}}$  shown in the ﬁ  gure can  be determined by balancing vertical force components. "
    },
    {
        "type": "text",
        "text": "More complex contours than that shown in the ﬁ  gure are possible by stretch form- ing, but there are limitations on how sharp the curves in the sheet can be. Stretch  forming is widely used in the aircraft and aerospace industries to economically pro- duce large sheet-metal parts in the low quantities characteristic of those industries. "
    },
    {
        "type": "text",
        "text": "19.6.2  ROLL BENDING AND ROLL FORMING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The operations described in this section use rolls to form sheet metal.  Roll bending   is an operation in which (usually) large sheet-metal or plate-metal parts are formed  into curved sections by means of rolls. One possible arrangement of the rolls is pic- tured in Figure 19.40. As the sheet passes between the rolls, the rolls are brought  toward each other to a conﬁ  guration that achieves the desired radius of curvature  on the work. Components for large storage tanks and pressure vessels are fabricated  by roll bending. The operation can also be used to bend structural shapes, railroad  rails, and tubes. "
    },
    {
        "type": "text",
        "text": "A related operation is  roll straightening  in which nonﬂ  at sheets (or other cross- sectional forms) are straightened by passing them between a series of rolls. The rolls  subject the work to a sequence of decreasing small bends in opposite directions, thus  causing it to be straight at the exit. "
    },
    {
        "type": "text",
        "text": "Roll forming  (also called  contour roll forming ) is a continuous bending proc- ess in which opposing rolls are used to produce long sections of formed shapes  from coil or strip stock. Several pairs of rolls are usually required to progressively  "
    },
    {
        "type": "image",
        "img_path": "images/2353c14a25d05f70623e87cccbe428c119c8c6abb4ec436c0f94f589ff9604d4.jpg",
        "img_caption": "FIGURE 19.40  Roll bending. "
    },
    {
        "type": "image",
        "img_path": "images/652253c9f1f9d0dca7040de168288d1805de035662cb205d1e30891cbf9cb801.jpg",
        "img_caption": "FIGURE 19.41  Roll forming of a continuous channel section: (1) straight rolls, (2) partial form, and (3) ﬁ  nal form. "
    },
    {
        "type": "text",
        "text": "accomplish the bending of the stock into the desired shape. The process is illustrated  in Figure 19.41 for a U-shaped section. Products made by roll forming include chan- nels, gutters, metal siding sections (for homes), pipes and tubing with seams, and  various structural sections. Although roll forming has the general appearance of a  rolling operation (and the tooling certainly looks similar), the difference is that roll  forming involves bending rather than compressing the work. "
    },
    {
        "type": "text",
        "text": "19.6.3  SPINNING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Spinning is a metal-forming process in which an axially symmetric part is gradually  shaped over a mandrel or form by means of a rounded tool or roller. The tool or  roller applies a very localized pressure (almost a point contact) to deform the work  by axial and radial motions over the surface of the part. Basic geometric shapes  typically produced by spinning include cups, cones, hemispheres, and tubes. There  are three types of spinning operations: (1) conventional spinning, (2) shear spinning,  and (3) tube spinning. "
    },
    {
        "type": "text",
        "text": "Conventional Spinning  Conventional spinning is the basic spinning operation.  As illustrated in Figure 19.42, a sheet-metal disk is held against the end of a rotating  mandrel of the desired inside shape of the ﬁ  nal part, while the tool or roller deforms  the metal against the mandrel. In some cases, the starting work part is other than a  ﬂ  at disk. The process requires a series of steps, as indicated in the ﬁ  gure, to complete  "
    },
    {
        "type": "image",
        "img_path": "images/b09f44abf2fe151efde9bcf316d7966ccd76e683adfd2a5a4893405bb0898770.jpg",
        "img_caption": "FIGURE 19.42  Conventional  spinning: (1) setup at  start of process;  (2) during spinning; and  (3) completion of  process. "
    },
    {
        "type": "text",
        "text": "the shaping of the part. The tool position is controlled either by a human operator,  using a ﬁ  xed fulcrum to achieve the required leverage, or by an automatic method  such as numerical control. These alternatives are  manual spinning  and  power spin- ning . Power spinning has the capability to apply higher forces to the operation, re- sulting in faster cycle times and greater work size capacity. It also achieves better  process control than manual spinning. "
    },
    {
        "type": "text",
        "text": "Conventional spinning bends the metal around a moving circular axis to conform  to the outside surface of the axisymmetric mandrel. The thickness of the metal there- fore remains unchanged (more or less) relative to the starting disk thickness. The  diameter of the disk must therefore be somewhat larger than the diameter of the  resulting part. The required starting diameter can be ﬁ  gured by assuming constant  volume, before and after spinning. "
    },
    {
        "type": "text",
        "text": "Applications of conventional spinning include production of conical and curved  shapes in low quantities. Very large diameter parts—up to  $5\\;\\mathrm{m}$  (15 ft) or more—can  be made by spinning. Alternative sheet-metal processes would require excessively  high die costs. The form mandrel in spinning can be made of wood or other soft mate- rials that are easy to shape. It is therefore a low-cost tool compared to the punch and  die required for deep drawing, which might be a substitute process for some parts. "
    },
    {
        "type": "text",
        "text": "Shear Spinning  In shear spinning, the part is formed over the mandrel by a shear  deformation process in which the outside diameter remains constant and the wall  thickness is therefore reduced, as in Figure 19.43. This shear straining (and conse- quent thinning of the metal) distinguishes this process from the bending action in  conventional spinning. Several other names have been used for shear spinning, in- cluding  ﬂ  ow turning ,  shear forming , and  spin forging . The process has been applied  in the aerospace industry to form large parts such as rocket nose cones. "
    },
    {
        "type": "text",
        "text": "For the simple conical shape in the ﬁ  gure, the resulting thickness of the spun wall  can be readily determined by the sine law relationship: "
    },
    {
        "type": "equation",
        "text": "\n$$\nt_{f}=t\\sin a\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $t_{f}=$  the ﬁ  nal thickness of the wall after spinning, $t=$  the starting thickness of  the disk, and  $a=$  the mandrel angle (actually the half angle). Thinning is sometimes  quantiﬁ  ed by the spinning reduction $r$ : "
    },
    {
        "type": "equation",
        "text": "\n$$\nr{=}\\ {\\frac{t\\ {-}\\ t_{f}}{t}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "image",
        "img_path": "images/53384cbd6d8245499a74194aae74b9f6352f651aa5cfa7285f712136e25523f3.jpg",
        "img_caption": "FIGURE 19.43  Shear  spinning: (1) setup, and  (2) completion of  process. "
    },
    {
        "type": "image",
        "img_path": "images/821fb51d66707b5f29ded837e34478c348da6ea0760170e7b690fc2ea1fa22e8.jpg",
        "img_caption": "FIGURE 19.44  Tube spinning: (a) external, (b) internal, and (c) proﬁ  ling. "
    },
    {
        "type": "text",
        "text": "There are limits to the amount of thinning that the metal will endure in a spin- ning operation before fracture occurs. The maximum reduction correlates well with  reduction of area in a tension test [9]. "
    },
    {
        "type": "text",
        "text": "Tube Spinning  Tube spinning is used to reduce the wall thickness and increase the  length of a tube by means of a roller applied to the work over a cylindrical mandrel,  as in Figure 19.44. Tube spinning is similar to shear spinning except that the starting  workpiece is a tube rather than a ﬂ  at disk. The operation can be performed by apply- ing the roller against the work externally (using a cylindrical mandrel on the inside  of the tube) or internally (using a die to surround the tube). It is also possible to form  proﬁ  les in the walls of the cylinder, as in Figure 19.44(c), by controlling the path of  the roller as it moves tangentially along the wall. "
    },
    {
        "type": "text",
        "text": "Spinning reduction for a tube-spinning operation that produces a wall of uniform  thickness can be determined as in shear spinning by Equation (19.17). "
    },
    {
        "type": "text",
        "text": "19.6.4 HIGH-ENERGY-RATE FORMING",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Several processes have been developed to form metals using large amounts of en- ergy applied in a very short time. Owing to this feature, these operations are called  high-energy-rate forming  (HERF) processes. They include explosive forming, elec- trohydraulic forming, and electromagnetic forming. "
    },
    {
        "type": "text",
        "text": "Explosive Forming  Explosive forming involves the use of an explosive charge to  form sheet (or plate) metal into a die cavity. One method of implementing the process  is illustrated in Figure 19.45. The work part is clamped and sealed over the die, and a  vacuum is created in the cavity beneath. The apparatus is then placed in a large vessel of  water. An explosive charge is placed in the water at a certain distance above the work.  Detonation of the charge results in a shock wave whose energy is transmitted by the  water to cause rapid forming of the part into the cavity. The size of the explosive charge  and the distance at which it is placed above the part are largely a matter of art and ex- perience. Explosive forming is reserved for large parts, typical of the aerospace industry. "
    },
    {
        "type": "image",
        "img_path": "images/56a2b70bf880928876206c860a8f9417a32f97cf249c3e7bd5a9d993e8b73e1d.jpg",
        "img_caption": "FIGURE 19.45  Explosive forming: (1) setup, (2) explosive is detonated, and (3) shock wave forms part and  plume escapes water surface. "
    },
    {
        "type": "text",
        "text": "Electro hydraulic Forming  Electro hydraulic forming is a HERF process in which  a shock wave to deform the work into a die cavity is generated by the discharge of  electrical energy between two electrodes submerged in a transmission ﬂ  uid (water).  Owing to its principle of operation, this process is also called  electric discharge  forming . The setup for the process is illustrated in Figure 19.46. Electrical energy  is accumulated in large capacitors and then released to the electrodes. Electrohy- draulic forming is similar to explosive forming. The difference is in the method of  generating the energy and the smaller amounts of energy that are released. This  limits electro hydraulic forming to much smaller part sizes. "
    },
    {
        "type": "text",
        "text": "Electromagnetic Forming  Electromagnetic forming, also called  magnetic  pulse forming ,   is a process in which sheet metal is deformed by the mechani- cal force of an electromagnetic ﬁ  eld induced in the work part by an energized  coil. The coil, energized by a capacitor, produces a magnetic ﬁ  eld. This generates  eddy currents in the work that produce their own magnetic ﬁ  eld. The induced ﬁ  eld  opposes the primary ﬁ  eld, producing a mechanical force that deforms the part into  the surrounding cavity. Developed in the 1960s, electromagnetic forming is the  most widely used HERF process [10]. It is typically used to form tubular parts, as  illustrated in Figure 19.47. "
    },
    {
        "type": "image",
        "img_path": "images/4929b3b0cb11dfe04e57704a029fa90db7fdc6c1d35d39d8c3687ac76138e692.jpg",
        "img_caption": "FIGURE 19.46  Electro hydraulic  forming setup. "
    },
    {
        "type": "image",
        "img_path": "images/edd810290709480aa7e63bab41aa65a97849919ea0e0cabb704c756e89b32b8d.jpg",
        "img_caption": "FIGURE 19.47 Electromagnetic forming: (1) setup in which coil  is inserted into tubular work part  surrounded by die; (2) formed part. "
    },
    {
        "type": "text",
        "text": " Bending of Tube Stock ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Several methods of producing tubes and pipes are discussed in the previous chapter,  and tube spinning is described in Section 19.6.3. This section examines methods by  which tubes are bent and otherwise formed. Bending of tube stock is more difﬁ  cult  than sheet stock because a tube tends to collapse and fold when attempts are made  to bend it. Special ﬂ  exible mandrels are usually inserted into the tube prior to bend- ing to support the walls during the operation. "
    },
    {
        "type": "text",
        "text": "Some of the terms in tube bending are deﬁ  ned in Figure 19.48. The radius of the  bend $R$  is deﬁ  ned with respect to the centerline of the tube. When the tube is bent,  the wall on the inside of the bend is in compression, and the wall at the outside is  in tension. These stress conditions cause thinning and elongation of the outer wall  and thickening and shortening of the inner wall. As a result, there is a tendency  for the inner and outer walls to be forced toward each other to cause the cross  section of the tube to ﬂ  atten. Because of this ﬂ  attening tendency, the minimum  bend radius  $R$  that the tube can be bent is about 1.5 times the diameter  $D$  when  a mandrel is used and 3.0 times $D$  when no mandrel is used [10]. The exact value  depends on the wall factor  WF,  which is the diameter $D$  divided by wall thickness  t.  Higher values of  $W F$  increase the minimum bend radius; that is, tube bending  is more difﬁ  cult for thin walls. Ductility of the work material is also an important  factor in the process. "
    },
    {
        "type": "text",
        "text": "Several methods to bend tubes (and similar sections) are illustrated in Fig- ure 19.49.  Stretch bending  is accomplished by pulling and bending the tube around  a ﬁ  xed form block, as in Figure 19.49(a).  Draw bending  is performed by clamp- ing the tube against a form block, and then pulling the tube through the bend by  "
    },
    {
        "type": "image",
        "img_path": "images/c3eb3f1288e591c0c72fdb59fbfc7c38674a8561525963d9a15027029870a9f2.jpg",
        "img_caption": "Dimensions and terms  for a bent tube:  $D=0$ utside diameter of  tube, $R={\\mathfrak{b}}$ end radius,  $t\\!=$  wall thickness. "
    },
    {
        "type": "image",
        "img_path": "images/c681ce30e614b75b49fc63be7ba30e58cd01ed82ed6c6cee357f581703b5ee3c.jpg",
        "img_caption": "FIGURE 19.49  Tube  bending methods:  (a) stretch bending,  (b) draw bending, and  (c) compression bend- ing. For each method:  (1) start of process, and  (2) during bending.  Symbols  v  and $F$ indicate motion and  applied force. "
    },
    {
        "type": "text",
        "text": "rotating the block as in (b). A pressure bar is used to support the work as it is being  bent. In  compression bending , a wiper shoe is used to wrap the tube around the  contour of a ﬁ  xed form block, as in (c).  Roll bending  (Section 19.6.2), generally as- sociated with the forming of sheet stock, is also used for bending tubes and other  cross sections. "
    },
    {
        "type": "text",
        "text": "References ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": " [1]  ASM Handbook ,   Vol. 14B:  Metalworking: Sheet  Forming , ASM International, Materials Park,  Ohio, 2006.\n\n  [2] Eary, D. F., and Reed, E. A.  Techniques of Press- working Sheet Metal , 2nd ed. Prentice-Hall,  Inc., Englewood Cliffs, New Jersey, 1974. "
    },
    {
        "type": "text",
        "text": " [3] Hoffman, E. G. (ed.).  Fundamentals of Tool  Design , 2nd ed. Society of Manufacturing Engi- neers, Dearborn, Michigan, 1984.\n\n  [4] Hosford, W. F., and Caddell, R. M.  Metal Form- ing: Mechanics and Metallurgy , 3rd ed. Cam- bridge University Press, Cambridge, UK, 2007. "
    }
]