[
    {
        "type": "text",
        "text": "31 31 Mechanical  Assembly ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Chapter Contents ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "31.1 Threaded Fasteners ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "31.1.1 Screws, Bolts, and Nuts 31.1.2 Other Threaded Fasteners and \n\n 1.1 What Is Manufacturing? Manufactur- 31.1.3 Stresses and Strengths in  1.1  What Is Manufacturing? Manu- 31.1.4 Tools and Methods for  Threaded Fasteners\n\n "
    },
    {
        "type": "text",
        "text": "31.2 Rivets and Eyelets\n\n "
    },
    {
        "type": "text",
        "text": "31.3 Assembly Methods Based on  Interference Fits\n\n "
    },
    {
        "type": "text",
        "text": "31.4 Other Mechanical Fastening Methods\n\n "
    },
    {
        "type": "text",
        "text": "31.5 Molding Inserts and Integral  Fasteners\n\n "
    },
    {
        "type": "text",
        "text": "31.6 Design for Assembly 31.6.1 General Principles of DFA 31.6.2 Design for Automated  Assembly "
    },
    {
        "type": "text",
        "text": "Mechanical assembly uses various methods to mechani- cally attach two (or more) parts together. In most cases,  the method involves the use of discrete hardware com- ponents, called  fasteners , that are added to the parts  during the assembly operation. In other cases, the meth- od involves the shaping or reshaping of one of the com- ponents being assembled, and no separate fasteners  are required. Many consumer products are produced  using mechanical assembly: automobiles, large and  small appliances, telephones, furniture, utensils—even  wearing apparel is “assembled” by mechanical means.  In addition, industrial products such as airplanes, ma- chine tools, and construction equipment almost always  involve mechanical assembly. "
    },
    {
        "type": "text",
        "text": "Mechanical fastening methods can be divided into  two major classes: (1) those that allow for disassembly,  and (2) those that create a permanent joint. Threaded  fasteners (e.g., screws, bolts, and nuts) are examples of  the ﬁ  rst class, and rivets illustrate the second. There are  good reasons why mechanical assembly is often pre- ferred over other joining processes discussed in previ- ous chapters. The main reasons are (1) ease of assembly  and (2) ease of disassembly (for the fastening methods  that permit disassembly). "
    },
    {
        "type": "text",
        "text": "Mechanical assembly is usually accomplished by un- skilled workers with a minimum of special tooling and  in a relatively short time. The technology is simple, and  the results are easily inspected. These factors are ad- vantageous not only in the factory, but also during ﬁ  eld  installation. Large products that are too big and heavy  to be transported completely assembled can be shipped  in smaller subassemblies and then put together at the  customer’s site. "
    },
    {
        "type": "text",
        "text": "Ease of disassembly applies, of course, only to the  mechanical fastening methods that permit disassem- bly. Periodic disassembly is required for many products  so that maintenance and repair can be performed; for  example, to replace worn-out components, to make  adjustments, and so forth. Permanent joining tech- niques such as welding do not allow for disassembly. "
    },
    {
        "type": "text",
        "text": "For purposes of organization, mechanical assembly methods are divided into the  following categories: (1) threaded fasteners, (2) rivets, (3) interference ﬁ  ts, (4) other  mechanical fastening methods, and (5) molded-in inserts and integral fasteners.  These categories are described in Sections 31.1 through 31.5. Section 31.6 discusses  the important topic of design for assembly. Assembly of electronic products includes  mechanical techniques. However, electronics assembly represents a specialized ﬁ  eld,  which is covered in Chapter 34. "
    },
    {
        "type": "text",
        "text": " Threaded Fasteners ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Threaded fasteners are discrete hardware components that have external or internal  threads for assembly of parts. In nearly all cases, they permit disassembly. Threaded  fasteners are the most important category of mechanical assembly; the common  threaded fastener types are screws, bolts, and nuts. "
    },
    {
        "type": "text",
        "text": "31.1.1  SCREWS, BOLTS, AND NUTS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Screws and bolts are threaded fasteners that have external threads. There is a tech- nical distinction between a screw and a bolt that is often blurred in popular usage.  A  screw  is an externally threaded fastener that is generally assembled into a blind  threaded hole. Some types, called  self-tapping screws , possess geometries that per- mit them to form or cut the matching threads in the hole. A  bolt  is an externally  threaded fastener that is inserted through holes in the parts and “screwed” into a  nut on the opposite side. A  nut  is an internally threaded fastener having standard  threads that match those on bolts of the same diameter, pitch, and thread form.  The typical assemblies that result from the use of screws and bolts are illustrated in  Figure 31.1. "
    },
    {
        "type": "text",
        "text": "Screws and bolts come in a variety of standard sizes, threads, and shapes. Table 31.1  provides a selection of common threaded fastener sizes in metric units (ISO standard)  and U.S. customary units (ANSI standard).  The metric speciﬁ  cation consists of the  nominal major diameter, mm, followed by the pitch, mm. For example, a speciﬁ  cation  of $4\\times0.7$  means a $4.0\\mathrm{-mm}$  major diameter and a pitch of $0.7\\;\\mathrm{mm}$ . The U.S. standard  speciﬁ  es either a number designating the major diameter (up to 0.2160 in) or the  nominal major diameter, in, followed by the number of threads per inch. For example,  the speciﬁ  cation 1/4-20 indicates a major diameter of 0.25 in and 20 threads per inch.  Both coarse pitch and ﬁ  ne pitch standards are given in Table 31.1. "
    },
    {
        "type": "image",
        "img_path": "images/ea936da6a14fb446dc3e18ce145a0450eafd4ad1ac984f26c4452c1ec2e3c8ca.jpg",
        "img_caption": "FIGURE 31.1  Typical  assemblies using  (a) bolt and nut, and  (b) screw. "
    },
    {
        "type": "table",
        "img_path": "images/cbf4840e9085d1fce234d730ac52c0c7a94c46d2307378d581af7a3c36c257e2.jpg",
        "table_caption": "TABLE  •  31.1  Selected standard threaded fastener sizes in metric and U.S. customary units. ",
        "table_footnote": "a  UNC stands for uniﬁ  ed coarse in the ANSI standard, and UNF stands for uniﬁ  ed ﬁ  ne. "
    },
    {
        "type": "text",
        "text": "Additional technical data on these and other standard threaded fastener sizes  can be found in design texts and handbooks. The United States has been gradually  converting to metric thread sizes, which will reduce proliferation of speciﬁ  cations.  It should be noted that differences among threaded fasteners have tooling impli- cations in manufacturing. To use a particular type of screw or bolt, the assembly  worker must have tools that are designed for that fastener type. For example, there  are numerous head styles available on bolts and screws, the most common of which  are shown in Figure 31.2. The geometries of these heads, as well as the variety of  sizes available, require different hand tools (e.g., screwdrivers) for the worker. One  cannot turn a hexhead bolt with a conventional ﬂ  at-blade screwdriver. "
    },
    {
        "type": "text",
        "text": "Screws come in a greater variety of conﬁ  gurations than bolts, since their functions  vary more. The types include machine screws, capscrews, setscrews, and self-tapping  screws.  Machine screws  are the generic type, designed for assembly into tapped  holes. They are sometimes assembled to nuts, and in this usage they overlap with  bolts.  Capscrews  have the same geometry as machine screws but are made of higher  strength metals and to closer tolerances.  Setscrews  are hardened and designed for  "
    },
    {
        "type": "image",
        "img_path": "images/cc2f1cf190ac903f70ad915add80f116f45e074a43e80a19ece2b81f6b162e9b.jpg",
        "img_caption": "FIGURE 31.2  Various  head styles available on  screws and bolts. There  are additional head  styles not shown. "
    },
    {
        "type": "image",
        "img_path": "images/3ddbcef368b8a9451e45338590fb740fce1edac16c2c2e2f29602adfd83e1caf.jpg",
        "img_caption": "FIGURE 31.3  (a) Assembly of collar to shaft using a setscrew; (b) various setscrew geometries (head types and points). "
    },
    {
        "type": "image",
        "img_path": "images/33f6cf0654afb04c3ec781060792188afd3c81a015b575f53f082ad2ba3cd5ee.jpg"
    },
    {
        "type": "text",
        "text": "assembly functions such as fastening collars, gears, and pulleys to shafts as shown  in Figure 31.3(a). They come in various geometries, some of which are illustrated  in Figure 31.3(b). A  self-tapping screw  (also called a  tapping screw ) is designed to  form or cut threads in a preexisting hole into which it is being turned. Figure 31.4  shows two of the typical thread geometries for self-tapping screws. "
    },
    {
        "type": "text",
        "text": "Most threaded fasteners are produced by cold forming (Section 18.2). Some are  machined (Sections 21.2.2 and 21.7.1), but this is usually a more expensive thread- making process. A variety of materials are used to make threaded fasteners, steels  being the most common because of their good strength and low cost. These include  low and medium carbon as well as alloy steels. Fasteners made of steel are usually  plated or coated for superﬁ  cial resistance to corrosion. Nickel, chromium, zinc, black  oxide, and similar coatings are used for this purpose. When corrosion or other fac- tors deny the use of steel fasteners, other materials must be used, including stainless  steels, aluminum alloys, nickel alloys, and plastics (however, plastics are suited to low  stress applications only). "
    },
    {
        "type": "text",
        "text": "31.1.2  OTHER THREADED FASTENERS AND RELATED HARDWARE ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Additional threaded fasteners and related hardware include studs, screw thread in- serts, captive threaded fasteners, and washers. A  stud  (in the context of fasteners)  is an externally threaded fastener, but without the usual head possessed by a bolt.  Studs can be used to assemble two parts using two nuts as shown in Figure 31.5(a).  They are available with threads on one end or both as in Figure 31.5(b) and (c). "
    },
    {
        "type": "text",
        "text": "Screw thread inserts  are internally threaded plugs or wire coils made to be in- serted into an unthreaded hole and to accept an externally threaded fastener. They  are assembled into weaker materials (e.g., plastic, wood, and light-weight metals such  as magnesium) to provide strong threads. There are many designs of screw thread  inserts, one example of which is illustrated in Figure 31.6. Upon subsequent assembly  "
    },
    {
        "type": "image",
        "img_path": "images/768d4b6bcd5f2a6d5cbc0e168f2b30942ce7b451d71efce46aecfd9f9b07c323.jpg",
        "img_caption": "FIGURE 31.5  (a) Stud and nuts used  for assembly. Other  stud types: (b) threads  on one end only, and  (c) double-end stud. "
    },
    {
        "type": "text",
        "text": "of the screw into the insert, the insert barrel expands into the sides of the hole, secur- ing the assembly. "
    },
    {
        "type": "text",
        "text": "Captive threaded fasteners  are threaded fasteners that have been permanently  preassembled to one of the parts to be joined. Possible preassembly processes in- clude welding, brazing, press ﬁ  tting, or cold forming. Two types of captive threaded  fasteners are illustrated in Figure 31.7. "
    },
    {
        "type": "text",
        "text": "A  washer  is a hardware component often used with threaded fasteners to ensure  tightness of the mechanical joint; in its simplest form, it is a ﬂ  at, thin ring of sheet  metal. Washers serve various functions. They (1) distribute stresses that might other- wise be concentrated at the bolt or screw head and nut, (2) provide support for large  clearance holes in the assembled parts, (3) increase spring tension, (4) protect part  surfaces, (5) seal the joint, and (6) resist inadvertent unfastening [13]. Three washer  types are illustrated in Figure 31.8. "
    },
    {
        "type": "text",
        "text": "31.1.3  STRESSES AND STRENGTHS IN BOLTED JOINTS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Typical stresses acting on a bolted or screwed joint include both tensile and shear,  as depicted in Figure 31.9. Shown in the ﬁ  gure is a bolt-and-nut assembly. Once  tightened, the bolt is loaded in tension, and the parts are loaded in compression.  In addition, forces may be acting in opposite directions on the parts, which results  in a shear stress on the bolt cross section. Finally, there are stresses applied on the  threads throughout their engagement length with the nut in a direction parallel to  "
    },
    {
        "type": "image",
        "img_path": "images/93e804d8fa90f94f75ad808f26aeff9c98973f0d60420e416fbbf03e5fa9870c.jpg",
        "img_caption": "FIGURE 31.7  Captive threaded fasteners: (a) weld nut, and (b) riveted nut. "
    },
    {
        "type": "image",
        "img_path": "images/8e96d58d87d8d8e456e567588b9a76bebdd3152680bf62dcbd9bad0eda3ab7d1.jpg",
        "img_caption": "FIGURE 31.8  Types of  washers: (a) plain (ﬂ  at)  washers; (b) spring  washers, used to  dampen vibration or  compensate for wear;  and (c) lockwasher  designed to resist  loosening of the bolt or  screw. "
    },
    {
        "type": "image",
        "img_path": "images/b7d596db3405f9b721697c1059343e1bd5bce457853673c7c68a60b518618721.jpg",
        "img_caption": "FIGURE 31.9  Typical stresses  acting on a bolted joint. "
    },
    {
        "type": "table",
        "img_path": "images/4465b70aea691cbaad87fe1e1d27488bfe1c5ef8896ac79dcb3f2743bcde9fea.jpg",
        "table_caption": "TABLE  •  31.2  Typical values of tensile and proof strengths for steel bolts and  screws, diameters range from $6.4\\:\\mathsf{m m}$  (0.25 in) to 38 mm (1.50 in). ",
        "table_footnote": "Source: [13]. "
    },
    {
        "type": "text",
        "text": "the axis of the bolt. These shear stresses can cause  stripping  of the threads, which can  also occur on the internal threads of the nut. "
    },
    {
        "type": "text",
        "text": "The strength of a threaded fastener is generally speciﬁ  ed by two measures: (1)  tensile strength, which has the traditional deﬁ  nition (Section 3.1.1), and (2) proof  strength.  Proof strength  is roughly equivalent to yield strength; speciﬁ  cally, it is the  maximum tensile stress to which an externally threaded fastener can be subjected  without permanent deformation. Typical values of tensile and proof strength for  steel bolts are given in Table 31.2. "
    },
    {
        "type": "text",
        "text": "The problem that can arise during assembly is that the threaded fasteners are  overtightened, causing stresses that exceed the strength of the fastener material.  Assuming a bolt-and-nut assembly as shown in Figure 31.9, failure can occur in one  of the following ways: (1) external threads (e.g., bolt or screw) can strip, (2) internal  threads (e.g., nut) can strip, or (3) the bolt can break because of excessive tensile  stresses on its cross-sectional area. Thread stripping, failures (1) and (2), is a shear  failure and occurs when the length of engagement is too short (less than about  $60\\%$   of the nominal bolt diameter). This can be avoided by providing adequate thread  engagement in the fastener design. Tensile failure (3) is the most common problem.  The bolt breaks at about $85\\%$  of its rated tensile strength because of combined ten- sile and torsion stresses during tightening [2]. "
    },
    {
        "type": "text",
        "text": "The tensile stress to which a bolt is subjected can be calculated as the tensile load  applied to the joint divided by the applicable area: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\sigma=\\frac{F}{A_{s}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $\\sigma=$  stress, MPa  $\\mathrm{(lb/in^{2})}$ ;  $F={\\mathrm{load}}$ , N (lb); and  $A_{s}=$  tensile stress area,  $\\mathrm{mm}^{2}$   $(\\mathrm{in}^{2})$ ). This stress is compared to the bolt strength values listed in Table 31.2. The ten- sile stress area for a threaded fastener is the cross-sectional area of the minor diam- eter. This area can be calculated directly from one of the following equations [2],  depending on whether the bolt is metric standard or American standard. For the  metric standard (ISO), the formula is "
    },
    {
        "type": "equation",
        "text": "\n$$\nA_{s}{=}\\,\\frac{\\pi}{4}\\,(D\\,{-}\\,0.9382p)^{2}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $D\\ =$  nominal size (basic major diameter) of the bolt or screw, mm; and  $p=$  thread pitch, $\\mathrm{mm}$ . For the American standard (ANSI), the formula is "
    },
    {
        "type": "equation",
        "text": "\n$$\nA_{s}{=}\\,\\frac{\\pi}{4}\\left(D-\\frac{0.9743}{n}\\right)^{2}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $D=$  nominal size (basic major diameter) of the bolt or screw, in; and $n=$ the  number of threads per inch. "
    },
    {
        "type": "text",
        "text": "31.1.4  TOOLS AND METHODS FOR THREADED FASTENERS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The basic function of the tools and methods for assembling threaded fasteners is to  provide relative rotation between the external and internal threads, and to apply suf- ﬁ  cient torque to secure the assembly. Available tools range from simple hand-held  screwdrivers or wrenches to powered tools with sophisticated electronic sensors to  ensure proper tightening. It is important that the tool match the screw or bolt and/ or the nut in style and size, since there are so many heads available. Hand tools are  usually made with a single point or blade, but powered tools are generally designed  to use interchangeable bits. The powered tools operate by pneumatic, hydraulic, or  electric power. "
    },
    {
        "type": "text",
        "text": "Whether a threaded fastener serves its intended purpose depends to a large  degree on the amount of torque applied to tighten it. Once the bolt or screw (or nut)  has been rotated until it is seated against the part surface, additional tightening will  increase the tension in the fastener (and simultaneously the compression in the parts  being held together); and the tightening will be resisted by an increasing torque.  Thus, there is a correlation between the torque required to tighten the fastener and  the tensile stress experienced by it. To achieve the desired function in the assembled  joint (e.g., to improve fatigue resistance) and to lock the threaded fasteners, the  product designer will often specify the tension force that should be applied. This  force is called the  preload . The following relationship can be used to determine the  required torque to obtain a speciﬁ  ed preload [13]: "
    },
    {
        "type": "equation",
        "text": "\n$$\nT=C_{t}D F\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $T=$  torque, $\\mathrm{N{-mm}}$  (lb-in);  $C_{t}=$  the torque coefﬁ  cient whose value typically  ranges between 0.15 and 0.25, depending on the thread surface conditions;  $D\\;=\\;$ nominal bolt or screw diameter, mm (in); and $F=$  speciﬁ  ed preload tension force,  N (lb). "
    },
    {
        "type": "text",
        "text": "Example 31.1  Threaded  ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "fasteners ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A Metric $8\\times1.25$  bolt must be tightened to a preload of  $275\\;\\mathrm{N}.$  The torque  coefﬁ  cient $=0.22$ . Determine (a) the required torque that will achieve the  speciﬁ  ed preload, and (b) the stress on the bolt when preloaded. "
    },
    {
        "type": "text",
        "text": "Solution:  Using Equation 31.4, the required torque  $T=0.22(8)(275)=484$   $\\mathrm{N-mm}={\\bf0.484}\\,\\mathrm{N}\\mathrm{-m}$ "
    },
    {
        "type": "text",
        "text": "(b) The area of the minor diameter of the bolt is obtained using Equation 31.2: "
    },
    {
        "type": "equation",
        "text": "\n$$\nA_{s}=\\frac{\\pi}{4}\\,(D-0.9382p)^{2}=\\frac{\\pi}{4}\\,(8-0.9382(1.25))^{2}{=}36.6\\,\\mathrm{mm}^{2}\n$$\n \n$$\n\\sigma=F/A_{s}=\\frac{275}{36.6}=7.51\\;\\mathrm{N/mm^{2}}={\\bf7.51}\\;\\mathrm{MHz}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Various methods are used to apply the required torque, including (1) operator  feel—not very accurate, but adequate for most assemblies; (2) torque wrenches,  which measure the torque as the fastener is being turned; (3) stall-motors, which  are motorized wrenches designed to stall when the required torque is reached;  and (4) torque-turn tightening, in which the fastener is initially tightened to a low  torque level and then rotated a speciﬁ  ed additional amount (e.g., a quarter turn). "
    },
    {
        "type": "text",
        "text": "Rivets are widely used for achieving a permanent mechanically fastened joint. Riv- eting is a fastening method that offers high production rates, simplicity, dependabil- ity, and low cost. Despite these apparent advantages, its applications have declined  in recent decades in favor of threaded fasteners, welding, and adhesive bonding.  Riveting is one of the primary fastening processes in the aircraft and aerospace  industries for joining skins to channels and other structural members. "
    },
    {
        "type": "text",
        "text": "A  rivet  is an unthreaded, headed pin used to join two (or more) parts by passing  the pin through holes in the parts and then forming (upsetting) a second head in the  pin on the opposite side. The deforming operation can be performed hot or cold (hot  working or cold working), and by hammering or steady pressing. Once the rivet has  been deformed, it cannot be removed except by breaking one of the heads. Rivets are  speciﬁ  ed by their length, diameter, head, and type. Rivet type refers to ﬁ  ve basic ge- ometries that affect how the rivet will be upset to form the second head. The ﬁ  ve types  are deﬁ  ned in Figure 31.10. In addition, there are special rivets for special applications. "
    },
    {
        "type": "text",
        "text": "Rivets are used primarily for lap joints. The clearance hole into which the rivet is  inserted must be close to the diameter of the rivet. If the hole is too small, rivet inser- tion will be difﬁ  cult, thus reducing production rate. If the hole is too large, the rivet  will not ﬁ  ll the hole and may bend or compress during formation of the opposite  head. Rivet design tables are available to specify the optimum hole sizes. "
    },
    {
        "type": "text",
        "text": "The tooling and methods used in riveting can be divided into the following cat- egories: (1) impact, in which a pneumatic hammer delivers a succession of blows  to upset the rivet; (2) steady compression, in which the riveting tool applies a con- tinuous squeezing pressure to upset the rivet; and (3) a combination of impact and  compression. Much of the equipment used in riveting is portable and manually  operated. Automatic drilling-and-riveting machines are available for drilling the  holes and then inserting and upsetting the rivets. "
    },
    {
        "type": "text",
        "text": "Eyelets  are thin-walled, tubular fasteners with a ﬂ  ange on one end, usually made  from sheet metal, as in Figure 31.11(a). They are used to produce a permanent lap  joint between two (or more) ﬂ  at parts. Eyelets are substituted for rivets in low-stress  applications to save material, weight, and cost. During fastening, the eyelet is inserted  through the part holes, and the straight end is formed over to secure the assembly.  "
    },
    {
        "type": "image",
        "img_path": "images/67492f68cc62ed3be03457c2c1c7dc87148eed4add19fab418d05f7efd77cdee.jpg",
        "img_caption": "FIGURE 31.10  Five basic rivet types,  also shown in assem- bled conﬁ  guration:  (a) solid, (b) tubular,  (c) semitubular,  (d) bifurcated, and  (e) compression. "
    },
    {
        "type": "image",
        "img_path": "images/f165c42ec6917029f02e1517555b1fa4a7106e39969f04fcb64d43bed7332e8e.jpg",
        "img_caption": "FIGURE 31.11  Fastening with an eyelet:  (a) the eyelet, and  (b) assembly sequence:  (1) inserting the eyelet  through the hole, and  (2) setting operation. "
    },
    {
        "type": "text",
        "text": "The forming operation is called  setting  and is performed by opposing tools that hold  the eyelet in position and curl the extended portion of its barrel. Figure 31.11(b)  illustrates the sequence for a typical eyelet design. Applications of this fastening  method include automotive subassemblies, electrical components, toys, and apparel. "
    },
    {
        "type": "text",
        "text": " Assembly Methods Based on Interference Fits ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Several assembly methods are based on mechanical interference between the two  mating parts being joined. This interference, which occurs either during assembly or  after the parts are joined, holds the parts together. The methods include press ﬁ  tting,  shrink and expansion ﬁ  ts, snap ﬁ  ts, and retaining rings. "
    },
    {
        "type": "text",
        "text": "Press Fitting   A press ﬁ  t assembly is one in which the two components have an  interference ﬁ  t between them. The typical case is where a pin (e.g., a straight cylin- drical pin) of a certain diameter is pressed into a hole of a slightly smaller diameter.  Standard pin sizes are commercially available to accomplish a variety of functions,  such as (1) locating and locking the components—used to augment threaded fas- teners by holding two (or more) parts in ﬁ  xed alignment with each other; (2) pivot  points, to permit rotation of one component about the other; and (3) shear pins.  Except for (3), the pins are normally hardened. Shear pins are made of softer metals  so as to break under a sudden or severe shearing load to save the rest of the assem- bly. Other applications of press ﬁ  tting include assembly of collars, gears, pulleys, and  similar components onto shafts. "
    },
    {
        "type": "text",
        "text": "The pressures and stresses in an interference ﬁ  t can be estimated using several  applicable formulas. If the ﬁ  t consists of a round solid pin or shaft inside a collar (or  similar component), as depicted in Figure 31.12, and the components are made of  the same material, the radial pressure between the pin and the collar can be deter- mined by [13]: "
    },
    {
        "type": "equation",
        "text": "\n$$\nP_{f}={\\frac{E i(D_{c}^{2}-D_{p}^{2})}{D_{p}D_{c}^{2}}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "image",
        "img_path": "images/eaa389c6c6690ef41a460f687f8324da05faafe39a43120226ccce281067d674.jpg",
        "img_caption": "FIGURE 31.12  Cross  section of a solid pin or  shaft assembled to a  collar by interference ﬁ  t. "
    },
    {
        "type": "text",
        "text": "where $p_{f}=$  radial or interference ﬁ  t pressure, MPa  $\\mathrm{(lb/in^{2})}$ ; $E=$  modulus of elasticity  for the material;  $i=$  interference between the pin (or shaft) and the collar; that is,  the starting difference between the inside diameter of the collar hole and the outside  diameter of the pin, mm (in); $D_{c}=$  outside diameter of the collar, mm (in); and  $D_{p}=$ pin or shaft diameter, mm (in). "
    },
    {
        "type": "text",
        "text": "The maximum effective stress occurs in the collar at its inside diameter and can  be calculated as "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\mathrm{Max}\\,\\sigma_{e}=\\frac{2p_{f}D_{c}^{2}}{D_{c}^{2}\\!-\\!D_{p}^{2}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where Max  $\\sigma_{e}=$  the maximum effective stress, MPa  $\\mathrm{(lb/in^{2})}$ ), and  $p_{f}$ is the interfer- ence ﬁ  t pressure computed from Equation (31.5). "
    },
    {
        "type": "text",
        "text": "In situations in which a straight pin or shaft is pressed into the hole of a large part  with geometry other than that of a collar, the previous equations can be simpliﬁ  ed by  taking the outside diameter $D_{c}$  to be inﬁ  nite, thus reducing the equation for interfer- ence pressure to "
    },
    {
        "type": "equation",
        "text": "\n$$\np_{f}={\\frac{E i}{D_{p}}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "and the corresponding maximum effective stress becomes "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\operatorname{Max}\\sigma_{e}=2p_{f}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "In most cases, particularly for ductile metals, the maximum effective stress should  be compared with the yield strength of the material, applying an appropriate safety  factor, as in the following: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\operatorname*{Max}\\sigma_{e}\\leq\\frac{Y}{S F}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $Y=$  yield strength of the material, and $S F$  is the applicable safety factor. "
    },
    {
        "type": "text",
        "text": "Various pin geometries are available for interference ﬁ  ts. The basic type is a  straight pin , usually made from cold-drawn carbon steel wire or bar stock, ranging  in diameter from 1.6 to $25\\,\\mathrm{mm}$  (1/16–1.0 in). They are unground, with chamfered or  square ends (chamfered ends facilitate press ﬁ  tting).  Dowel pins  are manufactured  to more precise speciﬁ  cations than straight pins, and can be ground and hardened.  They are used to ﬁ  x the alignment of assembled components in dies, ﬁ  xtures, and  machinery.  Taper pins  possess a taper of  $6.4~\\mathrm{mm}$  (0.25 in) per foot and are driven  into the hole to establish a ﬁ  xed relative position between the parts. Their advantage  is that they can be driven readily back out of the hole. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Additional pin geometries are commercially available, including  grooved pins — solid straight pins with three longitudinal grooves in which the metal is raised on  either side of each groove to cause interference when the pin is pressed into a hole;  knurled pins , pins with a knurled pattern that causes interference in the mating hole;  and  coiled pins , also called  spiral pins , which are made by rolling strip stock into a  coiled spring. "
    },
    {
        "type": "text",
        "text": "Shrink and Expansion Fits   These terms refer to the assembly of two parts that  have an interference ﬁ  t at room temperature. The typical case is a cylindrical pin  or shaft assembled into a collar. To assemble by  shrink ﬁ  tting , the external part is  heated to enlarge it by thermal expansion, and the internal part either remains at  room temperature or is cooled to contract its size. The parts are then assembled and  brought back to room temperature, so that the external part shrinks, and if previous- ly cooled the internal part expands, to form a strong interference ﬁ  t. An  expansion  $\\mathbf{\\nabla}f t$  is when only the internal part is cooled to contract it for assembly; once inserted  into the mating component, it warms to room temperature, expanding to create the  interference assembly. These assembly methods are used to ﬁ  t gears, pulleys, sleeves,  and other components onto solid and hollow shafts. "
    },
    {
        "type": "text",
        "text": "Various methods are used to heat and/or cool the work parts. Heating equip- ment includes torches, furnaces, electric resistance heaters, and electric induction  heaters. Cooling methods include conventional refrigeration, packing in dry ice,  and immersion in cold liquids, including liquid nitrogen. The resulting change in  diameter depends on the coefﬁ  cient of thermal expansion and the temperature  difference that is applied to the part. If it is assumed that the heating or cooling  has produced a uniform temperature throughout the work, then the change in di- ameter is given by "
    },
    {
        "type": "equation",
        "text": "\n$$\nD_{2}\\!-\\!D_{1}=\\alpha\\,D_{1}(T_{2}\\!-\\!T_{1})\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $\\alpha=$  the coefﬁ  cient of linear thermal expansion, $\\mathrm{mm/mm\\cdot^{\\circ}C}$  (in/in- $\\mathrm{\\cdot^{\\circ}F}$ ) for the  material (see Table 4.1);  $T_{2}=$  the temperature to which the parts have been heated  or cooled, $^{\\circ}\\mathrm{C}$   $\\mathrm{(^{\\circ}F)}$ ;  $T_{1}=$  starting ambient temperature;  $D_{2}=$  diameter of the part at  $T_{2},\\mathrm{mm}$ $D_{\\scriptscriptstyle1}=$  diameter of the part at  $T_{1}$ . "
    },
    {
        "type": "text",
        "text": "Equations (31.5) through (31.9) for computing interference pressures and  effective stresses can be used to determine the corresponding values for shrink and  expansion ﬁ  ts. "
    },
    {
        "type": "text",
        "text": "Example 31.2  Expansion ﬁ  t ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "An alloy steel shaft is to be inserted into a collar of the same metal using an  expansion ﬁ  t. At room temperature  $(20^{\\circ}\\mathrm{C})$ , the outer and inner diameters  of the collar $=50.00\\:\\mathrm{mm}$  and  $30.00\\:\\mathrm{mm}$ , respectively, and the shaft has a  diameter  $=30.015\\:\\mathrm{mm}$ . The shaft must be reduced in size for assembly into  the collar by cooling to a sufﬁ  ciently low temperature that there is a  clearance of  $0.03\\;\\mathrm{mm}$ . Determine (a) the temperature to which the shaft  must be cooled for assembly, (b) the radial pressure at room temperature  after assembly, and (c) the maximum effective stress on the collar.  "
    },
    {
        "type": "table",
        "img_path": "images/bbe61de318dda8ada1f64a1a5c30123dcf79321f159c203332299663be67ef5e.jpg"
    },
    {
        "type": "text",
        "text": "Solution:  (a) From Table 4.1, the coefﬁ  cient of thermal expansion for steel  $\\alpha=12(10^{-6})\\mathrm{\\,^{\\circ}C^{-1}}$ . Rearranging Equation 31.10 to solve for the cooling  temperature, "
    },
    {
        "type": "equation",
        "text": "\n$$\nT_{2}={\\frac{(D2-D_{1})}{\\alpha\\,D_{1}}}+\\,T_{1}={\\frac{(30.00-0.03)-30.015}{12(10^{-6})(30.015)}}+20=-124.9+20=-104.9^{\\circ}{\\bf C}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "(b) From Table 3.1, the modulus of elasticity for steel  $E=209(10^{3})$  MPa. Using Equation (31.5) to solve for radial pressure, where  $D_{c}=50.00\\,\\mathrm{mm}$  and  $D_{p}=30.025\\:\\mathrm{mm}$ "
    },
    {
        "type": "equation",
        "text": "\n$$\nP_{f}={\\frac{E i(D_{c}^{2}-D_{p}^{2})}{D_{p}D_{c}^{2}}}={\\frac{209(10^{3})(0.015)(50^{2}-30.015^{2})}{30.015(50^{2})}}=66.8\\ \\mathrm{MPa}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "(c) The maximum effective stress is given by Equation 31.8: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\mathbf{Max}\\:\\sigma_{e}={\\frac{2p_{f}D_{c}^{2}}{D_{c}^{2}\\!-\\!D_{p}^{2}}}={\\frac{2(66.8)(50^{2})}{(50^{2}\\!-\\!30.015^{2})}}={\\mathbf{209}}\\:\\mathbf{MHz}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Snap Fits and Retaining Rings   Snap ﬁ  ts are a variation of interference ﬁ  ts. A  snap ﬁ  t  involves joining two parts in which the mating elements possess a tempo- rary interference while being pressed together, but once assembled they interlock  to maintain the assembly. A typical example is shown in Figure 31.13: as the parts  are pressed together, the mating elements elastically deform to accommodate the  interference, subsequently allowing the parts to snap together; once in position,  the elements become connected mechanically so that they cannot easily be disas- sembled. The parts are usually designed so that a slight interference exists after  assembly. "
    },
    {
        "type": "text",
        "text": "Advantages of snap ﬁ  t assembly include (1) the parts can be designed with self- aligning features, (2) no special tooling is required, and (3) assembly can be accom- plished very quickly. Snap ﬁ  tting was originally conceived as a method that would  be ideally suited to industrial robotics applications; however, it is no surprise that  assembly techniques that are easier for robots are also easier for human assembly  workers. "
    },
    {
        "type": "image",
        "img_path": "images/9fce975f94a9944e5ce0e5dafa3b919f4c8bf1aedf7f68e30ac46aaf949fe6a0.jpg",
        "img_caption": ""
    },
    {
        "type": "image",
        "img_path": "images/8aea75cef7cdee160acfbf0310289af2244a5443773692c7b3d3361ae81cdbf0.jpg"
    },
    {
        "type": "image",
        "img_path": "images/058b12c86962fe57845711ef41130d3c91a6a551b4c3df6c534754e35ffb9085.jpg",
        "img_caption": "FIGURE 31.14  Retaining ring assem- bled into a groove on a  shaft. "
    },
    {
        "type": "text",
        "text": "A  retaining ring , also known as a  snap ring , is a fastener that snaps into a circum- ferential groove on a shaft or tube to form a shoulder, as in Figure 31.14. The assembly  can be used to locate or restrict the movement of parts mounted on the shaft. Retain- ing rings are available for both external (shaft) and internal (bore) applications. They  are made from either sheet metal or wire stock, heat treated for hardness and stiff- ness. To assemble a retaining ring, a special pliers tool is used to elastically deform the  ring so that it ﬁ  ts over the shaft (or into the bore) and then is released into the groove. "
    },
    {
        "type": "text",
        "text": " Other Mechanical Fastening Methods ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "In addition to the mechanical assembly techniques discussed above, there are sev- eral additional methods that involve the use of fasteners. These include stitching,  stapling, sewing, and cotter pins. "
    },
    {
        "type": "text",
        "text": "Stitching, Stapling, and Sewing   Industrial stitching and stapling are similar oper- ations involving the use of U-shaped metal fasteners.  Stitching  is a fastening operation  in which a stitching machine is used to form the U-shaped stitches one at a time from  steel wire and immediately drive them through the two parts to be joined. Figure 31.15  illustrates several types of wire stitches. The parts to be joined must be relatively thin,  consistent with the stitch size, and the assembly can involve various combinations of  metal and nonmetal materials. Applications of industrial stitching include light sheet- metal assembly, metal hinges, electrical connections, magazine binding, corrugated  boxes, and ﬁ  nal product packaging. Conditions that favor stitching in these applica- tions are (1) high-speed operation, (2) elimination of the need for prefabricated holes  in the parts, and (3) desirability of using fasteners that encircle the parts. "
    },
    {
        "type": "text",
        "text": "In  stapling , preformed U-shaped staples are punched through the two parts to  be attached. The staples are supplied in convenient strips. The individual staples are  lightly stuck together to form the strip, but they can be separated by the stapling tool  for driving. The staples come with various point styles to facilitate their entry into the  work. Staples are usually applied by means of portable pneumatic guns, into which  strips containing several hundred staples can be loaded. Applications of industrial sta- pling include: furniture and upholstery, assembly of car seats, and various light-gage  sheet-metal and plastic assembly jobs. "
    },
    {
        "type": "text",
        "text": "Sewing  is a common joining method for soft, ﬂ  exible parts such as cloth and  leather. The method involves the use of a long thread or cord interwoven with the  "
    },
    {
        "type": "image",
        "img_path": "images/7ab88ebd7964870cc4962811a3623c6a3edc219991d0cb84561368168487e549.jpg",
        "img_caption": "FIGURE 31.15  Common types of wire  stitches: (a) unclinched,  (b) standard loop,  (c) bypass loop, and  (d) ﬂ  at clinch. "
    },
    {
        "type": "image",
        "img_path": "images/3da3219c69c851d42348b6e25fb1fa1749de5d064cf827d61130bde0269b16e0.jpg",
        "img_caption": "FIGURE 31.16  Cotter pins: (a) offset  head, standard point;  (b) symmetric head,  hammerlock point;  (c) square point;  (d) mitered point; and  (e) chisel point. "
    },
    {
        "type": "text",
        "text": "parts so as to produce a continuous seam between them. The process is widely used  in the needle trades industry for assembling garments. "
    },
    {
        "type": "text",
        "text": "Cotter Pins   Cotter pins are fasteners formed from half-round wire into a single  two-stem pin, as in Figure 31.16. They vary in diameter, ranging between  $0.8\\ \\mathrm{mm}$   (0.031 in) and $19\\,\\mathrm{mm}\\,(3/4\\,\\mathrm{in})$ , and in point style, several of which are shown in the ﬁ  g- ure. Cotter pins are inserted into holes in the mating parts and their legs are split to  lock the assembly. They are used to secure parts onto shafts and similar applications. "
    },
    {
        "type": "text",
        "text": " Molding Inserts and Integral Fasteners ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "These assembly methods form a permanent joint between parts by shaping or re- shaping one of the components through a manufacturing process such as casting,  molding, or sheet-metal forming. "
    },
    {
        "type": "text",
        "text": "Inserts in Moldings and Castings   This method involves the placement of a com- ponent into a mold prior to plastic molding or metal casting, so that it becomes a per- manent and integral part of the molding or casting. Inserting a separate component  is preferable to molding or casting its shape if the superior properties (e.g., strength)  of the insert material are required, or the geometry achieved through the use of the  insert is too complex or intricate to incorporate into the mold. Examples of inserts  in molded or cast parts include internally threaded bushings and nuts, externally  threaded studs, bearings, and electrical contacts. Some of these are illustrated in Fig- ure 31.17. Internally threaded inserts must be placed into the mold with threaded  pins to prevent the molding material from ﬂ  owing into the threaded hole. "
    },
    {
        "type": "text",
        "text": "Placing inserts into a mold has certain disadvantages in production: (1) design of  the mold becomes more complicated; (2) handling and placing the insert into the  cavity takes time that reduces production rate; and (3) inserts introduce a foreign  material into the casting or molding, and in the event of a defect, the cast metal or  plastic cannot be easily reclaimed and recycled. Despite these disadvantages, use of  inserts is often the most functional design and least-cost production method. "
    },
    {
        "type": "text",
        "text": "Integral Fasteners   Integral fasteners involve deformation of component parts  so they interlock and create a mechanically fastened joint. This assembly method  is most common for sheet-metal parts. The possibilities, Figure 31.18, include (a)  lanced tabs  to attach wires or shafts to sheet-metal parts; (b)  embossed protrusions ,  "
    },
    {
        "type": "image",
        "img_path": "images/f452ebd7d319440ac61e4cee9b28dbefef0e78ae19c913d5a26a12b550b3911d.jpg",
        "img_caption": "FIGURE 31.17  Examples of molded-in  inserts: (a) threaded  bushing, and  (b) threaded stud. "
    },
    {
        "type": "image",
        "img_path": "images/d3084f5764a2327e5ce9b05244681ece0d08002ddf29d95d170d3ee85dd610e2.jpg",
        "img_caption": "FIGURE 31.18  Integral fasteners: (a) lanced tabs to attach wires or shafts to sheetmetal, (b) embossed protrusions,  similar to riveting, (c) single-lock seaming, (d) beading, and (e) dimpling. Numbers in parentheses indicate sequence  in (b), (c), and (d). "
    },
    {
        "type": "text",
        "text": "in which bosses are formed in one part and ﬂ  attened over the mating assembled part;  (c)  seaming , where the edges of two separate sheet-metal parts or the opposite edges  of the same part are bent over to form the fastening seam—the metal must be ductile  in order for the bending to be feasible; (d)  beading , in which a tube-shaped part is  attached to a smaller shaft (or other round part) by deforming the outer diameter  inward to cause an interference around the entire circumference; and (e)  dimpling — forming of simple round indentations in an outer part to retain an inner part. "
    },
    {
        "type": "text",
        "text": "Crimping , in which the edges of one part are deformed over a mating component,  is another example of integral assembly. A common example involves squeezing the  barrel of an electrical terminal onto a wire (Section 34.5.1). "
    },
    {
        "type": "text",
        "text": "Design for assembly (DFA) has received much attention in recent years because  assembly operations constitute a high labor cost for many manufacturing compa- nies. The key to successful design for assembly can be simply stated [3]: (1) design  the product with as few parts as possible, and (2) design the remaining parts so they  are easy to assemble. The cost of assembly is determined largely during product  design, because that is when the number of separate components in the product  is determined, and decisions are made about how these components will be as- sembled. Once these decisions have been made, there is little that can be done in  manufacturing to inﬂ  uence assembly costs (except, of course, to manage the opera- tions well). "
    },
    {
        "type": "text",
        "text": "This section considers some of the principles that can be applied during product  design to facilitate assembly. Most of the principles have been developed in the con- text of mechanical assembly, although some of them apply to the other assembly and  joining processes. Much of the research in design for assembly has been motivated  by the increasing use of automated assembly systems in industry. Accordingly, our  discussion is divided into two sections, the ﬁ  rst dealing with general principles of  DFA, and the second concerned speciﬁ  cally with design for automated assembly. "
    },
    {
        "type": "text",
        "text": "31.6.1  GENERAL PRINCIPLES OF DFA ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Most of the general principles apply to both manual and automated assembly. Their  goal is to achieve the required design function by the simplest and lowest cost means.  The following recommendations have been compiled from [1], [3], [4], and [6]:\n\n "
    },
    {
        "type": "text",
        "text": "$\\gg$ Use the fewest number of parts possible to reduce the amount of assembly re- quired  . This principle is implemented by combining functions within the same  part that might otherwise be accomplished by separate components (e.g., using  a plastic molded part instead of an assembly of sheet metal parts).\n\n ➢   Reduce the number of threaded fasteners required  . Instead of using separate  threaded fasteners, design the component to utilize snap ﬁ  ts, retaining rings,  integral fasteners, and similar fastening mechanisms that can be accomplished  more rapidly. Use threaded fasteners only where justiﬁ  ed (e.g., where disassem- bly or adjustment is required).\n\n ➢   Standardize fasteners . This is intended to reduce the number of sizes and styles  of fasteners required in the product. Ordering and inventory problems are  reduced, the assembly worker does not have to distinguish between so many  "
    },
    {
        "type": "image",
        "img_path": "images/0662ec93c77d53246c3edd552639fb259915abffb506e762af8730d605c076c6.jpg",
        "img_caption": "FIGURE 31.19  Symmetrical parts are  generally easier to  insert and assemble:  (a) only one rotational  orientation possible for  insertion; (b) two possi- ble orientations; (c) four  possible orientations;  and (d) inﬁ  nite rotational  orientations. "
    },
    {
        "type": "text",
        "text": "separate fasteners, the workstation is simpliﬁ  ed, and the variety of separate fas- tening tools is reduced.\n\n "
    },
    {
        "type": "text",
        "text": "➢   Reduce parts orientation difﬁ  culties  . Orientation problems are generally re- duced by designing a part to be symmetrical and minimizing the number of  asymmetric features. This allows easier handling and insertion during assembly.  This principle is illustrated in Figure 31.19.\n\n ➢   Avoid parts that tangle  . Certain part conﬁ  gurations are more likely to become  entangled in parts bins, frustrating assembly workers or jamming automatic  feeders. Parts with hooks, holes, slots, and curls exhibit more of this tendency  than parts without these features (see Figure 31.20). "
    },
    {
        "type": "text",
        "text": "31.6.2  DESIGN FOR AUTOMATED ASSEMBLY ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Methods suitable for manual assembly are not necessarily the best methods for  automated assembly. Some assembly operations readily performed by a human  worker are quite difﬁ  cult to automate (e.g., assembly using bolts and nuts). To auto- mate the assembly process, parts fastening methods must be speciﬁ  ed during prod- uct design that lend themselves to machine insertion and joining techniques and  do not require the senses, dexterity, and intelligence of human assembly workers.  Following are some recommendations and principles that can be applied in product  design to facilitate automated assembly [6], [10]: "
    },
    {
        "type": "text",
        "text": "➢   Use modularity in product design  . Increasing the number of separate tasks that  are accomplished by an automated assembly system will reduce the reliability of  the system. To alleviate the reliability problem, Riley [10] suggests that the design  of the product be modular in which each module or subassembly has a maximum  of 12 or 13 parts to be produced on a single assembly system. Also, the subassem- bly should be designed around a base part to which other components are added.\n\n "
    },
    {
        "type": "text",
        "text": "➢   Reduce the need for multiple components to be handled at once  . The preferred  practice for automated assembly is to separate the operations at different sta- tions rather than to simultaneously handle and fasten multiple components at  the same workstation.\n\n "
    },
    {
        "type": "text",
        "text": "$\\gg$ Limit the required directions of access . This means that the number of directions  in which new components are added to the existing subassembly should be mini- mized. Ideally, all components should be added vertically from above, if possible.\n\n "
    },
    {
        "type": "text",
        "text": "➢   High-quality components . High performance of an automated assembly system  requires that consistently good-quality components are added at each worksta- tion. Poor quality components cause jams in feeding and assembly mechanisms  that result in downtime.\n\n "
    },
    {
        "type": "text",
        "text": "$\\gg$ Use of snap ﬁ  t assembly . This eliminates the need for threaded fasteners; as- sembly is by simple insertion, usually from above. It requires that the parts be  designed with special positive and negative features to facilitate insertion and  fastening. "
    },
    {
        "type": "text",
        "text": "References ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": " [1] Andreasen, M., Kahler, S., and Lund, T.  Design  for Assembly . Springer-Verlag, New York,  1988.\n\n  [2] Blake, A.  What Every Engineer Should Know  About Threaded Fasteners . Marcel Dekker,  New York, 1986.\n\n  [3] Boothroyd, G., Dewhurst, P ., and Knight,  W.  Product Design for Manufacture and As- sembly . 3rd ed. CRC Taylor & Francis, Boca  Raton, Florida, 2010.\n\n  [4] Bralla, J. G. (ed.).  Design for Manufactur- ability Handbook , 2nd ed. McGraw-Hill, New  York, 1998.\n\n  [5] Dewhurst, P ., and Boothroyd, G. “Design for  Assembly in Action,”  Assembly Engineering ,  January 1987, pp. 64–68.\n\n  [6] Groover, M. P .  Automation, Production Sys- tems, and Computer Integrated Manufacturing ,  3rd ed. Pearson Prentice-Hall, Upper Saddle  River, New Jersey, 2008.\n\n  [7] Groover, M. P ., Weiss, M., Nagel, R. N., and  Odrey, N. G.  Industrial Robotics: Technology,  Programming, and Applications . McGraw- Hill, New York, 1986.\n\n "
    },
    {
        "type": "text",
        "text": " [8] Nof, S. Y., Wilhelm, W. E., and Warnecke, H-J.  Industrial Assembly . Chapman & Hall, New  York, 1997.\n\n  [9] Parmley, R. O. (ed.).  Standard Handbook of  Fastening and Joining , 3rd ed. McGraw-Hill,  New York, 1997.\n\n [10] Riley, F. J.  Assembly Automation, A Manage- ment Handbook , 2nd ed. Industrial Press, New  York, 1999.\n\n [11] Speck, J. A.  Mechanical Fastening, Joining,  and Assembly . Marcel Dekker, New York,  1997.\n\n [12] Whitney, D. E.  Mechanical Assemblies . Oxford  University Press, New York, 2004.\n\n [13] Wick, C., and Veilleux, R. F. (eds.).  Tool and  Manufacturing Engineers Handbook , 4th ed.,  Vol. IV,  Quality Control and Assembly . So- ciety of Manufacturing Engineers, Dearborn,  Michigan, 1987. "
    }
]