[
    {
        "type": "text",
        "text": "Surface  Processing  Operations ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "27 ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The processes discussed in this chapter operate on the  surfaces of parts and/or products. The major catego- ries of surface processing operations are (1) clean- ing, (2) surface treatments, and (3) coating and thin  ﬁ  lm deposition. Cleaning refers to industrial cleaning  processes that remove soils and contaminants that  result from previous processing or the factory envi- ronment. They include both chemical and mechanical  cleaning methods. Surface treatments are mechanical  and physical operations that alter the part surface in  some way, such as improving its ﬁ  nish or impregnating  it with atoms of a foreign material to change its chem- istry and physical properties. \n\n "
    },
    {
        "type": "text",
        "text": "Chapter Contents ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "27.1 Industrial Cleaning Processes "
    },
    {
        "type": "text",
        "text": "27.1.1 Chemical Cleaning 27.1.2 Mechanical Cleaning and  Surface Treatments\n\n "
    },
    {
        "type": "text",
        "text": "27.2 Diffusion and Ion Implantation 27.2.1 Diffusion 27.2.2 Ion Implantation\n\n "
    },
    {
        "type": "text",
        "text": "27.3 Plating and Related Processes "
    },
    {
        "type": "text",
        "text": "Coating and thin ﬁ  lm deposition include various  processes that apply a layer of material to a surface.  Products made of metal are almost always coated by  electroplating (e.g., chrome plating), painting, or other  process. Principal reasons for coating a metal are to  (1) provide corrosion protection, (2) enhance product  appearance (e.g., providing a speciﬁ  ed color or tex- ture), (3) increase wear resistance and/or reduce fric- tion of the surface, (4) increase electrical conductivity,  (5) increase electrical resistance, (6) prepare a metal- lic surface for subsequent processing, and (7) rebuild  surfaces worn or eroded during service. Nonmetallic  materials are also sometimes coated. Examples include  (1) plastic parts coated to give them a metallic appear- ance; (2) antireﬂ  ection coatings on optical glass lenses;  and (3) certain coating and deposition processes used  in the fabrication of semiconductor chips (Chapter 33)  and printed circuit boards (Chapter 34). In all cases,  good adhesion must be achieved between coating and  substrate, and for this to occur the substrate surface  must be very clean. "
    },
    {
        "type": "text",
        "text": "27.3.1  Electroplating 27.3.2 Electroforming 27.3.3 Electroless Plating 27.3.4 Hot Dipping\n\n "
    },
    {
        "type": "text",
        "text": "27.4 Conversion Coating "
    },
    {
        "type": "text",
        "text": "27.4.1 Chemical Conversion Coatings 27.4.2 Anodizing\n\n "
    },
    {
        "type": "text",
        "text": "27.5 Vapor Deposition Processes "
    },
    {
        "type": "text",
        "text": "27.5.1 Physical Vapor Deposition 27.5.2 Chemical Vapor Deposition\n\n "
    },
    {
        "type": "text",
        "text": "27.6 Organic Coatings "
    },
    {
        "type": "text",
        "text": "27.6.1 Application Methods 27.6.2 Powder Coating\n\n "
    },
    {
        "type": "text",
        "text": "27.7 Porcelain Enameling and Other  Ceramic Coatings\n\n "
    },
    {
        "type": "text",
        "text": "27.8 Thermal and Mechanical Coating  Processes 27.8.1 Thermal Surfacing Processes 27.8.2 Mechanical Plating "
    },
    {
        "type": "text",
        "text": " Industrial Cleaning Processes ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Most work parts must be cleaned one or more times during their manufacturing  sequence. Chemical and/or mechanical processes are used to accomplish this clean- ing. Chemical cleaning methods use chemicals to remove unwanted oils and soils  from the workpiece surface. Mechanical cleaning involves removal of substances  from a surface by mechanical operations of various kinds. These operations often  serve other functions such as removing burrs, improving smoothness, adding luster,  and enhancing surface properties.  "
    },
    {
        "type": "text",
        "text": "27.1.1  CHEMICAL CLEANING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A typical surface is covered with various ﬁ  lms, oils, dirt, and other contaminants \n\n (Section 5.3.1). Although some of these substances may operate in a beneﬁ  cial way \n\n (such as the oxide ﬁ  lm on aluminum), it is usually desirable to remove contami- nants from the surface. This section discusses some general considerations related  to cleaning and surveys the principal chemical cleaning processes used in industry. "
    },
    {
        "type": "text",
        "text": "Some of the important reasons why manufactured parts (and products) must be  cleaned are (1) to prepare the surface for subsequent industrial processing, such as  a coating application or adhesive bonding; (2) to improve hygiene conditions for  workers and customers; (3) to remove contaminants that might chemically react  with the surface; and (4) to enhance appearance and performance of the product. "
    },
    {
        "type": "text",
        "text": "General Considerations in Cleaning  There is no single cleaning method  that can be used for all cleaning tasks. Just as various soaps and detergents are  required for different household jobs (laundry, dishwashing, pot scrubbing, bath- tub cleaning, and so forth), various cleaning methods are also needed to solve  different cleaning problems in industry. Important factors in selecting a clean- ing method are (1) the contaminant to be removed, (2) degree of cleanliness  required, (3) substrate material to be cleaned, (4) purpose of the cleaning, (5)  environmental and safety factors, (6) size and geometry of the part, and (7) pro- duction and cost requirements. "
    },
    {
        "type": "text",
        "text": "Various kinds of contaminants build up on part surfaces, either due to previous  processing or the factory environment. To select the best cleaning method, one must  ﬁ  rst identify what must be cleaned. Surface contaminants found in the factory usu- ally divide into one of the following categories: (1) oil and grease, which includes  lubricants used in metalworking; (2) solid particles such as metal chips, abrasive grits,  shop dirt, dust, and similar materials; (3) bufﬁ  ng and polishing compounds; and (4)  oxide ﬁ  lms, rust, and scale. "
    },
    {
        "type": "text",
        "text": "Degree of cleanliness refers to the amount of contaminant remaining after a  given cleaning operation. Parts being prepared to accept a coating (e.g., paint,  metallic ﬁ  lm) or adhesive must be very clean; otherwise, adhesion of the coated  material is jeopardized. In other cases, it may be desirable for the cleaning opera- tion to leave a residue on the part surface for corrosion protection during storage,  in effect replacing one contaminant on the surface by another that is beneﬁ  cial.  Degree of cleanliness is often difﬁ  cult to measure in a quantiﬁ  able way. A simple  test is a  wiping method , in which the surface is wiped with a clean white cloth, and  the amount of soil absorbed by the cloth is observed. It is a nonquantitative but  easy test to use. "
    },
    {
        "type": "text",
        "text": "The substrate material must be considered in selecting a cleaning method, so  that damaging reactions are not caused by the cleaning chemicals. To cite several  examples: aluminum is dissolved by most acids and alkalis; magnesium is attacked  by many acids; copper is attacked by oxidizing acids (e.g., nitric acid); steels are  resistant to alkalis but react with virtually all acids. "
    },
    {
        "type": "text",
        "text": "Some cleaning methods are appropriate to prepare the surface for painting,  while others are better for plating. Environmental protection and worker safety are  becoming increasingly important in industrial processes. Cleaning methods and the  associated chemicals should be selected to avoid pollution and health hazards. "
    },
    {
        "type": "text",
        "text": "Chemical Cleaning Processes  Chemical cleaning uses various types of chemi- cals to effect contaminant removal from the surface. The major chemical cleaning  methods are (1) alkaline cleaning, (2) emulsion cleaning, (3) solvent cleaning, (4)  acid cleaning, and (5) ultrasonic cleaning. In some cases, chemical action is aug- mented by other energy forms; for example, ultrasonic cleaning uses high-frequency  mechanical vibrations combined with chemical cleaning.  "
    },
    {
        "type": "text",
        "text": "Alkaline cleaning  is the most widely used industrial cleaning method. As its  name indicates, it employs an alkali to remove oils, grease, wax, and various types  of particles (metal chips, silica, carbon, and light scale) from a metallic surface.  Alkaline cleaning solutions consist of low-cost, water-soluble salts such as sodi- um and potassium hydroxide (NaOH, KOH), sodium carbonate  $\\left(\\mathrm{Na}_{2}\\mathrm{CO}_{3}\\right)$ , borax  $\\mathrm{(Na_{2}B_{4}O_{7})}$ , phosphates and silicates of sodium and potassium, combined with dis- persants and surfactants in water. The cleaning method is commonly accomplished  by immersion or spraying, usually at temperatures of  $50^{\\circ}\\mathrm{C}$  to  $95\\mathrm{^\\circC}$   $(120^{\\circ}\\mathrm{F}{-}200^{\\circ}\\mathrm{F})$ ).  Following application of the alkaline solution, a water rinse is used to remove the  alkali residue. Metal surfaces cleaned by alkaline solutions are typically electro- plated or conversion coated. "
    },
    {
        "type": "text",
        "text": "Electrolytic cleaning , also called  electrocleaning , is a related process in which  a 3–12-V direct current is applied to an alkaline cleaning solution. The electrolytic  action results in the generation of gas bubbles at the part surface, causing a scrubbing  action that aids in removal of tenacious dirt ﬁ  lms. "
    },
    {
        "type": "text",
        "text": "Emulsion cleaning  uses organic solvents (oils) dispersed in an aqueous solu- tion. The use of suitable emulsiﬁ  ers (soaps) results in a two-phase cleaning ﬂ  uid  (oil-in-water), which functions by dissolving or emulsifying the soils on the part  surface. The process can be used on either metal or nonmetallic parts. Emulsion  cleaning must be followed by alkaline cleaning to eliminate all residues of the  organic solvent prior to plating. "
    },
    {
        "type": "text",
        "text": "In  solvent cleaning , organic soils such as oil and grease are removed from a   metallic  surface by means of chemicals that dissolve the soils. Common application tech- niques include hand-wiping, immersion, spraying, and vapor degreasing.  Vapor  degreasing  uses hot vapors of solvents to dissolve and remove oil and grease on part  surfaces. The common solvents include trich lor ethylene  $\\left(\\mathrm{C}_{2}\\mathrm{HCl}_{3}\\right)$ , methylene chlo- ride  $\\left(\\mathrm{CH}_{2}\\mathrm{Cl}_{2}\\right)$ , and perch lor ethylene  $\\mathrm{(C_{2}C l_{4})}$ , all of which have relatively low boiling  points.  The vapor degreasing process consists of heating the liquid solvent to its  boiling point in a container to produce hot vapors. Parts to be cleaned are then intro- duced into the vapor, which condenses on the relatively cold part surfaces, dissolving  the contaminants and dripping to the bottom of the container. Condensing coils near  the top of the container prevent any vapors from escaping the container into the  surrounding atmosphere. This is important because these solvents are classiﬁ  ed as  hazardous air pollutants under the 1992 Clean Air Act [10]. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Acid cleaning  removes oils and light oxides from metal surfaces by soaking,  spraying, or manual brushing or wiping. The process is carried out at ambient or  elevated temperatures. Common cleaning ﬂ  uids are acid solutions combined with  water-miscible solvents, wetting and emulsifying agents. Cleaning acids include  hydrochloric (HCl), nitric  $({\\mathrm{HNO}}_{3})$ , phosphoric  $(\\mathrm{H}_{3}\\mathrm{P}\\mathrm{O}_{4})$ , and sulfuric  $\\left(\\mathrm{H}_{2}\\mathrm{SO}_{4}\\right)$ , the  selection depending on the base metal and purpose of the cleaning. For example,  phosphoric acid produces a light phosphate ﬁ  lm on the metallic surface, which can  be a useful preparation for painting. A closely related cleaning process is  acid pick- ling , which involves a more severe treatment to remove thicker oxides, rusts, and  scales; it generally results in some etching of the metallic surface, which serves to  improve organic paint adhesion. "
    },
    {
        "type": "text",
        "text": "Ultrasonic cleaning  combines chemical cleaning and mechanical agitation of  the cleaning ﬂ  uid to provide a highly effective method for removing surface con- taminants. The cleaning ﬂ  uid is generally an aqueous solution containing alkaline  detergents. The mechanical agitation is produced by high-frequency vibrations of  sufﬁ  cient amplitude to cause cavitation—formation of low-pressure vapor bubbles  or cavities. As the vibration wave passes a given point in the liquid, the low-pressure  region is followed by a high-pressure front that implodes the cavity, thereby pro- ducing a shock wave capable of penetrating contaminant particles adhering to the  work surface. This rapid cycle of cavitation and implosion occurs throughout the  liquid medium, thus making ultrasonic cleaning effective even on complex and in- tricate internal shapes. The cleaning process is performed at frequencies between  20 and  $45~\\mathrm{kHz}$ , and the cleaning solution is usually at an elevated temperature,  typically $65^{\\circ}\\mathrm{C}$  to $85\\mathrm{{}^{\\circ}C}$  ( $(150^{\\circ}\\mathrm{F}{-}190^{\\circ}\\mathrm{F})$ ). "
    },
    {
        "type": "text",
        "text": "27.1.2  MECHANICAL CLEANING AND SURFACE TREATMENTS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Mechanical cleaning involves the physical removal of soils, scales, or ﬁ  lms from the  work surface of the work part by means of abrasives or similar mechanical action.  The processes used for mechanical cleaning often serve other functions in addition  to cleaning, such as deburring and improving surface ﬁ  nish. "
    },
    {
        "type": "text",
        "text": "Blast Finishing and Shot Peening  Blast ﬁ  nishing uses the high-velocity impact  of particulate media to clean and ﬁ  nish a surface. The most well known of these  methods is  sand blasting , which uses grits of sand  $(\\mathrm{SiO}_{2})$  as the blasting media.  Various other media are also used in blast ﬁ  nishing, including hard abrasives such  as aluminum oxide  $(\\mathrm{Al}_{2}\\mathrm{O}_{3})$  and silicon carbide (SiC), and soft media such as nylon  beads and crushed nut shells. The media is propelled at the target surface by pres- surized air or centrifugal force. In some applications, the process is performed wet,  in which ﬁ  ne particles in a water slurry are directed under hydraulic pressure at  the surface. "
    },
    {
        "type": "text",
        "text": "In  shot peening , a high-velocity stream of small cast steel pellets (called  shot )  is directed at a metallic surface with the effect of cold working and inducing com- pressive stresses into the surface layers. Shot peening is used primarily to improve  fatigue strength of metal parts. Its purpose is therefore different from blast ﬁ  nishing,  although surface cleaning is accomplished as a by-product of the operation. "
    },
    {
        "type": "image",
        "img_path": "images/473293f70190beb4b08929b3cc866cab638abd8bfef5da32958df9a3a54af181.jpg",
        "img_caption": "FIGURE 27.1  Diagram  of tumbling (barrel  ﬁ  nishing) operation  showing “landslide”  action of parts and  abrasive media to ﬁ  nish  the parts. "
    },
    {
        "type": "text",
        "text": "Tumbling and Other Mass Finishing   Tumbling, vibratory ﬁ  nishing, and similar  operations comprise a group of ﬁ  nishing processes known as mass ﬁ  nishing meth- ods.  Mass ﬁ  nishing  involves the ﬁ  nishing of parts in bulk by a mixing action inside a  container, usually in the presence of an abrasive media. The mixing causes the parts  to rub against the media and each other to achieve the desired ﬁ  nishing action. Mass  ﬁ  nishing methods are used for deburring, descaling, deﬂ  ashing, polishing, radiusing,  burnishing, and cleaning. The parts include stampings, castings, forgings, extrusions,  and machined parts. Even plastic and ceramic parts are sometimes subjected to these  mass ﬁ  nishing operations to achieve desired ﬁ  nishing results. The parts processed by  these methods are usually small and are therefore uneconomical to ﬁ  nish individually. "
    },
    {
        "type": "text",
        "text": "Mass ﬁ  nishing methods include tumbling, vibratory ﬁ  nishing, and several tech- niques that utilize centrifugal force.  Tumbling  (also called  barrel ﬁ  nishing  and  tumbling barrel ﬁ  nishing ) involves the use of a horizontally oriented barrel of  hexagonal or octagonal cross-section in which parts are mixed by rotating the bar- rel at speeds of  $10{-}50\\ \\mathrm{rev/min}$ . Finishing is performed by a “landslide” action of  the media and parts as the barrel revolves. As pictured in Figure 27.1, the contents  rise in the barrel due to rotation, followed by a tumbling down of the top layer due  to gravity. This cycle of rising and tumbling occurs continuously and, over time,  subjects all of the parts to the same desired ﬁ  nishing action. However, because  only the top layer of parts is being ﬁ  nished at any moment, barrel ﬁ  nishing is a  relatively slow process compared to other mass ﬁ  nishing methods. It often takes  several hours of tumbling to complete the processing. Other drawbacks of barrel  ﬁ  nishing include high noise levels and large ﬂ  oor space requirements. "
    },
    {
        "type": "text",
        "text": "Vibratory ﬁ  nishing  was introduced in the late 1950s as an alternative to tum- bling. The vibrating vessel subjects all parts to agitation with the abrasive media, as  opposed to only the top layer as in barrel ﬁ  nishing. Consequently, processing times  for vibratory ﬁ  nishing are signiﬁ  cantly reduced. The open tubs used in this method  permit inspection of the parts during processing, and noise is reduced. "
    },
    {
        "type": "text",
        "text": "Most of the  media  in these operations are abrasive; however, some media per- form nonabrasive ﬁ  nishing operations such as burnishing and surface hardening.  The media may be natural or synthetic materials. Natural media include corundum,  granite, limestone, and even hardwood. The problem with these materials is that they  are generally softer (and therefore wear more rapidly) and nonuniform in size (and  sometimes clog in the work parts). Synthetic media can be made with greater consist- ency, both in size and hardness. These materials include  ${\\mathrm{Al}}_{2}{\\mathrm{O}}_{3}$  and SiC, compacted  into a desired shape and size using a bonding material such as a polyester resin. The  shapes for these media include spheres, cones, angle-cut cylinders, and other regular  "
    },
    {
        "type": "image",
        "img_path": "images/e754456b0601293abac805a1fa1958bf4522af4d1194f16bf8c75cad75aeedd7.jpg",
        "img_caption": "FIGURE 27.2  Typical preformed media shapes used in mass ﬁ  nishing operations: (a) abrasive media for ﬁ  nishing,  and (b) steel media for burnishing. "
    },
    {
        "type": "text",
        "text": "geometric forms, as in Figure 27.2(a). Steel is also used as a mass ﬁ  nishing medium in  shapes such as those shown in Figure 27.2(b) for burnishing, surface hardening, and  light deburring operations. The shapes shown in Figure 27.2 come in various sizes.  Selection of media is based on part size and shape, as well as ﬁ  nishing requirements. "
    },
    {
        "type": "text",
        "text": "In most mass ﬁ  nishing processes, a compound is used with the media. The mass  ﬁ  nishing  compound  is a combination of chemicals for speciﬁ  c functions such as  cleaning, cooling, rust inhibiting (of steel parts and steel media), and enhancing  brightness and color of the parts (especially in burnishing). "
    },
    {
        "type": "text",
        "text": " Diffusion and Ion Implantation ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "This section discusses two processes in which the surface of a substrate is impreg- nated with foreign atoms that alter its chemistry and properties. "
    },
    {
        "type": "text",
        "text": "27.2.1  DIFFUSION ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Diffusion involves the alteration of surface layers of a material by diffusing atoms  of a different material (usually an element) into the surface (Section 4.3). The dif- fusion process impregnates the surface layers of the substrate with the foreign ele- ment, but the surface still contains a high proportion of substrate material. A typical  proﬁ  le of composition as a function of depth below the surface for a diffusion coated  metal part is illustrated in Figure 27.3. The characteristic of a diffusion impregnated  surface is that the diffused element has a maximum percentage at the surface and  rapidly declines with distance below the surface. The diffusion process has important  applications in metallurgy and semiconductor manufacture. "
    },
    {
        "type": "text",
        "text": "In metallurgical applications, diffusion is used to alter the surface chemistry of  metals in a number of processes and treatments. One important example is sur- face hardening, typiﬁ  ed by  carburizing ,  nitriding ,  carbonitriding ,  chromizing , and  boronizing  (Section 27.4). In these treatments, one or more elements (C and/or Ni,  Cr, or Bo) are diffused into the surface of iron or steel.  "
    },
    {
        "type": "text",
        "text": "There are other diffusion processes in which corrosion resistance and/or high- temperature oxidation resistance are main objectives. Aluminizing, and siliconizing  are important examples.  Aluminizing , also known as  calorizing , involves diffusion  "
    },
    {
        "type": "image",
        "img_path": "images/eed61e77b93b8607072ea3e49ad0aa4c8b2bd7bce824990901a412690f33ab25.jpg",
        "img_caption": "FIGURE 27.3  Characteristic proﬁ  le of  diffused element as a function of distance  below surface in diffusion. The plot given  here is for carbon diffused into iron.  (Source: [6].) "
    },
    {
        "type": "text",
        "text": "of aluminum into carbon steel, alloy steels, and alloys of nickel and cobalt. The treat- ment is accomplished by either (1)  pack diffusion , in which work parts are packed  with Al powders and baked at high temperature to create the diffusion layer; or (2) a  slurry method , in which the work parts are dipped or sprayed with a mixture of Al  powders and binders, then dried and baked. "
    },
    {
        "type": "text",
        "text": "Siliconizing  is a treatment of steel in which silicon is diffused into the part sur- face to create a layer with good corrosion and wear resistance and moderate heat  resistance. The treatment is carried out by heating the work in powders of silicon  carbide (SiC) in an atmosphere containing vapors of silicon tetrachloride  $\\mathrm{(SiCl_{4})}$ .  Siliconizing is less common than aluminizing. "
    },
    {
        "type": "text",
        "text": "Semiconductor Applications   In semiconductor processing, diffusion of an  impurity element into the surface of a silicon chip is used to change the electrical  properties at the surface to create devices such as transistors and diodes. How dif- fusion is used to accomplish this  doping , as it is called, and other semiconductor  processes is examined in Chapter 33. "
    },
    {
        "type": "text",
        "text": "27.2.2  ION IMPLANTATION ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Ion implantation is an alternative to diffusion when the latter method is not feasible  because of the high temperatures required. The ion implantation process involves  embedding atoms of one (or more) foreign element(s) into a substrate surface using  a high-energy beam of ionized particles. The result is an alteration of the chemical  and physical properties of the layers near the substrate surface. Penetration of atoms  produces a much thinner altered layer than diffusion, as indicated by a comparison  of Figures 27.3 and 27.4. Also, the concentration proﬁ  le of the impregnated element  is quite different from the characteristic diffusion proﬁ  le. "
    },
    {
        "type": "text",
        "text": "Advantages of ion implantation include (1) low-temperature processing, (2)  good control and reproducibility of penetration depth of impurities, and (3) solubil- ity limits can be exceeded without precipitation of excess atoms. Ion implantation  ﬁ  nds some of its applications as a substitute for certain coating processes, where its  advantages include (4) no problems with waste disposal as in electroplating and  "
    },
    {
        "type": "image",
        "img_path": "images/932d45d03f47e0f3dad16685fb78df4b687947ffdf2da3cff48d33a3d60127f5.jpg",
        "img_caption": "FIGURE 27.4  Proﬁ  le of surface chemistry  as treated by ion implantation. (Source:  [17].) Shown here is a typical plot for boron  implanted in silicon. Note the difference  in proﬁ  le shape and depth of altered layer  compared to diffusion in Figure 27.3. "
    },
    {
        "type": "text",
        "text": "many coating processes, and (5) no discontinuity between coating and substrate.  Principal applications of ion implantation are in modifying metal surfaces to im- prove properties and fabrication of semiconductor devices. "
    },
    {
        "type": "text",
        "text": " Plating and Related Processes ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Plating involves the coating of a thin metallic layer onto the surface of a substrate mate- rial. The substrate is usually metallic, although methods are available to plate plastic and  ceramic parts. The most familiar and widely used plating technology is electroplating. "
    },
    {
        "type": "text",
        "text": "27.3.1  ELECTROPLATING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Electroplating, also known as  electrochemical plating , is an electrolytic process  (Section 4.5) in which metal ions in an electrolyte solution are deposited onto a cath- ode work part. The setup is shown in Figure 27.5. The anode is generally made of the  metal being plated and thus serves as the source of the plate metal. Direct current  from an external power supply is passed between the anode and the cathode. The  "
    },
    {
        "type": "image",
        "img_path": "images/ada1ec221120ad7b9a3b0406209f15c85dbb837a796f452ec69f5918cbf6e65c.jpg"
    },
    {
        "type": "text",
        "text": "electrolyte is an aqueous solution of acids, bases, or salts; it conducts electric current  by the movement of plate metal ions in solution. For optimum results, parts must be  chemically cleaned just prior to electroplating. "
    },
    {
        "type": "text",
        "text": "Principles of Electroplating   Electrochemical plating is based on Faraday’s two  physical laws. Brieﬂ  y, the laws state: (1) the mass of a substance liberated in elec- trolysis is proportional to the quantity of electricity passed through the cell; and (2)  the mass of the material liberated is proportional to its electrochemical equivalent  (ratio of atomic weight to valence). The effects can be summarized in the equation "
    },
    {
        "type": "equation",
        "text": "\n$$\nV=C I t\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $V=$  volume of metal plated, $\\mathrm{mm}^{3}\\,(\\mathrm{in}^{3});C=$ plating constant, which depends on  electrochemical equivalent and density, $\\mathrm{mm}^{3}$ /amp-s  $(\\mathrm{in}^{3})$ /amp-min); $I=$  current, amps;  and $t=$  time during which current is applied, s (min). The product $I t\\left({\\mathrm{current}}\\times{\\mathrm{time}}\\right)$   is the electrical charge passed in the cell, and the value of  $C$  indicates the amount of  plating material deposited onto the cathodic work part per electrical charge. "
    },
    {
        "type": "text",
        "text": "For most plating metals, not all of the electrical energy in the process is used for  deposition; some energy may be consumed in other reactions, such as the liberation of  hydrogen at the cathode. This reduces the amount of metal plated. The actual amount  of metal deposited on the cathode (work part) divided by the theoretical amount giv- en by Equation (27.1) is called the  cathode efﬁ  ciency . Taking the cathode efﬁ  ciency  into account, a more realistic equation for determining the volume of metal plated is "
    },
    {
        "type": "equation",
        "text": "\n$$\nV=E C I t\n$$\n ECIt  ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $E=$  cathode efﬁ  ciency, and the other terms are deﬁ  ned as before. Typical val- ues of cathode efﬁ  ciency $E$  and plating constant $C$  for different metals are presented  in Table 27.1. The average plating thickness can be determined from the following: "
    },
    {
        "type": "equation",
        "text": "\n$$\nd={\\frac{V}{A}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $d=$  plating depth or thickness,  $\\mathrm{mm}$  (in);  $V=$ volume of plate metal from  Equation (27.2); and $A=$  surface area of plated part, $\\mathrm{mm}^{2}\\left(\\mathrm{in}^{2}\\right)$ . "
    },
    {
        "type": "text",
        "text": "Example 27.1  Electroplating ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A steel part with surface area $A=125\\,\\mathrm{cm}^{2}$  is to be nickel plated. What average  plating thickness will result if 12 amps are applied for  $15\\,\\mathrm{{min}}$  in an acid sulfate  electrolyte bath? "
    },
    {
        "type": "text",
        "text": "Solution:  From Table 27.1, the cathode efﬁ  ciency for nickel is $E=0.95$  and the  plating constant  $C=3.42(10^{-2})\\;\\mathrm{mm}^{3}/\\mathrm{a}$ mp-s. Using Equation (27.2), the total  amount of plating metal deposited onto the part surface in  $15\\,\\mathrm{{min}}$  is given by "
    },
    {
        "type": "equation",
        "text": "\n$$\nV=0.95\\:(3.42\\times10^{-2})\\:(12)\\:(15)\\:(60)=350.9\\:\\mathrm{mm}^{3}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "This is spread across an area  $A=125\\;\\mathrm{cm}^{2}=12{,}500\\;\\mathrm{mm}^{2}$ , so the average plate  thickness is "
    },
    {
        "type": "equation",
        "text": "\n$$\nd={\\frac{350.9}{12500}}=\\mathbf{0.028\\mm}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "table",
        "img_path": "images/e1ec198b3b78014799767eefd44bdd0afbe984568a08adaec3199e410ce00ef5.jpg",
        "table_caption": "TABLE  •  27.1  Typical cathode efﬁ  ciencies in electroplating and values of plating  constant  C. ",
        "table_footnote": "Compiled from [17]. a Most common valence given in parenthesis ( ); this is the value assumed in determining the plating  constant  $C$ . For a different valence, compute the new $C$  by multiplying  $C$  value in the table by the most  common valence and then dividing by the new valence. "
    },
    {
        "type": "text",
        "text": "Methods and Applications   A variety of equipment is available for electro- plating, the choice depending on part size and geometry, throughput requirements,  and plating metal. The principal methods are (1) barrel plating, (2) rack plating, and  (3) strip plating.  Barrel plating  is performed in rotating barrels that are oriented  either horizontally or at an oblique angle  $(35^{\\circ})$ . The method is suited to the plating  of many small parts in a batch. Electrical contact is maintained through the tumbling  action of the parts themselves and by means of an externally connected conductor  that projects into the barrel. There are limitations to barrel plating; the tumbling  action inherent in the process may damage soft metal parts, threaded components,  parts requiring good ﬁ  nishes, and heavy parts with sharp edges. "
    },
    {
        "type": "text",
        "text": "Rack plating  is used for parts that are too large, heavy, or complex for barrel plat- ing. The racks are made of heavy-gauge copper wire, formed into suitable shapes for  holding the parts and conducting current to them. The racks are fabricated so that  work parts can be hung on hooks, or held by clips, or loaded into baskets. To avoid  plating of the copper itself, the racks are covered with insulation except in locations  where part contact occurs. The racks containing the parts are moved through a se- quence of tanks that perform the electroplating operation.  Strip plating  is a high- production method in which the work consists of a continuous strip that is pulled  through the plating solution by means of a take-up reel. Plated wire is an example of  a suitable application. Small sheet-metal parts held in a long strip can also be plated  by this method. The process can be set up so that only speciﬁ  c regions of the parts  are plated, for example, contact points plated with gold on electrical connectors. "
    },
    {
        "type": "text",
        "text": "Common coating metals in electroplating include zinc, nickel, tin, copper, and  chromium. Steel is the most common substrate metal. Precious metals (gold, silver,  platinum) are plated on jewelry. Gold is also used for electrical contacts. "
    },
    {
        "type": "text",
        "text": "Zinc-plated  steel products include fasteners, wire goods, electric switch boxes,  and various sheet-metal parts. The zinc coating serves as a sacriﬁ  cial barrier to the  corrosion of the steel beneath. An alternative process for coating zinc onto steel is  galvanizing (Section 27.3.4).  Nickel plating  is used for corrosion resistance and dec- orative purposes over steel, brass, zinc die castings, and other metals. Applications  include automotive trim and other consumer goods. Nickel is also used as a base  coat under a much thinner chrome plate.  Tin plate  is still widely used for corrosion  protection in “tin cans” and other food containers. Tin plate is also used to improve  solderability of electrical components. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Copper  has several important applications as a plating metal. It is widely used as a  decorative coating on steel and zinc, either alone or alloyed with zinc as brass plate. It  also has important plating applications in printed circuit boards (Section 34.2). Finally,  copper is often plated on steel as a base beneath nickel and/or chrome plate.  Chromi- um plate  (popularly known as  chrome plate ) is valued for its decorative appearance  and is widely used in automotive products, ofﬁ  ce furniture, and kitchen appliances. It  also produces one of the hardest of all electroplated coatings, and so it is widely used  for parts requiring wear resistance (e.g., hydraulic pistons and cylinders, piston rings,  aircraft engine components, and thread guides in textile machinery). "
    },
    {
        "type": "text",
        "text": "27.3.2  ELECTROFORMING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "This process is virtually the same as electroplating but its purpose is quite differ- ent. Electroforming involves electrolytic deposition of metal onto a pattern until  the required thickness is achieved; the pattern is then removed to leave the formed  part. Whereas typical plating thickness is only about  $0.05\\ \\mathrm{mm}$  (0.002 in) or less,  electroformed parts are often substantially thicker, so the production cycle is pro- portionally longer. "
    },
    {
        "type": "text",
        "text": "Patterns used in electroforming are either solid or expendable. Solid patterns have  a taper or other geometry that permits removal of the electroplated part. Expendable  patterns are destroyed during part removal; they are used when part shape precludes  a solid pattern. Expendable patterns are either fusible or soluble. The fusible type is  made of low-melting alloys, plastic, wax, or other material that can be removed by  melting. When nonconductive materials are used, the pattern must be metallized to  accept the electro deposited coating. Soluble patterns are made of a material that can  be readily dissolved by chemicals; for example, aluminum can be dissolved in sodium  hydroxide (NaOH). "
    },
    {
        "type": "text",
        "text": "Electroformed parts are commonly fabricated of copper, nickel, and nickel cobalt  alloys. Applications include ﬁ  ne molds for lenses, compact discs (CDs), and vide- odiscs (DVDs); copper foil used to produce blank printed circuit boards; and plates  for embossing and printing. Molds for compact discs and videodiscs represent a de- manding application because the surface details that must be imprinted on the disc  are measured in $\\mu\\mathrm{m}$   $(1\\,\\mu\\mathrm{m}=10^{-6}\\,\\mathrm{m})$ ). These details are readily obtained in the mold  by electroforming. "
    },
    {
        "type": "text",
        "text": "27.3.3  ELECTROLESS PLATING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Electroless plating is a plating process driven entirely by chemical reactions—no  external source of electric current is required. Deposition of metal onto a part  surface occurs in an aqueous solution containing ions of the desired plating metal.  The process uses a reducing agent, and the work part surface acts as a catalyst for  the reaction. "
    },
    {
        "type": "text",
        "text": "The metals that can be electroless plated are limited; and for those that can be  processed by this technique, the cost is generally greater than electrochemical plat- ing. The most common electroless plating metal is nickel and certain of its alloys  (Ni–Co, Ni–P , and Ni–B). Copper and, to a lesser degree, gold are also used as plating  metals. Nickel plating by this process is used for applications requiring high resist- ance to corrosion and wear. Electroless copper plating is used to plate through holes  of printed circuit boards (Section 34.2.3). Cu can also be plated onto plastic parts  for decorative purposes. Advantages sometimes cited for electroless plating include  (1) uniform plate thickness on complex part geometries (a problem with electroplat- ing); (2) the process can be used on both metallic and nonmetallic substrates; and  (3) no need for a DC power supply to drive the process. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "27.3.4  HOT DIPPING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Hot dipping is a process in which a metal substrate is immersed in a molten bath of  a second metal; upon removal, the second metal is coated onto the ﬁ  rst. Of course,  the ﬁ  rst metal must possess a higher melting temperature than the second. The most  common substrate metals are steel and iron. Zinc, aluminum, tin, and lead are the  common coating metals. Hot dipping works by forming transition layers of varying  alloy compositions. Next to the substrate are normally intermetallic compounds of  the two metals; at the exterior are solid solution alloys consisting predominantly of  the coating metal. The transition layers provide excellent adhesion of the coating. "
    },
    {
        "type": "text",
        "text": "The primary purpose of hot dipping is corrosion protection. Two mechanisms nor- mally operate to provide this protection: (1) barrier protection—the coating simply  serves as a shield for the metal beneath; and (2) sacriﬁ  cial protection—the coating  corrodes by a slow electrochemical process to preserve the substrate. "
    },
    {
        "type": "text",
        "text": "Hot dipping goes by different names, depending on coating metal:  galvaniz- ing  is when zinc  $(Z\\mathrm{n})$  is coated onto steel or iron;  aluminizing  refers to coating  of aluminum (Al) onto a substrate;  tinning  is coating of tin (Sn); and  terneplate describes the plating of lead–tin (Pb-Sn) alloy onto steel. Galvanizing is by far the  most important hot dipping process, dating back about 200 years. It is applied to  ﬁ  nished steel and iron parts in a batch process; and to sheet, strip, piping, tubing,  and wire in an automated continuous process. Coating thickness is typically 0.04  to $0.09\\ \\mathrm{mm}$  (0.0016–0.0035 in). Thickness is controlled largely by immersion time.  Bath temperature is maintained at around $450^{\\circ}\\mathrm{C}$   $(850^{\\circ}\\mathrm{F})$ . "
    },
    {
        "type": "text",
        "text": "Commercial use of aluminizing is on the rise, gradually increasing in market share  relative to galvanizing. Hot-dipped aluminum coatings provide excellent corrosion  protection, in some cases ﬁ  ve times more effective than galvanizing [17]. Tin plating  by hot dipping provides a nontoxic corrosion protection for steel in applications  for food containers, dairy equipment, and soldering applications. Hot dipping has  gradually been overtaken by electroplating as the preferred commercial method for  plating of tin onto steel. Terneplating involves hot dipping of a lead–tin alloy onto  steel. The alloy is predominantly lead (only $2\\%–15\\%$  Sn); however, tin is required to  obtain satisfactory adhesion of the coating. Terneplate is the lowest cost of the coat- ing methods for steel, but its corrosion protection is limited. "
    },
    {
        "type": "text",
        "text": "Conversion coating refers to a family of processes in which a thin ﬁ  lm of oxide, phos- phate, or chromate is formed on a metallic surface by chemical or electrochemical  reaction. Immersion and spraying are the two common methods of exposing the  metal surface to the reacting chemicals. The common metals treated by conversion  coating are steel (including galvanized steel), zinc, and aluminum. However, nearly  any metal product can beneﬁ  t from the treatment. The important reasons for using  a conversion coating process are (1) to provide corrosion protection, (2) to prepare  the surface for painting, (3) to increase wear resistance, (4) to permit the surface to  better hold lubricants for metal forming processes, (5) to increase electrical resist- ance of surface, (6) to provide a decorative ﬁ  nish, and (7) for part identiﬁ  cation [17]. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Conversion coating processes divide into two categories: (1) chemical treat- ments, which involve a chemical reaction only, and (2) anodizing, which consists of  an electrochemical reaction to produce an oxide coating (anodize is a contraction  of  anodic oxidize ). "
    },
    {
        "type": "text",
        "text": "27.4.1  CHEMICAL CONVERSION COATINGS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "These processes expose the base metal to certain chemicals that form thin, nonme- tallic surface ﬁ  lms. Similar reactions occur in nature; the oxidation of iron and alumi- num are examples. Whereas rusting is progressively destructive of iron, formation of  a thin ${\\mathrm{Al}}_{2}{\\mathrm{O}}_{3}$  coating on aluminum protects the base metal. It is the purpose of these  chemical conversion treatments to accomplish the latter effect. The two main proc- esses are phosphate and chromate coating. "
    },
    {
        "type": "text",
        "text": "Phosphate coating  transforms the base metal surface into a protective phosphate  ﬁ  lm by exposure to solutions of certain phosphate salts (e.g., Zn, Mg, and Ca) to- gether with dilute phosphoric acid  $\\left(\\mathrm{H}_{3}\\mathrm{NO}_{4}\\right)$ . The coatings range in thickness from  0.0025 to  $0.05~\\mathrm{mm}$  (0.0001–0.002 in). The most common base metals are zinc and  steel, including galvanized steel. The phosphate coating serves as a useful prepara- tion for painting in the automotive and heavy appliance industries. "
    },
    {
        "type": "text",
        "text": "Chromate coating  converts the base metal into various forms of chromate  ﬁ  lms using aqueous solutions of chromic acid, chromate salts, and other chemicals.  Metals treated by this method include aluminum, cadmium, copper, magnesium,  and zinc (and their alloys). Immersion of the base part is the common method of  application. Chromate conversion coatings are somewhat thinner than phosphate,  typically less than $0.0025\\;\\mathrm{mm}$  (0.0001 in). Usual reasons for chromate coating are  (1) corrosion protection, (2) base for painting, and (3) decorative purposes. Chro- mate coatings can be clear or colorful; available colors include olive drab, bronze,  yellow, or bright blue. "
    },
    {
        "type": "text",
        "text": "27.4.2  ANODIZING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Although the previous processes are normally performed without electrolysis, ano- dizing is an electrolytic treatment that produces a stable oxide layer on a metallic  surface. Its most common applications are with aluminum and magnesium, but it is  also applied to zinc, titanium, and other less common metals. Anodized coatings are  used primarily for decorative purposes; they also provide corrosion protection. "
    },
    {
        "type": "text",
        "text": "It is instructive to compare anodizing to electroplating, because they are both elec- trolytic processes. Two differences stand out. (1) In electrochemical plating, the work  part to be coated is the cathode in the reaction. By contrast, in anodizing, the work is  the anode, whereas the processing tank is cathodic. (2) In electroplating, the coating  is grown by adhesion of ions of a second metal to the base metal surface. In anodizing,  the surface coating is formed through chemical reaction of the substrate metal into  an oxide layer. "
    },
    {
        "type": "text",
        "text": "Anodized coatings usually range in thickness between 0.0025 and  $0.075\\,\\mathrm{\\mm}$   (0.0001 and 0.003 in). Dyes can be incorporated into the anodizing process to cre- ate a wide variety of colors; this is especially common in aluminum anodizing. Very  thick coatings up to $0.25\\:\\mathrm{mm}$  (0.010 in) can also be formed on aluminum by a special  process called  hard anodizing ; these coatings are noted for high resistance to wear  and corrosion. "
    },
    {
        "type": "text",
        "text": " Vapor Deposition Processes ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The vapor deposition processes form a thin coating on a substrate by either con- densation or chemical reaction of a gas onto the surface of the substrate. The two  categories of processes that fall under this heading are physical vapor deposition  and chemical vapor deposition. "
    },
    {
        "type": "text",
        "text": "27.5.1  PHYSICAL VAPOR DEPOSITION ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Physical vapor deposition (PVD) is a group of thin ﬁ  lm processes in which a mate- rial is converted into its vapor phase in a vacuum chamber and condensed onto a  substrate surface as a very thin layer. PVD can be used to apply a wide variety of  coating materials: metals, alloys, ceramics and other inorganic compounds, and even  certain polymers. Possible substrates include metals, glass, and plastics. Thus, PVD  represents a versatile coating technology, applicable to an almost unlimited combi- nation of coating substances and substrate materials. "
    },
    {
        "type": "text",
        "text": "Applications of PVD include thin decorative coatings on plastic and metal parts  such as trophies, toys, pens and pencils, watchcases, and interior trim in automo- biles. The coatings are thin ﬁ  lms of aluminum (around  $150~\\mathrm{nm}$ ) coated with clear  lacquer to give a high gloss silver or chrome appearance. Another use of PVD is  to apply antireﬂ  ection coatings of magnesium ﬂ  uoride  $\\left(\\mathrm{MgF}_{2}\\right)$  onto optical lenses.  PVD is applied in the fabrication of electronic devices, principally for depositing  metal to form electrical connections in integrated circuits. Finally, PVD is widely  used to coat titanium nitride (TiN) onto cutting tools and plastic injection molds  for wear resistance. "
    },
    {
        "type": "text",
        "text": "All physical vapor deposition processes consist of the following steps: (1) synthe- sis of the coating vapor, (2) vapor transport to the substrate, and (3) condensation of  vapors onto the substrate surface. These steps are generally carried out inside a vac- uum chamber, so evacuation of the chamber must precede the actual PVD process. "
    },
    {
        "type": "text",
        "text": "Synthesis of the coating vapor can be accomplished by any of several methods,  such as electric resistance heating or ion bombardment to vaporize an existing solid  (or liquid). These and other variations result in several PVD processes. They are  grouped into three principal types: (1) vacuum evaporation, (2) sputtering, and (3)  ion plating. Table 27.2 presents a summary of these processes. "
    },
    {
        "type": "text",
        "text": "Vacuum Evaporation  Certain materials (mostly pure metals) can be deposited  onto a substrate by ﬁ  rst transforming them from solid to vapor state in a vacuum  and then letting them condense on the substrate surface. The setup for the vacuum  evaporation process is shown in Figure 27.6. The material to be deposited, called the  source, is heated to a sufﬁ  ciently high temperature that it evaporates (or sublimes).  Because heating is accomplished in a vacuum, the temperature required for vapori- zation is signiﬁ  cantly below the corresponding temperature required at atmospheric  "
    },
    {
        "type": "table",
        "img_path": "images/ae136adf477794d8ac9964c7f9e6124a24c07d2a97f04e133be12b50fc26cbc4.jpg",
        "table_caption": "TABLE  •  27.2  Summary of physical vapor deposition (PVD) processes. ",
        "table_footnote": "Compiled from [2]. "
    },
    {
        "type": "text",
        "text": "pressure. Also, the absence of air in the chamber prevents oxidation of the source  material at the heating temperatures. "
    },
    {
        "type": "text",
        "text": "Various methods can be used to heat and vaporize the material. A container must  be provided to hold the source material before vaporization. Among the impor- tant vaporization methods are resistance heating and electron beam bombardment.  Resistance heating  is the simplest technology. A refractory metal (e.g., W, Mo) is  formed into a suitable container to hold the source material. Current is applied to  heat the container, which then heats the material in contact with it. One problem  with this heating method is possible alloying between the holder and its contents, so  that the deposited ﬁ  lm becomes contaminated with the metal of the resistance heat- ing container. In  electron beam evaporation , a stream of electrons at high velocity  is directed to bombard the surface of the source material to cause vaporization. By  contrast with resistance heating, very little energy acts to heat the container, thus  minimizing contamination of the container material with the coating. "
    },
    {
        "type": "text",
        "text": "Whatever the vaporization technique, evaporated atoms leave the source and  follow straight-line paths until they collide with other gas molecules or strike a  solid surface. The vacuum inside the chamber virtually eliminates other gas mol- ecules, thus reducing the probability of collisions with source vapor atoms. The  substrate surface to be coated is usually positioned relative to the source so that it  "
    },
    {
        "type": "image",
        "img_path": "images/acfdf4d1c4845daba9c828184fed37000602a1d17cbecbb7b2f0707a86c10fc0.jpg",
        "img_caption": "FIGURE 27.6  Setup for  vacuum evaporation physical  vapor deposition. "
    },
    {
        "type": "text",
        "text": "is the likely solid surface on which the vapor atoms will be deposited. A mechani- cal manipulator is sometimes used to rotate the substrate so that all surfaces are  coated. Upon contact with the relative cool substrate surface, the energy level of  the impinging atoms is suddenly reduced to the point where they cannot remain in  a vapor state; they condense and become attached to the solid surface, forming a  deposited thin ﬁ  lm. "
    },
    {
        "type": "text",
        "text": "Sputtering  If the surface of a solid (or liquid) is bombarded by atomic particles of  sufﬁ  ciently high energy, individual atoms of the surface may acquire enough energy  due to the collision that they are ejected from the surface by transfer of momentum.  This is the process known as sputtering. The most convenient form of high energy  particle is an ionized gas, such as argon, energized by means of an electric ﬁ  eld to  form a plasma. As a PVD process,  sputtering  involves bombardment of the cathodic  coating material with argon ions  $\\left(\\mathrm{Ar^{+}}\\right)$ , causing surface atoms to escape and then  be deposited onto a substrate, forming a thin ﬁ  lm on the substrate surface. The sub- strate must be placed close to the cathode and is usually heated to improve bonding  of the coating atoms. A typical arrangement is shown in Figure 27.7. "
    },
    {
        "type": "text",
        "text": "Whereas vacuum evaporation is generally limited to metals, sputtering can be  applied to nearly any material—metallic and nonmetallic elements; alloys, ceramics,  and polymers. Films of alloys and compounds can be sputtered without changing their  chemical compositions. Films of chemical compounds can also be deposited by employ- ing reactive gases that form oxides, carbides, or nitrides with the sputtered metal. "
    },
    {
        "type": "text",
        "text": "Drawbacks of sputtering PVD include (1) slow deposition rates and (2) because  the ions bombarding the surface are a gas, traces of the gas can usually be found  in the coated ﬁ  lms, and the entrapped gases sometimes affect mechanical proper- ties adversely. "
    },
    {
        "type": "text",
        "text": "Ion Plating  Ion plating uses a combination of sputtering and vacuum evapora- tion to deposit a thin ﬁ  lm onto a substrate. The process works as follows. The sub- strate is set up to be the cathode in the upper part of the chamber, and the source  material is placed below it. A vacuum is then established in the chamber. Argon gas  is admitted and an electric ﬁ  eld is applied to ionize the gas  $\\left(\\mathrm{Ar^{+}}\\right)$  and establish a  plasma. This results in ion bombardment (sputtering) of the substrate so that its sur- face is scrubbed to a condition of atomic cleanliness (interpret this as “very clean”).  "
    },
    {
        "type": "image",
        "img_path": "images/dc44094aa06ccc79fc1c32286684d874da622471c16a68f72e4ef0e9ebb24794.jpg",
        "img_caption": "FIGURE 27.7  One possible setup for  sputtering, a form of  physical vapor  deposition. "
    },
    {
        "type": "text",
        "text": "Next, the source material is heated sufﬁ  ciently to generate coating vapors. The heat- ing methods used here are similar to those used in vacuum evaporation: resistance  heating, electron beam bombardment, and so on. The vapor molecules pass through  the plasma and coat the substrate. Sputtering is continued during deposition, so that  the ion bombardment consists not only of the original argon ions but also source  material ions that have been energized while being subjected to the same energy  ﬁ  eld as the argon. The effect of these processing conditions is to produce ﬁ  lms of  uniform thickness and excellent adherence to the substrate. "
    },
    {
        "type": "text",
        "text": "Ion plating is applicable to parts having irregular geometries, due to the scattering  effects that exist in the plasma ﬁ  eld. An example of interest here is TiN coating of  high-speed steel cutting tools (e.g., drill bits). In addition to coating uniformity and  good adherence, other advantages of the process include high deposition rates, high  ﬁ  lm densities, and the capability to coat the inside walls of holes and other hollow  shapes. "
    },
    {
        "type": "text",
        "text": "27.5.2  CHEMICAL VAPOR DEPOSITION ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Physical vapor deposition involves deposition of a coating by condensation onto  a substrate from the vapor phase; it is strictly a physical process. By comparison,  chemical vapor deposition  (CVD) involves the interaction between a mixture of  gases and the surface of a heated substrate, causing chemical decomposition of some  of the gas constituents and formation of a solid ﬁ  lm on the substrate. The reactions  take place in an enclosed reaction chamber. The reaction product (either a metal  or a compound) nucleates and grows on the substrate surface to form the coating.  Most CVD reactions require heat. However, depending on the chemicals involved,  the reactions can be driven by other possible energy sources, such as ultraviolet light  or plasma. CVD includes a wide range of pressures and temperatures; and it can be  applied to a great variety of coating and substrate materials. "
    },
    {
        "type": "text",
        "text": "Industrial metallurgical processes based on chemical vapor deposition date  back to the 1800s (e.g., the Mond process in Table 27.3). Modern interest in CVD is  focused on its coating applications such as coated cemented carbide tools, solar cells,  depositing refractory metals on jet engine turbine blades, and other applications  where resistance to wear, corrosion, erosion, and thermal shock are important. In  addition, CVD is an important technology in integrated circuit fabrication. "
    },
    {
        "type": "text",
        "text": "Advantages typically cited for CVD include (1) capability to deposit refractory  materials at temperatures below their melting or sintering temperatures; (2) control  of grain size is possible; (3) the process is carried out at atmospheric pressure—it  does not require vacuum equipment; and (4) good bonding of coating to substrate  surface [1]. Disadvantages include (1) corrosive and/or toxic nature of chemicals  generally necessitates a closed chamber as well as special pumping and disposal  equipment; (2) certain reaction ingredients are relatively expensive; and (3) mate- rial utilization is low. "
    },
    {
        "type": "text",
        "text": "CVD Materials and Reactions   In general, metals that are readily electroplat- ed are not good candidates for CVD, owing to the hazardous chemicals that must  be used and the costs of safeguarding against them. Metals suitable for coating by  CVD include tungsten, molybdenum, titanium, vanadium, and tantalum. Chemical  vapor deposition is especially suited to the deposition of compounds, such as alumi- num oxide  $(\\mathrm{Al}_{2}\\mathrm{O}_{3})$ ), silicon dioxide  $(\\mathrm{SiO}_{2})$ , silicon nitride  $\\mathrm{(Si}_{3}\\mathrm{N}_{4}\\mathrm{)}$ , titanium carbide  "
    },
    {
        "type": "text",
        "text": "",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "TABLE  •  27.3  Some examples of reactions in chemical vapor deposition (CVD).  ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "1.   The  Mond process  includes a CVD process for decomposition of nickel from nickel carbonyl  $\\mathrm{(Ni(CO)_{4})}$ ,  which is an intermediate compound formed in reducing nickel ore: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\mathrm{Ni(CO)_{4}\\xrightarrow{200^{\\circ}C\\left(400^{\\circ}F\\right)}N i+4C O}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "2.   Coating of titanium carbide (TiC) onto a substrate of cemented tungsten carbide  $\\mathrm{(WC-Co)}$  to produce a  high-performance cutting tool: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\mathrm{TiCl_{4}+C H_{4}\\,{\\frac{1000^{\\circ}C\\left(1800^{\\circ}F\\right)}{e x c e s s\\,H_{2}}}\\,T i C+4H C l}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "3.   Coating of titanium nitride (TiN) onto a substrate of cemented tungsten carbide (WC–Co) to produce a  high-performance cutting tool: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\mathrm{TilCl_{4}}+0.5\\mathrm{N_{2}}+2\\mathrm{H_{2}}\\xrightarrow{900^{\\circ}\\mathrm{C}\\,(1650^{\\circ}\\mathrm{F})}\\mathrm{TiN}+4\\mathrm{HCl}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "4.   Coating of aluminum oxide  $(\\mathrm{Al}_{2}\\mathrm{O}_{3,\\right.}$ ) onto a substrate of cemented tungsten carbide (WC–Co) to produce a  high-performance cutting tool: "
    },
    {
        "type": "equation",
        "text": "\n$$\n2\\mathrm{AlCl}_{3}+3\\mathrm{CO}_{2}+3\\mathrm{H}_{2}\\xrightarrow{500^{\\circ}\\mathrm{C}\\left(900^{\\circ}\\mathrm{F}\\right)}\\mathrm{Al}_{2}\\mathrm{O}_{3}+3\\mathrm{CO}+6\\mathrm{HCl}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "5.   Coating of silicon nitride $\\mathrm{(Si_{3}N_{4})}$  onto silicon (Si), a process in semiconductor manufacturing: "
    },
    {
        "type": "equation",
        "text": "\n$$\n3\\mathrm{{SiF}_{4}}+4\\mathrm{{NH}_{3}}\\,{\\xrightarrow[]{1000^{\\circ}C\\,(1800^{\\circ}F)}}\\,{\\mathrm{{Si}_{3}\\mathrm{{N}_{4}}+12\\mathrm{{HF}}}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "6.   Coating of silicon dioxide  $(\\mathrm{SiO}_{2})$ ) onto silicon (Si), a process in semiconductor manufacturing: "
    },
    {
        "type": "equation",
        "text": "\n$$\n2\\mathrm{SiCl}_{3}+3\\mathrm{H}_{2}\\mathrm{O}+0.5\\mathrm{O}_{2}\\xrightarrow{900^{\\circ}\\mathrm{C}(1600^{\\circ}\\mathrm{F})}2\\mathrm{SiO}_{2}+6\\mathrm{HCl}\n$$\n  6HCl  ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "7.   Coating of the refractory metal tungsten (W) onto a substrate, such as a jet engine turbine blade: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\mathrm{W}\\mathrm{F}_{6}+3\\mathrm{H}_{2}\\xrightarrow{600^{\\circ}\\mathrm{C}\\left(1100^{\\circ}\\mathrm{F}\\right)}\\mathbf{W}+6\\mathrm{HF}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Compiled from [6], [13], and [17]. "
    },
    {
        "type": "text",
        "text": "(TiC), and titanium nitride (TiN). Figure 27.8 illustrates the application of both  CVD and PVD to provide multiple wear-resistant coatings on a cemented carbide  cutting tool. "
    },
    {
        "type": "text",
        "text": "The commonly used reacting gases or vapors are metallic hydrides  $\\left(\\mathrm{MHz}\\right)$ , chlo- rides  $\\left(\\mathbf{M}\\mathbf{C}\\mathbf{l}_{\\mathrm{x}}\\right)$ , ﬂ  uorides  $\\left(\\mathbf{MF_{\\mathrm{x}}}\\right)$ , and carbonyls  $(\\mathbf{M}(\\mathbf{CO})_{\\mathrm{x}})$ , where $\\mathbf{M}=$  the metal to be  deposited and x is used to balance the valences in the compound. Other gases, such as  hydrogen  $\\left(\\mathrm{H}_{2}\\right)$ , nitrogen  $(\\mathbf{N}_{2})$ , methane  $\\mathrm{(CH_{4})}$ , carbon dioxide  $(\\mathrm{CO}_{2})$ , and ammonia  $\\left(\\mathrm{NH}_{3}\\right)$  are used in some of the reactions. Table 27.3 presents some examples of CVD  reactions that result in deposition of a metal or ceramic coating onto a suitable sub- strate. Typical temperatures at which these reactions are carried out are also given. "
    },
    {
        "type": "text",
        "text": "Processing Equipment  Chemical vapor deposition processes are carried out in  a reactor, which consists of (1) reactant supply system, (2) deposition chamber, and  (3) recycle/disposal system. Although reactor conﬁ  gurations differ depending on the  "
    },
    {
        "type": "image",
        "img_path": "images/0ba1c5179b042a91b5c097b89fb857c7b6b72fc4cd79d49e8d402b02aa2f55d4.jpg",
        "img_caption": "FIGURE 27.8  Photomicrograph of  the cross section of a  coated carbide cutting  tool (Kennametal Grade  KC792M); chemical  vapor deposition was  used to coat TiN and  TiCN onto the surface  of a WC–Co substrate,  followed by a TiN  coating applied by  physical vapor  deposition. (Photo  courtesy of Kennametal  Inc.) "
    },
    {
        "type": "text",
        "text": "application, one possible CVD reactor is illustrated in Figure 27.9. The purpose of  the reactant supply system is to deliver reactants to the deposition chamber in the  proper proportions. Different types of supply system are required, depending on  whether the reactants are delivered as gas, liquid, or solid (e.g., pellets, powders). "
    },
    {
        "type": "text",
        "text": "The deposition chamber contains the substrates and chemical reactions that lead  to deposition of reaction products onto the substrate surfaces. Deposition occurs  at elevated temperatures, and the substrate must be heated by induction heating,  radiant heat, or other means. Deposition temperatures for different CVD reactions  "
    },
    {
        "type": "image",
        "img_path": "images/7437a8c9b53c480da9a20fccb28f01e8369ca6d682961e5a7af7ee12c2896dcb.jpg",
        "img_caption": "FIGURE 27.9  A typical  reactor used in chemi- cal vapor deposition. "
    },
    {
        "type": "text",
        "text": "range from 250 to  $1950^{\\circ}\\mathrm{C}$   $(500{-}3500^{\\circ}\\mathrm{F})$ ), so the chamber must be designed to meet  these temperature demands. "
    },
    {
        "type": "text",
        "text": "The third component of the reactor is the recycle/disposal system, whose function  is to render harmless the byproducts of the CVD reaction. This includes collection of  materials that are toxic, corrosive, and/or ﬂ  ammable, followed by proper processing  and disposition. "
    },
    {
        "type": "text",
        "text": "Alternative Forms of CVD  What has been described is  atmospheric pressure  chemical vapor deposition , in which the reactions are carried out at or near  atmospheric pressure. For many reactions, there are advantages in performing the  process at pressures well below atmospheric. This is called  low-pressure chemi- cal vapor deposition  (LPCVD), in which the reactions occur in a partial vacuum.  Advantages of LPCVD include (1) uniform thickness, (2) good control over com- position and structure, (3) low-temperature processing, (4) fast deposition rates,  and (5) high throughput and lower processing costs [13]. The technical problem  in LPCVD is designing the vacuum pumps to create the partial vacuum when the  reaction products are not only hot but may also be corrosive. These pumps must  often include systems to cool and trap the corrosive gases before they reach the  actual pumping unit. "
    },
    {
        "type": "text",
        "text": "Another variation of CVD is  plasma assisted chemical vapor deposition (PACVD), in which deposition onto a substrate is accomplished by reacting the  ingredients in a gas that has been ionized by means of an electric discharge  (i.e., a plasma). In effect, the energy contained in the plasma rather than thermal  energy is used to activate the chemical reactions. Advantages of PACVD include (1)  lower substrate temperatures, (2) better covering power, (3) better adhesion, and (4)  faster deposition rates [6]. Applications include deposition of silicon nitride  $\\mathrm{(Si}_{3}\\mathrm{N}_{4}\\mathrm{)}$   in semiconductor processing, TiN and TiC coatings for tools, and polymer coatings.  The process is also known as plasma-enhanced chemical vapor deposition, plasma  chemical vapor deposition, or just simply plasma deposition. "
    },
    {
        "type": "text",
        "text": "Organic coatings are polymers and resins, produced either naturally or synthetically,  usually formulated to be applied as liquids that dry or harden as thin surface ﬁ  lms on  substrate materials. These coatings are valued for the variety of colors and textures  possible, their capacity to protect the substrate surface, low cost, and ease with which  they can be applied. This section considers the compositions of organic coatings and  the methods to apply them. Although most organic coatings are applied in liquid  form, some are applied as powders, and this alternative is covered in Section 27.6.2. "
    },
    {
        "type": "text",
        "text": "Organic coatings are formulated to contain the following: (1) binders, which give  the coating its properties; (2) dyes or pigments, which lend color to the coating; (3)  solvents, to dissolve the polymers and resins and add proper ﬂ  uidity to the liquid;  and (4) additives. "
    },
    {
        "type": "text",
        "text": "Binders  in organic coatings are polymers and resins that determine the solid-state  properties of the coating, such as strength, physical properties, and adhesion to the  substrate surface. The binder holds the pigments and other ingredients in the coat- ing during and after application to the surface. The most common binders in organic  coatings are natural oils (used to produce oil-based paints), and resins of polyesters,  polyurethanes, epoxies, acrylics, and cellulosics. "
    },
    {
        "type": "text",
        "text": "Dyes and pigments provide color to the coating.  Dyes  are soluble chemicals that  color the coating liquid but do not conceal the surface beneath. Thus, dye-colored  coatings are generally transparent or translucent.  Pigments  are solid particles of uni- form, microscopic size that are dispersed in the coating liquid but insoluble in it.  They not only color the coating; they also hide the surface below. Because pigments  are particulate matter, they also tend to strengthen the coating. "
    },
    {
        "type": "text",
        "text": "Solvents  are used to dissolve the binder and certain other ingredients in the liquid  coating composition. Common solvents used in organic coatings are aliphatic and  aromatic hydrocarbons, alcohols, esters, ketones, and chlorinated solvents. Different  solvents are required for different binders.  Additives  in organic coatings include  surfactants (to facilitate spreading on the surface), biocides and fungicides, thicken- ers, freeze/thaw stabilizers, heat and light stabilizers, coalescing agents, plasticizers,  defoamers, and catalysts to promote cross-linking. These ingredients are formulated  to obtain a wide variety of coatings, such as paints, lacquers, and varnishes. "
    },
    {
        "type": "text",
        "text": "27.6.1  APPLICATION METHODS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The method of applying an organic coating to a surface depends on factors such  as composition of the coating liquid, required thickness of the coating, production  rate and cost considerations, part size, and environmental requirements. For any of  the application methods, it is of utmost importance that the surface be properly  prepared. This includes cleaning and possible treatment of the surface such as phos- phate coating. In some cases, metallic surfaces are plated prior to organic coating for  maximum corrosion protection. "
    },
    {
        "type": "text",
        "text": "With any coating method, transfer efﬁ  ciency is a critical measure.  Transfer  efﬁ  ciency  is the proportion of paint supplied to the process that is actually depos- ited onto the work surface. Some methods yield as low as a $30\\%$  transfer efﬁ  ciency  (meaning that $70\\%$  of the paint is wasted and cannot be recovered). "
    },
    {
        "type": "text",
        "text": "Available methods of applying liquid organic coatings include brushing and roll- ing, spray coating, immersion, and ﬂ  ow coating. In some cases, several successive  coatings are applied to the substrate surface to achieve the desired result. An auto- mobile car body is an important example; the following is a typical sequence applied  to the sheet-metal car body in a mass-production automobile: (1) phosphate coat  applied by dipping, (2) primer coat applied by dipping, (3) color paint coat applied  by spray coating, and (4) clear coat (for high gloss and added protection) applied by  spraying. "
    },
    {
        "type": "text",
        "text": "Brushing  and  rolling  are the two most familiar application methods to most peo- ple. They have a high transfer efﬁ  ciency—approaching $100\\%$ . Manual brushing and  rolling methods are suited to low production but not mass production. While brush- ing is quite versatile, rolling is limited to ﬂ  at surfaces. "
    },
    {
        "type": "text",
        "text": "Spray coating  is a widely used production method for applying organic coatings.  The process forces the coating liquid to atomize into a ﬁ  ne mist immediately prior  to deposition onto the part surface. When the droplets hit the surface, they spread  and ﬂ  ow together to form a uniform coating within the localized region of the spray.  If done properly, spray coating provides a uniform coating over the entire work  surface. "
    },
    {
        "type": "text",
        "text": "Spray coating can be performed manually in spray painting booths, or it can be  set up as an automated process. Transfer efﬁ  ciency is relatively low (as low as  $30\\%$ )  with these methods. Efﬁ  ciency can be improved by  electrostatic spraying , in which  the work part is grounded electrically and the atomized droplets are electrostatic ally  charged. This causes the droplets to be drawn to the part surfaces, increasing transfer  efﬁ  ciencies to values up to $90\\%$  [17]. Spraying is utilized extensively in the automo- tive industry for applying external paint coats to car bodies. It is also used for coating  appliances and other consumer products. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Immersion  applies large amounts of liquid coating to the work part and allows  the excess to drain off and be recycled. The simplest method is  dip coating , in which  a part is immersed in an open tank of liquid coating material; when the part is with- drawn, the excess liquid drains back into the tank. A variation of dip coating is  elec- trocoating , in which the part is electrically charged and then dipped into a paint bath  that has been given an opposite charge. This improves adhesion and permits use of  water-based paints (which reduce ﬁ  re and pollution hazards). "
    },
    {
        "type": "text",
        "text": "In  ﬂ  ow coating , work parts are moved through an enclosed paint booth, where  a series of nozzles shower the coating liquid onto the part surfaces. Excess liquid  drains back into a sump, which allows it to be reused. "
    },
    {
        "type": "text",
        "text": "Once applied, the organic coating must convert from liquid to solid. The term  drying  is often used to describe this conversion process. Many organic coatings dry  by evaporation of their solvents. However, in order to form a durable ﬁ  lm on the  substrate surface, a further conversion is necessary, called curing.  Curing  involves a  chemical change in the organic resin in which polymerization or cross-linking occurs  to harden the coating. "
    },
    {
        "type": "text",
        "text": "The type of resin determines the type of chemical reaction that takes place in  curing. The principal methods by which curing is effected in organic coatings are  [17] (1)  ambient temperature curing , which involves evaporation of the solvent and  oxidation of the resin (most lacquers cure by this method); (2)  elevated temperature  curing , in which elevated temperatures are used to accelerate solvent evaporation,  as well as polymerization and cross-linking of the resin; (3)  catalytic curing , in which  the starting resins require reactive agents mixed immediately prior to application to  bring about polymerization and cross-linking (epoxy and polyurethane paints are  examples); and (4)  radiation curing , in which various forms of radiation, such as  microwaves, ultraviolet light, and electron beams, are required to cure the resin. "
    },
    {
        "type": "text",
        "text": "27.6.2  POWDER COATING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The organic coatings discussed above are liquid systems consisting of resins that  are soluble (or at least miscible) in a suitable solvent. Powder coatings are differ- ent. They are applied as dry, ﬁ  nely pulverized, solid particles that are melted on the  surface to form a uniform liquid ﬁ  lm, after which they resolidify into a dry coating.  Powder coating systems have grown signiﬁ  cantly in commercial importance among  organic coatings since the mid-1970s. "
    },
    {
        "type": "text",
        "text": "Powder coatings are classiﬁ  ed as thermoplastic or thermosetting. Common ther- moplastic powders include polyvinyl chloride, nylon, polyester, polyethylene, and  polypropylene. They are generally applied as relatively thick coatings,  $0.08–0.30\\,\\mathrm{mm}$ (0.003–0.012 in). Common thermosetting coating powders are epoxy, polyester, and  acrylic. They are applied as uncured resins that polymerize and cross-link on heat- ing or reaction with other ingredients. Coating thicknesses are typically 0.025 to  $0.075\\;\\mathrm{mm}$  (0.001–0.003 in). "
    },
    {
        "type": "text",
        "text": "There are two principal application methods for powder coatings: spraying and  ﬂ  uidized bed. In the  spraying  method, an electrostatic charge is given to each particle  in order to attract it to an electrically grounded part surface. Several spray gun designs  are available to impart the charge to the powders. The spray guns can be operated  manually or by industrial robots. Compressed air is used to propel the powders to the  nozzle. The powders are dry when sprayed, and any excess particles that do not attach  to the surface can be recycled (unless multiple paint colors are mixed in the same  spray booth). Powders can be sprayed onto a part at room temperature, followed  by heating of the part to melt the powders; or they can be sprayed onto a part that  has been heated to above the melting point of the powder, which usually provides a  thicker coating. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "The  ﬂ  uidized bed  is a less commonly used alternative to electrostatic spraying. In  this method, the work part to be coated is preheated and passed through a ﬂ  uidized  bed, in which powders are suspended (ﬂ  uidized) by an airstream. The powders at- tach themselves to the part surface to form the coating. In some implementations of  this coating method, the powders are electrostatic ally charged to increase attraction  to the grounded part surface. "
    },
    {
        "type": "text",
        "text": "Porcelain Enameling and Other  Ceramic Coatings ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Porcelain is a ceramic made from kaolin, feldspar, and quartz (Section 7.2.1). It can be  applied to substrate metals such as steel, cast iron, and aluminum as a vitreous porce- lain enamel. Porcelain coatings are valued for their beauty, color, smoothness, ease of  cleaning, chemical inertness, and general durability.  Porcelain enameling  is the name  given to the technology of these ceramic coating materials and the processes by which  they are applied. "
    },
    {
        "type": "text",
        "text": "Porcelain enameling is used in a wide variety of products, including bathroom  ﬁ  xtures (e.g., sinks, bathtubs, lavatories), household appliances (e.g., ranges, water  heaters, washing machines, dishwashers), kitchen ware, hospital utensils, jet engine  components, automotive mufﬂ  ers, and electronic circuit boards. Compositions of the  porcelains vary, depending on product requirements. Some porcelains are formu- lated for color and beauty, while others are designed for functions such as resistance  to chemicals and weather, ability to withstand high service temperatures, hardness  and abrasion resistance, and electrical resistance. "
    },
    {
        "type": "text",
        "text": "As a process, porcelain enameling consists of (1) preparing the coating material,  (2) applying to the surface, (3) drying, if needed, and (4) ﬁ  ring. Preparation involves  converting the glassy porcelain into ﬁ  ne particles, called  frit , that are milled to proper  and consistent size. The methods for applying the frit are similar to methods used for  applying organic coatings, even though the starting material is entirely different. Some  application methods involve mixing frit with water as a carrier (the mixture is called a  slip ), while other methods apply the porcelain as dry powder. The techniques   include  spraying, electrostatic spraying, ﬂ  ow coating, dipping, and electrode position. Firing is  accomplished at temperatures around  $800^{\\circ}\\mathrm{C}$   $(1500^{\\circ}\\mathrm{F})$ . Firing is a  sintering  process  (Section 16.1.4) in which the frit is transformed into nonporous vitreous porcelain.  Typical coating thickness ranges from 0.075 to $2\\:\\mathrm{mm}$  (0.003–0.08 in). The processing  sequence may be repeated several times to obtain the desired thickness. "
    },
    {
        "type": "text",
        "text": "In addition to porcelain, other ceramics are used as coatings for special purposes.  These coatings usually contain a high content of alumina, which makes them more  suited to refractory applications. Techniques for applying the coatings are similar to  the preceding, except ﬁ  ring temperatures are higher. "
    },
    {
        "type": "text",
        "text": " Thermal and Mechanical Coating Processes ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "These processes apply discrete coatings that are generally thicker than coatings  deposited by other processes considered in this chapter. They are based on either  thermal or mechanical energy. "
    },
    {
        "type": "text",
        "text": "27.8.1  THERMAL SURFACING PROCESSES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "These methods use thermal energy in various forms to apply a coating whose func- tion is to provide resistance to corrosion, erosion, wear, and high temperature oxida- tion. The processes include (1) thermal spraying, (2) hard facing, and (3) the ﬂ  exible  overlay process. "
    },
    {
        "type": "text",
        "text": "In  thermal spraying , molten and semimolten coating materials are sprayed onto  a substrate, where they solidify and adhere to the surface. A wide variety of coating  materials can be applied; the categories are pure metals and metal alloys; ceramics  (oxides, carbides, and certain glasses); other metallic compounds (sulﬁ  des, silicides);  cermet composites; and certain plastics (epoxy, nylon, Teﬂ  on, and others). The sub- strates include metals, ceramics, glass, some plastics, wood, and paper. Not all coat- ings can be applied to all substrates. When the process is used to apply a metallic  coating, the terms  metallizing  or  metal spraying  are used. "
    },
    {
        "type": "text",
        "text": "Technologies used to heat the coating material are oxyfuel ﬂ  ame, electric arc, and  plasma arc. The starting coating material is in the form of wire or rod, or powders.  When wire (or rod) is used, the heating source melts the leading end of the wire,  thereby separating it from the solid stock. The molten material is then atomized by  a high-velocity gas stream (compressed air or other source), and the droplets are  spattered against the work surface. When powder stock is used, a powder feeder  dispenses the ﬁ  ne particles into a gas stream, which transports them into the ﬂ  ame,  where they are melted. The expanding gases in the ﬂ  ame propel the molten (or  semimolten) powders against the workpiece. Coating thickness in thermal spraying  is generally greater than in other deposition processes; the typical range is 0.05 to  $2.5\\,\\mathrm{mm}$  (0.002–0.100 in). "
    },
    {
        "type": "text",
        "text": "The ﬁ  rst applications of thermal spray coating were to rebuild worn areas on used  machinery components and to salvage work parts that had been machined undersize.  Success of the technique has led to its use in manufacturing as a coating process for  corrosion resistance, high temperature protection, wear resistance, electrical conduc- tivity, electrical resistance, electromagnetic interference shielding, and other functions. "
    },
    {
        "type": "text",
        "text": "Hard facing  is a surfacing technique in which alloys are applied as welded depos- its to substrate metals. What distinguishes hard facing is that fusion occurs between  the coating and the substrate, as in fusion welding (Section 28.1.1), whereas the bond  in thermal spraying is typically mechanical interlocking that does not stand up as  well to abrasive wear. Thus, hard facing is especially suited to components requiring  good wear resistance. Applications include coating new parts and repairing used  part surfaces that are heavily worn, eroded, or corroded. An advantage of hard fac- ing that should be mentioned is that it is readily accomplished outside of the rela- tively controlled factory environment by many of the common welding processes,  such as oxyacetylene gas welding and arc welding. Some of the common surfacing  materials include steel and iron alloys, cobalt-based alloys, and nickel-based alloys.  Coating thickness is usually 0.75 to $2.5\\,\\mathrm{mm}$  (0.030–0.125 in), although thicknesses as  great as $9\\:\\mathrm{mm}$  (3/8 in) are possible. "
    },
    {
        "type": "text",
        "text": "The  ﬂ  exible overlay process  is capable of depositing a very hard coating mate- rial, such as tungsten carbide (WC), onto a substrate surface. This is an important  advantage of the process compared to other methods, permitting coating hardness  up to about 70 Rockwell C. The process can also be used to apply coatings only to  selected regions of a work part. In the ﬂ  exible overlay process ,  a cloth impregnated  with hard ceramic or metal powders and another cloth impregnated with brazing  alloy are laid onto a substrate and heated to fuse the powders to the surface. Thick- ness of overlay coatings is usually 0.25 to  $2.5~\\mathrm{mm}$  (0.010–0.100 in). In addition to  coatings of WC and WC–Co, cobalt-based and nickel-based alloys are also applied.  Applications include chain saw teeth, rock drill bits, oil drill collars, extrusion dies,  and similar parts requiring good wear resistance. "
    },
    {
        "type": "text",
        "text": "27.8.2 MECHANICAL PLATING",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "In this coating process, mechanical energy is used to build a metallic coating onto  the surface. In mechanical plating ,  the parts to be coated, together with plating metal  powders, glass beads, and special chemicals to promote the plating action, are tum- bled in a barrel. The metallic powders are microscopic in size— $\\cdot5\\ \\mu\\mathrm{m}$  (0.0002 in) in  diameter; while the glass beads are much larger $-2.5\\;\\mathrm{mm}$  (0.10 in) in diameter. As  the mixture is tumbled, the mechanical energy from the rotating barrel is transmitted  through the glass beads to pound the metal powders against the part surface, causing  a mechanical or metallurgical bond to result. The deposited metals must be malleable  in order to achieve a satisfactory bond with the substrate. Plating metals include zinc,  cadmium, tin, and lead. The term  mechanical galvanizing  is used for parts that are  zinc coated. Ferrous metals are most commonly coated; other metals include brass  and bronze. Typical applications include fasteners such as screws, bolts, nuts, and nails.  Plating thickness in mechanical plating is usually 0.005 to  $0.025\\,\\mathrm{mm}$  (0.0002–0.001 in).  Zinc is mechanically plated to a thickness of around  $0.075\\:\\mathrm{mm}$  (0.003 in). "
    },
    {
        "type": "text",
        "text": "References ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": " [1]  ASM Handbook , Vol. 5,  Surface Engineer- ing , ASM International, Materials Park, Ohio,  1993.\n\n  [2] Budinski, K. G.  Surface Engineering for Wear  Resistance . Prentice Hall, Inc., Englewood  Cliffs, New Jersey, 1988.\n\n  [3] Durney, L. J. (ed.).  The Graham’s Electroplat- ing Engineering Handbook , 4th ed. Chapman  & Hall, London 1996.\n\n  [4] Freeman, N. B. “A New Look at Mass Finish- ing,” Special Report 757,  American Machinist ,   August 1983, pp. 93–104.\n\n  [5] George, J.  Preparation of Thin Films . Marcel  Dekker, Inc., New York, 1992.\n\n  [6] Hocking, M. G., Vasantasree, V., and Sidky,  P. S.  Metallic  and  Ceramic  Coatings .  Addison-Wesley Longman, Reading, Massa- chusetts, 1989.\n\n "
    },
    {
        "type": "text",
        "text": " [7]  Metal Finishing , Guidebook and Directory  Issue. Metals and Plastics Publications, Inc.,  Hackensack, New Jersey, 2000.\n\n  [8] Morosanu, C. E.  Thin Films by Chemical  Vapour Deposition . Elsevier, Amsterdam, The  Netherlands, 1990.\n\n  [9] Murphy, J. A. (ed.).  Surface Preparation and  Finishes for Metals . McGraw-Hill, New York,  1971.\n\n [10] Sabatka, W. “Vapor Degreasing,” Available at  www.pfonline.com .\n\n [11] Satas, D. (ed.).  Coatings Technology Hand- book , 2nd ed. Marcel Dekker, New York,  2000. "
    }
]