[
    {
        "type": "text",
        "text": "Brazing, Soldering,  Brazing, Soldering,  and Adhesive  and Adhesive  Bonding Bonding ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "30 30 ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "This chapter covers three joining processes that are  similar to welding in certain respects: brazing, soldering,  and adhesive bonding. Brazing and soldering both use  ﬁ  ller metals to join and bond two (or more) metal parts  to provide a permanent joint. It is difﬁ  cult, although not  impossible, to disassemble the parts after a brazed or  soldered joint has been made. In the spectrum of join- ing processes, brazing and soldering lie between fusion  welding and solid-state welding. A ﬁ  ller metal is added  in brazing and soldering as in most fusion-welding  operations; however, no melting of the base metals  occurs, which is similar to solid-state welding. Despite  these anomalies, brazing and soldering are generally  considered to be distinct from welding. Brazing and  soldering are attractive compared to welding under cir- cumstances where (1) the metals have poor weldability,  (2) dissimilar metals are to be joined, (3) the intense  heat of welding may damage the components being  joined, (4) the geometry of the joint does not lend itself  to any of the welding methods, and/or (5) high strength  is not a requirement.\n\n "
    },
    {
        "type": "text",
        "text": "Chapter Contents ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "30.1 Brazing ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "30.1.1 Brazed Joints\n\n 30.1.2 Filler Metals and Fluxes\n\n 30.1.3 Brazing Methods\n\n "
    },
    {
        "type": "text",
        "text": "30.2 Soldering ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "30.2.1 Joint Designs in Soldering\n\n 30.2.2 Solders and Fluxes\n\n 30.2.3 Soldering Methods\n\n "
    },
    {
        "type": "text",
        "text": "30.3 Adhesive Bonding ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "30.3.1 Joint Design\n\n 30.3.2 Adhesive Types\n\n 30.3.3   Adhesive Application  Technology Adhesive bonding shares certain features in com- mon with brazing and soldering. It utilizes the forces  of attachment between a ﬁ  ller material and two closely  spaced surfaces to bond the parts. The differences are  that the ﬁ  ller material in adhesive bonding is not metal- lic, and the joining process is carried out at room tem- perature or only modestly above. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": " Brazing ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Brazing is a joining process in which a ﬁ  ller metal is  melted and distributed by capillary action between  the faying surfaces of the metal parts being joined. No  melting of the base metals occurs in brazing; only the  ﬁ  ller melts. In brazing the ﬁ  ller metal (also called the  brazing metal ), has a melting temperature (liquidus) that is above  $450^{\\circ}\\mathrm{C}$ $(840^{\\circ}\\mathrm{F})$   but below the melting point (solidus) of the base metal(s) to be joined. If the joint  is properly designed and the brazing operation has been properly performed, the  brazed joint will be stronger than the ﬁ  ller metal out of which it has been formed  upon solidiﬁ  cation. This rather remarkable result is due to the small part clearances  used in brazing, the metallurgical bonding that occurs between base and ﬁ  ller met- als, and the geometric constrictions that are imposed on the joint by the base parts. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Brazing has several advantages compared to welding: (1) any metals can be  joined, including dissimilar metals; (2) certain brazing methods can be performed  quickly and consistently, thus permitting high cycle rates and automated production;  (3) some methods allow multiple joints to be brazed simultaneously; (4) brazing can  be applied to join thin-walled parts that cannot be welded; (5) in general, less heat  and power are required than in fusion welding; (6) problems with the heat-affected  zone in the base metal near the joint are reduced; and (7) joint areas that are inac- cessible by many welding processes can be brazed, since capillary action draws the  molten ﬁ  ller metal into the joint. "
    },
    {
        "type": "text",
        "text": "Disadvantages and limitations of brazing include (1) joint strength is gener- ally less than that of a welded joint; (2) although strength of a good brazed joint is  greater than that of the ﬁ  ller metal, it is likely to be less than that of the base metals;  (3) high service temperatures may weaken a brazed joint; and (4) the color of the  metal in the brazed joint may not match the color of the base metal parts, a possible  aesthetic disadvantage. "
    },
    {
        "type": "text",
        "text": "Brazing as a production process is widely used in a variety of industries, including  automotive (e.g., joining tubes and pipes), electrical equipment (e.g., joining wires  and cables), cutting tools (e.g., brazing cemented carbide inserts to shanks), and jew- elry making. In addition, the chemical processing industry and plumbing and heating  contractors join metal pipes and tubes by brazing. The process is used extensively for  repair and maintenance work in nearly all industries. "
    },
    {
        "type": "text",
        "text": "30.1.1  BRAZED JOINTS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Brazed joints are commonly of two types: butt and lap (Section 29.2.1). However, the  two types have been adapted for the brazing process in several ways. The conven- tional butt joint provides a limited area for brazing, thus jeopardizing the strength  of the joint. To increase the faying areas in brazed joints, the mating parts are often  scarfed or stepped or otherwise altered, as shown in Figure 30.1. Of course, addi- tional processing is usually required in the making of the parts for these special joints.  "
    },
    {
        "type": "image",
        "img_path": "images/00443c52a71a0562c0bfe5dee1ba81b15c3c06016a70f56f2d669db6ac389ef1.jpg",
        "img_caption": "FIGURE 30.1  (a) Conventional butt  joint, and adaptations  of the butt joint for  brazing: (b) scarf joint,  (c) stepped butt joint,  (d) increased cross  section of the part at  the joint. "
    },
    {
        "type": "image",
        "img_path": "images/9184758732cdd7aa0200b85216514ac9e177f05296773cb6a40bf1082b67c7d8.jpg",
        "img_caption": "FIGURE 30.2  (a) Conventional lap joint, and adaptations of the lap joint for brazing: (b) cylindrical parts, (c) sandwiched  parts, and (d) use of sleeve to convert butt joint into lap joint. "
    },
    {
        "type": "text",
        "text": "One of the particular difﬁ  culties associated with a scarfed joint is the problem of  maintaining the alignment of the parts before and during brazing. "
    },
    {
        "type": "text",
        "text": "Lap joints are more widely used in brazing, since they can provide a relatively large  interface area between the parts. An overlap of at least three times the thickness of  the thinner part is generally considered good design practice. Some adaptations of  the lap joint for brazing are illustrated in Figure 30.2. An advantage of brazing over  welding in lap joints is that the ﬁ  ller metal is bonded to the base parts throughout  the entire interface area between the parts, rather than only at the edges (as in ﬁ  llet  welds made by arc welding) or at discrete spots (as in resistance spot welding). "
    },
    {
        "type": "text",
        "text": "Clearance between mating surfaces of the base parts is important in brazing. The  clearance must be large enough so as not to restrict molten ﬁ  ller metal from ﬂ  owing  throughout the entire interface. Yet if the joint clearance is too great, capillary action  will be reduced and there will be areas between the parts where no ﬁ  ller metal is  present. Joint strength is affected by clearance, as depicted in Figure 30.3. There is an  "
    },
    {
        "type": "image",
        "img_path": "images/ee3c550f55bdc7e3f663c2ad69b05a85fa9953e5bc03e07e80d11559aa70cc2f.jpg",
        "img_caption": "FIGURE 30.3  Joint strength  as a function of joint clearance. "
    },
    {
        "type": "text",
        "text": "optimum clearance value at which joint strength is maximized. The issue is compli- cated by the fact that the optimum depends on base and ﬁ  ller metals, joint conﬁ  gu- ration, and processing conditions. Typical brazing clearances in practice are 0.025 to  $0.25~\\mathrm{mm}$  (0.001–0.010 in). These values represent the joint clearance at the brazing  temperature, which may be different from room temperature clearance, depending  on thermal expansion of the base metal(s). "
    },
    {
        "type": "text",
        "text": "Cleanliness of the joint surfaces prior to brazing is also important. Surfaces  must be free of oxides, oils, and other contaminants in order to promote wetting  and capillary attraction during the process, as well as bonding across the entire  interface. Chemical treatments such as solvent cleaning (Section 28.1.1) and  mechanical treatments such as wire brushing and sand blasting (Section 28.1.2)  are used to clean the surfaces. After cleaning and during the brazing operation,  ﬂ  uxes are used to maintain surface cleanliness and promote wetting for capillary  action in the clearance between faying surfaces. "
    },
    {
        "type": "text",
        "text": "30.1.2  FILLER METALS AND FLUXES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Common ﬁ  ller metals used in brazing are listed in Table 30.1 along with the principal  base metals on which they are typically used. To qualify as a brazing metal, the fol- lowing characteristics are needed: (1) melting temperature must be compatible with  the base metal, (2) surface tension in the liquid phase must be low for good wettabil- ity, (3) ﬂ  uidity of the molten metal must be high for penetration into the interface,  (4) the metal must be capable of being brazed into a joint of adequate strength for  the application, and (5) chemical and physical interactions with base metal (e.g., gal- vanic reaction) must be avoided. Filler metals are applied to the brazing operation in  various ways, including wire, rod, sheets and strips, powders, pastes, preformed parts  made of braze metal designed to ﬁ  t a particular joint conﬁ  guration, and cladding  on one of the surfaces to be brazed. Several of these techniques are illustrated in  Figures 30.4 and 30.5. Braze metal pastes, shown in Figure 30.5, consist of ﬁ  ller metal  powders mixed with ﬂ  uid ﬂ  uxes and binders. "
    },
    {
        "type": "text",
        "text": "Brazing ﬂ  uxes serve a similar purpose as in welding; they dissolve, combine with,  and otherwise inhibit the formation of oxides and other unwanted byproducts in the  "
    },
    {
        "type": "table",
        "img_path": "images/f1a7f3a40f273dbbc01e46cae3c1c4bff395ad894a893d25bb8ab31fc688ba36.jpg",
        "table_caption": "TABLE  •  30.1  Common ﬁ  ller metals used in brazing and the base metals on which they are used. "
    },
    {
        "type": "image",
        "img_path": "images/e5aa79445a139932428de3be177d3d1a831baa434226423263838d953b771b69.jpg",
        "img_caption": "FIGURE 30.4  Several  techniques for applying  ﬁ  ller metal in brazing:  (a) torch and ﬁ  ller rod;  (b) ring of ﬁ  ller metal at  entrance of gap; and  (c) foil of ﬁ  ller metal  between ﬂ  at part  surfaces. Sequence:  (1) before, and (2) after. "
    },
    {
        "type": "text",
        "text": "brazing process. Use of a ﬂ  ux does not substitute for the cleaning steps described above.  Characteristics of a good ﬂ  ux include (1) low melting temperature, (2) low viscosity so  that it can be displaced by the ﬁ  ller metal, (3) facilitates wetting, and (4) protects the  joint until solidiﬁ  cation of the ﬁ  ller metal. The ﬂ  ux should also be easy to remove after  brazing. Common ingredients for brazing ﬂ  uxes include borax, borates, ﬂ  uorides, and  chlorides. Wetting agents are also included in the mix to reduce surface tension of the  molten ﬁ  ller metal and to improve wettability. Forms of ﬂ  ux include powders, pastes,  and slurries. Alternatives to using a ﬂ  ux are to perform the operation in a vacuum or a  reducing atmosphere that inhibits oxide formation. "
    },
    {
        "type": "text",
        "text": "30.1.3  BRAZING METHODS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "There are various methods used in brazing. Referred to as brazing processes, they  are differentiated by their heating sources. "
    },
    {
        "type": "text",
        "text": "Torch Brazing  In torch brazing, ﬂ  ux is applied to the part surfaces and a torch  is used to direct a ﬂ  ame against the work in the vicinity of the joint. A reducing  ﬂ  ame is typically used to inhibit oxidation. After the work part joint areas have  "
    },
    {
        "type": "image",
        "img_path": "images/831bd85550bb70dad42cc3d5a34b4465fd0fe574275cae24a772968022c3a58a.jpg",
        "img_caption": "FIGURE 30.5  Application of brazing paste to joint by dispenser. (Courtesy of Fusion, Inc.) "
    },
    {
        "type": "text",
        "text": "been heated to a suitable temperature, ﬁ  ller wire is added to the joint, usually  in wire or rod form. Fuels used in torch brazing include acetylene, propane, and  other gases, with air or oxygen. The selection of the mixture depends on heating  requirements of the job. Torch brazing is often performed manually, and skilled  workers must be employed to control the ﬂ  ame, manipulate the hand-held torches,  and properly judge the temperatures; repair work is a common application. The  method can also be used in mechanized production operations, in which parts and  brazing metal are loaded onto a conveyor or indexing table and passed under one  or more torches. "
    },
    {
        "type": "text",
        "text": "Furnace Brazing   Furnace brazing uses a furnace to supply heat for brazing and  is best suited to medium and high production. In medium production, usually in  batches, the component parts and brazing metal are loaded into the furnace, heated  to brazing temperature, and then cooled and removed. High-production operations  use ﬂ  ow-through furnaces, in which parts are placed on a conveyor and are trans- ported through the various heating and cooling sections. Temperature and atmos- phere control are important in furnace brazing; the atmosphere must be neutral or  reducing. Vacuum furnaces are sometimes used. Depending on the atmosphere and  metals being brazed, the need for a ﬂ  ux may be eliminated. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Induction Brazing   Induction brazing utilizes heat from electrical resistance to  a high-frequency current induced in the work. The parts are preloaded with ﬁ  ller  metal and placed in a high-frequency AC ﬁ  eld—the parts do not directly contact  the induction coil. Frequencies range from $5\\:\\mathrm{kHz}$  to 5 MHz. High-frequency power  sources tend to provide surface heating, while lower frequencies cause deeper heat  penetration into the work and are appropriate for heavier sections. The process can  be used to meet low- to high-production requirements. "
    },
    {
        "type": "text",
        "text": "Resistance Brazing   Heat to melt the ﬁ  ller metal in this process is obtained by  resistance to ﬂ  ow of electrical current through the parts. As distinguished from  induction brazing, the parts are directly connected to the electrical circuit in resist- ance brazing. The equipment is similar to that used in resistance welding, except  that a lower power level is required for brazing. The parts with ﬁ  ller metal pre- placed are held between electrodes while pressure and current are applied. Both  induction and resistance brazing achieve rapid heating cycles and are used for  relatively small parts. Induction brazing seems to be the more widely used of the  two processes. "
    },
    {
        "type": "text",
        "text": "Dip Brazing   In dip brazing, either a molten salt bath or a molten metal bath  accomplishes heating. In both methods, assembled parts are immersed in the baths  contained in a heating pot. Solidiﬁ  cation occurs when the parts are removed from  the bath. In the  salt bath method , the molten mixture contains ﬂ  uxing ingredients  and the ﬁ  ller metal is preloaded onto the assembly. In the  metal bath method , the  molten ﬁ  ller metal is the heating medium; it is drawn by capillary action into the  joint during submersion. A ﬂ  ux cover is maintained on the surface of the molten  metal bath. Dip brazing achieves fast heating cycles and can be used to braze many  joints on a single part or on multiple parts simultaneously. "
    },
    {
        "type": "text",
        "text": "Infrared Brazing   This method uses heat from a high-intensity infrared lamp. Some  IR lamps are capable of generating up to  $5000\\,\\mathrm{W}$  of radiant heat energy, which can  be directed at the work parts for brazing. The process is slower than most of the  other processes reviewed above, and is generally limited to thin sections. "
    },
    {
        "type": "text",
        "text": "Braze Welding   This process differs from the other brazing processes in the type  of joint to which it is applied. As pictured in Figure 30.6, braze welding is used for  ﬁ  lling a more conventional weld joint, such as the V-joint shown. A greater quantity  of ﬁ  ller metal is deposited than in brazing, and no capillary action occurs. In braze  welding, the joint consists entirely of ﬁ  ller metal; the base metal does not melt and  is therefore not fused into the joint as in a conventional fusion welding process. The  principal application of braze welding is repair work. "
    },
    {
        "type": "image",
        "img_path": "images/29056bfa045a19893c48ed239d9e277a4ea57c3cb0c85031688d8679b234e858.jpg",
        "img_caption": "FIGURE 30.6  Braze welding. The joint consists  of braze (ﬁ  ller) metal; no base metal is fused in  the joint. "
    },
    {
        "type": "text",
        "text": " Soldering ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Soldering is similar to brazing and can be deﬁ  ned as a joining process in which a ﬁ  ller  metal with melting point (liquidus) not exceeding $450^{\\circ}\\mathrm{C}$   $(840^{\\circ}\\mathrm{F})$  is melted and distrib- uted by capillary action between the faying surfaces of the metal parts being joined. As  in brazing, no melting of the base metals occurs, but the ﬁ  ller metal wets and combines  with the base metal to form a metallurgical bond. Details of soldering are similar to  those of brazing, and many of the heating methods are the same. Surfaces to be sol- dered must be precleaned so they are free of oxides, oils, and so on. An appropriate ﬂ  ux  must be applied to the faying surfaces, and the surfaces are heated. Filler metal, called  solder , is added to the joint, which distributes itself between the closely ﬁ  tting parts. "
    },
    {
        "type": "text",
        "text": "In some applications, the solder is precoated onto one or both of the surfaces—a  process called  tinning , irrespective of whether the solder contains any tin. Typical  clearances in soldering range from 0.075 to  $0.125\\;\\mathrm{mm}$  (0.003–0.005 in), except when  the surfaces are tinned, in which case a clearance of about  $0.025~\\mathrm{mm}$ (0.001 in) is  used. After solidiﬁ  cation, the ﬂ  ux residue must be removed. "
    },
    {
        "type": "text",
        "text": "As an industrial process, soldering is most closely associated with electron- ics assembly (Chapter 34). It is also used for mechanical joints, but not for joints  subjected to elevated stresses or temperatures. Advantages attributed to soldering  include (1) low energy input relative to brazing and fusion welding, (2) variety of  heating methods available, (3) good electrical and thermal conductivity in the joint,  (4) capability to make air-tight and liquid-tight seams for containers, and (5) easy to  repair and rework. "
    },
    {
        "type": "text",
        "text": "The biggest disadvantages of soldering are (1) low joint strength unless reinforced  by mechanical means and (2) possible weakening or melting of the joint in elevated  temperature service. "
    },
    {
        "type": "text",
        "text": "30.2.1  JOINT DESIGNS IN SOLDERING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "As in brazing, soldered joints are limited to lap and butt types, although butt joints  should not be used in load-bearing applications. Some of the brazing adaptations of  these joints also apply to soldering, and soldering technology has added a few more  variations of its own to deal with the special part geometries that occur in electri- cal connections. In soldered mechanical joints of sheet-metal parts, the edges of the  sheets are often bent over and interlocked before soldering, as shown in Figure 30.7,  to increase joint strength. "
    },
    {
        "type": "text",
        "text": "For electronics applications, the principal function of the soldered joint is to provide  an electrically conductive path between two parts being joined. Other design consid- erations in these types of soldered joints include heat generation (from the electrical  resistance of the joint) and vibration. Mechanical strength in a soldered electrical con- nection is often achieved by deforming one or both of the metal parts to accomplish  a mechanical joint between them, or by making the surface area larger to provide  maximum support by the solder. Several possibilities are sketched in Figure 30.8. "
    },
    {
        "type": "text",
        "text": "30.2.2  SOLDERS AND FLUXES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Solders and ﬂ  uxes are the materials used in soldering. Both are critically important  in the joining process. "
    },
    {
        "type": "image",
        "img_path": "images/db0fc016793fd250d354e55f28c0ff755a7562ddb01d784f7ce84dafc8471cff.jpg",
        "img_caption": "FIGURE 30.7  Mechanical interlock- ing in soldered joints for  increased strength:  (a) ﬂ  at lock seam;  (b) bolted or riveted  joint; (c) copper pipe  ﬁ  ttings—lap cylindrical  joint; and (d) crimping  (forming) of cylindrical  lap joint. "
    },
    {
        "type": "text",
        "text": "Solders  Most solders are alloys of tin and lead, since both metals have low melting  points (see Figure 6.3). Their alloys possess a range of liquidus and solidus tempera- tures to achieve good control of the soldering process for a variety of applications.  Lead is poisonous and its percentage is minimized in most solder compositions.  Tin is chemically active at soldering temperatures and promotes the wetting action  required for successful joining. In soldering copper, common in electrical connec- tions, intermetallic compounds of copper and tin are formed that strengthen the  bond. Silver and antimony are also sometimes used in soldering alloys. Table 30.2  lists various solder alloy compositions, indicating their approximate soldering tem- peratures and principal applications. Lead-free solders are becoming increasingly  important as legislation to eliminate lead from solders is enacted. "
    },
    {
        "type": "text",
        "text": "Soldering Fluxes   Soldering ﬂ  uxes should do the following: (1) be molten at sol- dering temperatures, (2) remove oxide ﬁ  lms and tarnish from the base part surfaces,  (3) prevent oxidation during heating, (4) promote wetting of the faying surfaces,  "
    },
    {
        "type": "image",
        "img_path": "images/c4b8d9f513e61a5ae1fc9bd5922cbea11850247f3f566ccdaab752f409e6d738.jpg",
        "img_caption": "FIGURE 30.8  Tech- niques for securing the  joint by mechanical  means prior to soldering  in electrical connections:  (a) crimped lead wire  on printed circuit board  (PCB); (b) plated through  hole on PCB to maximize  solder contact surface;  (c) hooked wire on ﬂ  at  terminal; and (d) twisted  wires. "
    },
    {
        "type": "table",
        "img_path": "images/5cd403b78ee826e7535ad8625f971bb15af52b4a4600c98c63078a3ada1cc3cb.jpg",
        "table_caption": "TABLE  •  30.2  Some common solder alloy compositions with their melting temperatures and applications. ",
        "table_footnote": "Compiled from [2], [3], [4], and [13]. Eutectic composition—lowest melting point of tin–lead compositions. "
    },
    {
        "type": "text",
        "text": "(5) be readily displaced by the molten solder during the process, and (6) leave a resi- due that is noncorrosive and nonconductive. Unfortunately, there is no single ﬂ  ux  that serves all of these functions perfectly for all combinations of solder and base  metals. The ﬂ  ux formulation must be selected for a given application. "
    },
    {
        "type": "text",
        "text": "Soldering ﬂ  uxes can be classiﬁ  ed as organic or inorganic.  Organic ﬂ  uxes  are made  of either rosin (i.e., natural rosin such as gum wood, which is not water-soluble) or  water-soluble ingredients (e.g., alcohols, organic acids, and halogenated salts). The  water-soluble type facilitates cleanup after soldering. Organic ﬂ  uxes are most com- monly used for electrical and electronics connections. They tend to be chemically  reactive at elevated soldering temperatures but relatively noncorrosive at room  temperatures.  Inorganic ﬂ  uxes  consist of inorganic acids (e.g., muriatic acid) and  salts (e.g., combinations of zinc and ammonium chlorides) and are used to achieve  rapid and active ﬂ  uxing where oxide ﬁ  lms are a problem. The salts become active  when melted, but are less corrosive than the acids. When solder wire is purchased  with an  acid core  it is in this category. "
    },
    {
        "type": "text",
        "text": "Both organic and inorganic ﬂ  uxes should be removed after soldering, but it is  especially important in the case of inorganic acids to prevent continued corrosion  of the metal surfaces. Flux removal is usually accomplished using water solutions  except in the case of rosins, which require chemical solvents. Recent trends in indus- try favor water-soluble ﬂ  uxes over rosins because chemical solvents used with rosins  are harmful to the environment and to humans. "
    },
    {
        "type": "text",
        "text": "30.2.3  SOLDERING METHODS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Many of the methods used in soldering are the same as those used in brazing, except  that less heat and lower temperatures are required for soldering. These methods  include torch soldering, furnace soldering, induction soldering, resistance soldering,  dip soldering, and infrared soldering. There are other soldering methods, not used  in brazing, that should be described here. These methods are hand soldering, wave  soldering, and reﬂ  ow soldering. "
    },
    {
        "type": "text",
        "text": "Hand Soldering   Hand soldering is performed manually using a hot soldering  iron. A  bit , made of copper, is the working end of a soldering iron. Its functions are  (1) to deliver heat to the parts being soldered, (2) to melt the solder, (3) to convey  molten solder to the joint, and (4) to withdraw excess solder. Most modern soldering  irons are heated by electrical resistance. Some are designed as fast-heating  soldering  guns , which are popular in electronics assembly for intermittent (on-off) operation  actuated by a trigger. They are capable of making a solder joint in about a second. "
    },
    {
        "type": "text",
        "text": "Wave Soldering   Wave soldering is a mechanized technique that allows multiple  lead wires to be soldered to a printed circuit board (PCB) as it passes over a wave  of molten solder. The typical setup is one in which a PCB, on which electronic com- ponents have been placed with their lead wires extending through the holes in the  board, is loaded onto a conveyor for transport through the wave-soldering equip- ment. The conveyor supports the PCB on its sides, so that its underside is exposed  to the processing steps, which consist of the following: (1) ﬂ  ux is applied using any  of several methods, including foaming, spraying, or brushing; (2) preheating (using  light bulbs, heating coils, and infrared devices) to evaporate solvents, activate the  ﬂ  ux, and raise the temperature of the assembly; and (3) wave soldering, in which  the liquid solder is pumped from a molten bath through a slit onto the bottom of  the board to make the soldering connections between the lead wires and the metal  circuit on the board. This third step is illustrated in Figure 30.9. The board is often  inclined slightly, as depicted in the sketch, and a special tinning oil is mixed with the  molten solder to lower its surface tension. Both of these measures help to inhibit  buildup of excess solder and formation of “icicles” on the bottom of the board.  Wave soldering is widely applied in electronics to produce printed circuit board  assemblies (Section 35.3.2). "
    },
    {
        "type": "text",
        "text": "Reﬂ  ow Soldering   This process is also widely used in electronics to assemble sur- face mount components to printed circuit boards (Section 35.4.2). In the process, a  solder paste consisting of solder powders in a ﬂ  ux binder is applied to spots on the  board where electrical contacts are to be made between surface mount components  and the copper circuit. The components are then placed on the paste spots, and the  board is heated to melt the solder, forming mechanical and electrical bonds between  the component leads and the copper on the circuit board. "
    },
    {
        "type": "text",
        "text": "Heating methods for reﬂ  ow soldering include vapor phase reﬂ  ow and infrared  reﬂ  ow. In  vapor phase reﬂ  ow soldering , an inert ﬂ  uorinated hydrocarbon liquid is  vaporized by heating in an oven; it subsequently condenses on the board surface  "
    },
    {
        "type": "image",
        "img_path": "images/92a8ca0d79889bab1ffe9fd78a998bc1f803230cde318684c33522feae94264b.jpg",
        "img_caption": "FIGURE 30.9  Wave soldering, in  which molten solder is delivered  up through a narrow slot onto the  underside of a printed circuit board to  connect the component lead wires. "
    },
    {
        "type": "text",
        "text": "where it transfers its heat of vaporization to melt the solder paste and form sol- der joints on the printed circuit boards. In  infrared reﬂ  ow soldering , heat from an  infrared lamp is used to melt the solder paste and form joints between component  leads and circuit areas on the board. Additional heating methods to reﬂ  ow the solder  paste include use of hot plates, hot air, and lasers. "
    },
    {
        "type": "text",
        "text": " Adhesive Bonding ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Use of adhesives dates back to ancient times (Historical Note 30.1) and adhesive  bonding was probably the ﬁ  rst of the permanent joining methods. Today, adhesives  are used in a wide range of bonding and sealing applications for joining similar and  dissimilar materials such as metals, plastics, ceramics, wood, paper, and cardboard.  Although well-established as a joining technique, adhesive bonding is considered a  growth area among assembly technologies because of the tremendous opportunities  for increased applications. "
    },
    {
        "type": "text",
        "text": "Historical Note 30.1  Adhesive bonding ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Adhesives date from ancient times. Carvings 3300  years old show a glue pot and brush for gluing veneer  to wood planks. The ancient Egyptians used gum from  the Acacia tree for various assembly and sealing pur- poses. Bitumen, an asphalt adhesive, was used in an- cient times as a cement and mortar for construction  in Asia Minor. The Romans used pine wood tar and  beeswax to caulk their ships. Glues derived from ﬁ  sh,  stag horns, and cheese were used in the early centu- ries after Christ for assembling components of wood. In more modern times, adhesives have become  an important joining process. Plywood, which relies  on the use of adhesives to bond multiple layers of  wood, was developed around 1900. Phenol formal- dehyde was the ﬁ  rst synthetic adhesive developed,  around 1910, and its primary use was in bonding of  wood products such as plywood. During World War II,  phenolic resins were developed for adhesive bonding  of certain aircraft components. In the 1950s, epoxies  were ﬁ  rst formulated. And since the 1950s a variety  of additional adhesives have been developed, includ- ing anaerobics, various new polymers, and second- generation acrylics. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Adhesive bonding  is a joining process in which a ﬁ  ller material is used to hold two  (or more) closely spaced parts together by surface attachment. The ﬁ  ller material  that binds the parts together is the  adhesive . It is a nonmetallic substance—usually  a polymer. The parts being joined are called  adherends . Adhesives of greatest inter- est in engineering are  structural adhesives , which are capable of forming strong,  permanent joints between strong, rigid adherends. A large number of commercially  available adhesives are cured by various mechanisms and suited to the bonding  of various materials.  Curing  refers to the process by which the adhesive’s physical  properties are changed from a liquid to a solid, usually by chemical reaction, to  accomplish the surface attachment of the parts. The chemical reaction may involve  polymerization, condensation, or vulcanization. Curing is often motivated by heat  and/or a catalyst, and pressure is sometimes applied between the two parts to acti- vate the bonding process. If heat is required, the curing temperatures are relatively  low, and so the materials being joined are usually unaffected—an advantage for  adhesive bonding. The curing or hardening of the adhesive takes time, called  curing  time  or  setting time . In some cases this time is signiﬁ  cant—generally a disadvantage  in manufacturing. "
    },
    {
        "type": "text",
        "text": "Joint strength in adhesive bonding is determined by the strength of the adhesive  itself and the strength of attachment between adhesive and each of the adherends.  One of the criteria often used to deﬁ  ne a satisfactory adhesive joint is that if a failure  should occur due to excessive stresses, it occurs in one of the adherends rather than  at an interface or within the adhesive itself. The strength of the attachment results  from several mechanisms, all depending on the particular adhesive and adherends:  (1) chemical bonding, in which the adhesive unites with the adherends and forms a  primary chemical bond upon hardening; (2) physical interactions, in which secondary  bonding forces result between the atoms of the opposing surfaces; and (3) mechani- cal interlocking, in which the surface roughness of the adherend causes the hardened  adhesive to become entangled or trapped in its microscopic surface asperities. "
    },
    {
        "type": "text",
        "text": "For these adhesion mechanisms to operate with best results, the following condi- tions must prevail: (1) surfaces of the adherend must be clean—free of dirt, oil, and  oxide ﬁ  lms that would interfere with achieving intimate contact between adhesive  and adherend; special preparation of the surfaces is often required; (2) the adhesive  in its initial liquid form must achieve thorough wetting of the adherend surface; and  (3) it is usually helpful for the surfaces to be other than perfectly smooth—a slightly  roughened surface increases the effective contact area and promotes mechani- cal interlocking. In addition, the joint must be designed to exploit the particular  strengths of adhesive bonding and avoid its limitations. "
    },
    {
        "type": "text",
        "text": "30.3.1  JOINT DESIGN ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Adhesive joints are not generally as strong as those by welding, brazing, or solder- ing. Accordingly, consideration must be given to the design of joints that are adhe- sively bonded. The following design principles are applicable: (1) Joint contact area  should be maximized. (2) Adhesive joints are strongest in shear and tension as in  Figure 30.10(a) and (b), and joints should be designed so that the applied stresses  are of these types. (3) Adhesive bonded joints are weakest in cleavage or peeling as  in Figure 30.10(c) and (d), and adhesive bonded joints should be designed to avoid  these types of stresses. "
    },
    {
        "type": "text",
        "text": "Typical joint designs for adhesive bonding that illustrate these design principles  are presented in Figure 30.11. Some joint designs combine adhesive bonding with  other joining methods to increase strength and/or provide sealing between the two  components. Some of the possibilities are shown in Figure 30.12. For example, the  combination of adhesive bonding and spot welding is called  weldbonding . "
    },
    {
        "type": "image",
        "img_path": "images/87da55401deee2b0c207b53858e19154e609cd7e60f29bc5d433ec339f6cd7d8.jpg",
        "img_caption": "FIGURE 30.10  Types of stresses that must be considered in adhesive bonded joints: (a) tension, (b) shear, (c) cleavage,  and (d) peeling. "
    },
    {
        "type": "image",
        "img_path": "images/9788393f5c4e9e1eaa0ea03befff42bbb7366c00fcde4516c497d28b1c4e9442.jpg",
        "img_caption": "FIGURE 30.11  Some joint designs for adhesive bonding: (a) through (d) butt joints; (e) and (f) T-joints; and (g) through  (j) corner joints. "
    },
    {
        "type": "image",
        "img_path": "images/9786dbb422a25eb92ac37ae329d75ca2a4136b5d8e55503c8c225c004f03254b.jpg",
        "img_caption": "FIGURE 30.12  Adhesive bonding combined with other joining methods: (a) weldbonding—spot welded and adhesive  bonded; (b) riveted (or bolted) and adhesive bonded; and (c) formed plus adhesive bonded. "
    },
    {
        "type": "text",
        "text": "In addition to the mechanical conﬁ  guration of the joint, the application must be  selected so that the physical and chemical properties of adhesive and adherends are  compatible under the service conditions to which the assembly will be subjected.  Adherend materials include metals, ceramics, glass, plastics, wood, rubber, leather,  cloth, paper, and cardboard. Note that the list includes materials that are rigid and  ﬂ  exible, porous and nonporous, metallic and nonmetallic, and that similar or dissimi- lar substances can be bonded together. "
    },
    {
        "type": "text",
        "text": "30.3.2  ADHESIVE TYPES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A large number of commercial adhesives are available. They can be classiﬁ  ed into  three categories: (1) natural, (2) inorganic, and (3) synthetic. "
    },
    {
        "type": "text",
        "text": "Natural adhesives  are derived from natural sources (e.g., plants and animals),  including gums, starch, dextrin, soy ﬂ  our, and collagen. This category of adhesive is  generally limited to low-stress applications, such as cardboard cartons, furniture, and  bookbinding; or where large surface areas are involved (e.g., plywood).  Inorganic  adhesives  are based principally on sodium silicate and magnesium oxychloride.  Although relatively low in cost, they are also low in strength—a serious limitation in  a structural adhesive. "
    },
    {
        "type": "table",
        "img_path": "images/91287c58062afaeea2f39c89df9b91a6c46d2f8107e6f5402056de3489c60705.jpg",
        "table_caption": "TABLE  •  30.3  Important synthetic adhesives. ",
        "table_footnote": "Compiled from [8], [10], and [14]. "
    },
    {
        "type": "text",
        "text": "Synthetic adhesives  constitute the most important category in manufacturing.  They include a variety of thermoplastic and thermosetting polymers, many of which  are listed and brieﬂ  y described in Table 30.3. They are cured by various mechanisms,  such as (1) mixing a catalyst or reactive ingredient with the polymer immediately  prior to applying, (2) heating to initiate the chemical reaction, (3) radiation cur- ing, such as ultraviolet light, and (4) curing by evaporation of water from the liquid  or paste adhesive. In addition, some synthetic adhesives are applied as ﬁ  lms or as  pressure-sensitive coatings on the surface of one of the adherends. "
    },
    {
        "type": "text",
        "text": "30.3.3  ADHESIVE APPLICATION TECHNOLOGY ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Industrial applications of adhesive bonding are widespread and growing. Major users  are automotive, aircraft, building products, and packaging industries; other indus- tries include footwear, furniture, bookbinding, electrical, and shipbuilding. Table 30.3  indicates some of the speciﬁ  c applications for which synthetic adhesives are used.  This section considers several issues relating to adhesives application technology. "
    },
    {
        "type": "text",
        "text": "Surface Preparation  In order for adhesive bonding to succeed, part surfaces must  be extremely clean. The strength of the bond depends on the degree of adhesion  between adhesive and adherend, and this depends on the cleanliness of the surface.  "
    },
    {
        "type": "text",
        "text": "In most cases, additional processing steps are required for cleaning and surface prep- aration, the methods varying with different adherend materials. For metals, solvent  wiping is often used for cleaning, and abrading the surface by sand blasting or other  process usually improves adhesion. For nonmetallic parts, solvent cleaning is gener- ally used, and the surfaces are sometimes mechanically abraded or chemically etched  to increase roughness. It is desirable to accomplish the adhesive bonding process as  soon as possible after these treatments, since surface oxidation and dirt accumulation  increase with time. "
    },
    {
        "type": "text",
        "text": "Application Methods  The actual application of the adhesive to one or both part  surfaces is accomplished in a number of ways. The following list, though incomplete,  provides a sampling of the techniques used in industry:\n\n "
    },
    {
        "type": "text",
        "text": "➢   Brushing , performed manually, uses a stiff-bristled brush. Coatings are often  uneven.\n\n $\\succcurlyeq$ Flowing , using manually operated pressure-fed ﬂ  ow guns, has more consistent  control than brushing.\n\n $\\succcurlyeq$ Manual rollers , similar to paint rollers, are used to apply adhesive from a ﬂ  at  container.\n\n $\\succcurlyeq$ Silk screening  involves brushing the adhesive through the open areas of the  screen onto the part surface, so that only selected areas are coated.\n\n $\\succcurlyeq$ Spraying  uses an air-driven (or airless) spray gun for fast application over large  or difﬁ  cult-to-reach areas.\n\n $\\succcurlyeq$ Automatic applicators  include various automatic dispensers and nozzles for use  on medium- and high-speed production applications. Figure 30.13 illustrates the  use of a dispenser for assembly. "
    },
    {
        "type": "image",
        "img_path": "images/033a99022e386d2539b4cc18cf2dafad3a6496108e331fef51dd695b832b3c78.jpg",
        "img_caption": "FIGURE 30.13  Adhesive is  dispensed by a manually controlled  dispenser to bond parts during  assembly. (Courtesy of Nordson, Inc.) "
    },
    {
        "type": "image",
        "img_path": "images/a37df881a75c3178aadd4159ec9c812d22e9d4db0453a69a01c90a23139d81a4.jpg",
        "img_caption": "FIGURE 30.14  Roll coating of adhesive  onto thin, ﬂ  exible material such as paper,  cloth, or ﬂ  exible polymer. "
    },
    {
        "type": "text",
        "text": "➢   Roll coating  is a mechanized technique in which a rotating roller is partially sub- mersed in a pan of liquid adhesive and picks up a coating of the adhesive, which  is then transferred to the work surface. Figure 30.14 shows one possible appli- cation, in which the work is a thin, ﬂ  exible material (e.g., paper, cloth, leather,  plastic). Variations of the method are used for coating adhesive onto wood, wood  composite, cardboard, and similar materials with large surface areas. "
    },
    {
        "type": "text",
        "text": "Advantages and Limitations  Advantages of adhesive bonding are (1) the proc- ess is applicable to a wide variety of materials; (2) parts of different sizes and cross  sections can be joined—fragile parts can be joined by adhesive bonding; (3) bond- ing occurs over the entire surface area of the joint, rather than in discrete spots or  along seams as in fusion welding, thereby distributing stresses over the entire area;  (4) some adhesives are ﬂ  exible after bonding and are thus tolerant of cyclical load- ing and differences in thermal expansion of adherends; (5) low temperature curing  avoids damage to parts being joined; (6) sealing as well as bonding can be achieved;  and (7) joint design is often simpliﬁ  ed (e.g., two ﬂ  at surfaces can be joined without  providing special part features such as screw holes). "
    },
    {
        "type": "text",
        "text": "Principal limitations of this technology include (1) joints are generally not as  strong as other joining methods; (2) adhesive must be compatible with materials  being joined; (3) service temperatures are limited; (4) cleanliness and surface prepa- ration prior to application of adhesive are important; (5) curing times can impose a  limit on production rates; and (6) inspection of the bonded joint is difﬁ  cult. "
    },
    {
        "type": "text",
        "text": "References ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": " [1] Adams, R. S. (ed.).  Adhesive Bonding: Science,  Technology, and Applications . CRC Taylor &  Francis, Boca Raton, Florida, 2005.\n\n  [2] Bastow, E. “Five Solder Families and How  They Work,”  Advanced Materials & Processes ,  December 2003, pp. 26–29.\n\n  [3] Bilotta, A. J.  Connections in Electronic Assem- blies . Marcel Dekker, New York, 1985. "
    },
    {
        "type": "text",
        "text": " [4] Bralla, J. G. (ed.).  Design for Manufactur- ability Handbook , 2nd ed. McGraw-Hill, New  York, 1998.\n\n  [5]  Brazing Manual , 3rd ed. American Welding  Society, Miami, Florida, 1976.\n\n  [6] Brockman, W., Geiss, P . L., Klingen, J., and  Schroeder, K. B.  Adhesive Bonding: Materials,  "
    }
]