[
    {
        "type": "text",
        "text": "Part III   Solidiﬁ  cation  Processes ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "10 Fundamentals  of Metal Casting ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Chapter Contents ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "10.1 Overview of Casting Technology "
    },
    {
        "type": "text",
        "text": "10.1.1 Casting Processes 10.1.2 Sand-Casting Molds "
    },
    {
        "type": "text",
        "text": "10.2 Heating and Pouring ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "10.2.1 Heating the Metal 10.2.2 Pouring the Molten Metal 10.2.3 Engineering Analysis of Pouring 10.2.4 Fluidity "
    },
    {
        "type": "text",
        "text": "10.3 Solidiﬁ  cation and Cooling ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "10.3.1 Solidiﬁ  cation of Metals 10.3.2 Solidiﬁ  cation Time 10.3.3 Shrinkage 10.3.4 Directional Solidiﬁ  cation 10.3.5 Riser Design "
    },
    {
        "type": "text",
        "text": "This part of the book covers those manufacturing  processes in which the starting work material is either  a liquid or is in a highly plastic condition, and a part  is created through solidiﬁ  cation of the material. Cast- ing and molding processes dominate this category of  shaping operations. With reference to Figure 10.1, the  solidiﬁ  cation processes can be classiﬁ  ed according to  the engineering material that is processed: (1) metals,  (2) ceramics, speciﬁ  cally glasses,  and (3) polymers and  polymer matrix composites (PMCs). Casting of metals  is covered in this and the following chapter. Glasswork- ing is covered in Chapter 12, and the processing of poly- mers and PMCs is treated in Chapters 13 and 14. "
    },
    {
        "type": "text",
        "text": "Casting  is a process in which molten metal ﬂ  ows by  gravity or other force into a mold where it solidiﬁ  es in  the shape of the mold cavity. The term  casting  is also  applied to the part that is made by this process. It is one  of the oldest shaping processes, dating back 6000 years  (Historical Note 10.1). The principle of casting seems  simple: melt the metal, pour it into a mold, and let it  cool and solidify; yet there are many factors and vari- ables that must be considered in order to accomplish a  successful casting operation. "
    },
    {
        "type": "text",
        "text": "Casting includes both the casting of ingots and the  casting of shapes. The term  ingot  is usually associ- ated with the primary metals industries; it describes a  large casting that is simple in shape and intended for  "
    },
    {
        "type": "image",
        "img_path": "images/a004ef6a006b91d6379175ed32739720d6f55dd64b21fbc7f5bfb66820e008f3.jpg",
        "img_caption": "FIGURE 10.1  Classiﬁ  cation of solidiﬁ  cation processes. "
    },
    {
        "type": "text",
        "text": "Historical Note 10.1  Origins of casting ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Casting of metals can be traced back to around 4000  B . C . E . Gold was the ﬁ  rst metal to be discovered and  used by the early civilizations; it was malleable and  could be readily hammered into shape at room tem- perature. There seemed to be no need for other ways  to shape gold. It was the subsequent discovery of cop- per that gave rise to the need for casting. Although  copper could be forged to shape, the process was  more difﬁ  cult (due to strain hardening) and limited to  relatively simple forms. Historians believe that hun- dreds of years elapsed before the process of cast- ing copper was ﬁ  rst performed, probably by accident  during the reduction of copper ore in preparation for  hammering the metal into some useful form. Thus,  through serendipity, the art of casting was born. It is  likely that the discovery occurred in Mesopotamia, and  the “technology” quickly spread throughout the rest  of the ancient world. "
    },
    {
        "type": "text",
        "text": "It was an innovation of signiﬁ  cant importance  in the history of mankind. Shapes much more intri- cate could be formed by casting than by hammering.  More sophisticated tools and weapons could be fab- ricated. More detailed implements and ornaments  could be fashioned. Fine gold jewelry could be made  more beautiful and valuable than by previous meth- ods. Alloys were ﬁ  rst used for casting when it was  discovered that mixtures of copper and tin (the alloy  thus formed was bronze) yielded much better cast- ings than copper alone. Casting permitted the crea- tion of wealth to those nations that could perform it  best. Egypt ruled the Western civilized world during  the Bronze Age (nearly 2000 years) largely due to its  ability to perform the casting process. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Religion provided an important inﬂ  uence during the  Dark Ages (circa 400–1400) for perpetuating the foun- dryman’s skills. Construction of cathedrals and church- es required the casting of bells that were used in these  structures. Indeed, the time and effort needed to cast  the large bronze bells of the period helped to move  the casting process from the realm of art toward the  regimen of technology. Advances in melting and mold- making techniques were made. Pit molding, in which  the molds were formed in a deep pit located in front  of the furnace to simplify the pouring process, was  improved as a casting procedure. In addition, the bell  founder learned the relationships between the tone of  the bell, which was the important measure of product  quality, and its size, shape, thickness, and metal com- position. "
    },
    {
        "type": "text",
        "text": "Another important product associated with the de- velopment of casting was the cannon. Chronologically,  it followed the bell, and therefore many of the casting  techniques developed for bell founding were applied  to cannon making. The ﬁ  rst cast cannon was made in  Ghent, Belgium, in the year 1313—by a religious monk,  of all people. It was made of bronze, and the bore was  formed by means of a core during casting. Because of  the rough bore surface created by the casting process,  these early guns were not accurate and had to be ﬁ  red  at relatively close range to be effective. It was soon  realized that accuracy and range could be improved if  the bore were made smooth by machining the surface.  Quite appropriately, this machining process was called  boring  (Section 21.2.5). "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "subsequent reshaping by processes such as rolling or forging. Ingot casting is dis- cussed in Chapter 6.  Shape casting  involves the production of more complex  geometries that are much closer to the ﬁ  nal desired shape of the part or product.  It is with the casting of shapes rather than ingots that this chapter and the next are  concerned. "
    },
    {
        "type": "text",
        "text": "A variety of shape casting methods are available, thus making it one of the most  versatile of all manufacturing processes. Among its capabilities and advantages are  the following:\n\n "
    },
    {
        "type": "text",
        "text": "$\\succcurlyeq$ Casting can be used to create complex part geometries, including both external  and internal shapes.\n\n $\\succcurlyeq$ Some casting processes are capable of producing parts to  net shape . No further  manufacturing operations are required to achieve the required geometry and  dimensions of the parts. Other casting processes are  near net shape , for which  some additional shape processing is required (usually machining) in order to  achieve accurate dimensions and details.\n\n $\\succcurlyeq$   Casting can be used to produce very large parts. Castings weighing more than  100 tons have been made.\n\n $\\succcurlyeq$ The casting process can be performed on any metal that can be heated to the  liquid state.\n\n $\\succcurlyeq$ Some casting methods are quite suited to mass production. "
    },
    {
        "type": "text",
        "text": "There are also disadvantages associated with casting—different disadvantages  for different casting methods. These include limitations on mechanical properties,  porosity, poor dimensional accuracy and surface ﬁ  nish for some casting processes,  safety hazards to humans when processing hot molten metals, and environmental  problems. "
    },
    {
        "type": "text",
        "text": "Parts made by casting processes range in size from small components weighing  only a few ounces up to very large products weighing tons. The list of parts includes  dental crowns, jewelry, statues, wood-burning stoves, engine blocks and heads for  automotive vehicles, machine frames, railway wheels, frying pans, pipes, and pump  housings. All varieties of metals can be cast, ferrous and nonferrous. "
    },
    {
        "type": "text",
        "text": "Casting can also be used on other materials such as polymers and ceramics;  however, the details are sufﬁ  ciently different that discussion of the casting proc- esses for these materials is postponed until later chapters. This chapter and the next  deal exclusively with metal casting. Here the fundamentals that apply to virtually  all casting operations are discussed. In the following chapter, the individual casting  processes are described, along with some of the product design issues that must be  considered when making parts out of castings. "
    },
    {
        "type": "text",
        "text": " Overview of Casting Technology ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "As a production process, casting is usually carried out in a foundry. A  foundry  is a  factory equipped for making molds, melting and handling metal in molten form,  performing the casting process, and cleaning the ﬁ  nished casting. The workers who  perform the casting operations in these factories are called  foundrymen . "
    },
    {
        "type": "text",
        "text": "10.1.1  CASTING PROCESSES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Discussion of casting logically begins with the mold. The  mold  contains a cavity  whose geometry determines the shape of the cast part. The actual size and shape  of the cavity must be slightly oversized to allow for shrinkage that occurs in the  metal during solidiﬁ  cation and cooling. Different metals undergo different amounts  of shrinkage, so the mold cavity must be designed for the particular metal to be cast  if dimensional accuracy is critical. Molds are made of a variety of materials, including  sand, plaster, ceramic, and metal. The various casting processes are often classiﬁ  ed  according to these different types of molds. "
    },
    {
        "type": "text",
        "text": "To accomplish a casting operation, the metal is ﬁ  rst heated to a temperature high  enough to completely transform it into a liquid state. It is then poured, or otherwise  directed, into the cavity of the mold. In an  open mold , Figure 10.2(a), the liquid  metal is simply poured until it ﬁ  lls the open cavity. In a  closed mold , Figure 10.2(b), a  passageway, called the gating system, is provided to permit the molten metal to ﬂ  ow  from outside the mold into the cavity. The closed mold is by far the more important  category in production casting operations. "
    },
    {
        "type": "text",
        "text": "As soon as the molten metal is in the mold, it begins to cool. When the tem- perature drops sufﬁ  ciently (e.g., to the freezing point for a pure metal), solidiﬁ  cation  begins. Solidiﬁ  cation involves a change of phase of the metal. Time is required to  complete the phase change, and considerable heat is given up in the process. It is  during this step in the process that the metal assumes the solid shape of the mold  cavity and many of the properties and characteristics of the casting are established. "
    },
    {
        "type": "text",
        "text": "Once the casting has cooled sufﬁ  ciently, it is removed from the mold. Depending  on the casting method and metal used, further processing may be required. This  "
    },
    {
        "type": "image",
        "img_path": "images/667f4fa3d10855a7cf6ca87df350507779b6b93812f7708de500b205b0e68020.jpg",
        "img_caption": "FIGURE 10.2  Two forms of mold: (a) open mold, simply a container in the shape of the desired part; and (b) closed  mold, in which the mold geometry is more complex and requires a gating system (passageway) leading into the cavity. "
    },
    {
        "type": "text",
        "text": "may include trimming any excess metal from the actual cast part, cleaning the sur- face, inspecting the product, and heat treatment to enhance properties. In addition,  machining may be required to achieve closer tolerances on certain part features and  to remove the cast surface. "
    },
    {
        "type": "text",
        "text": "Casting processes divide into two broad categories, according to type of mold  used: expendable mold casting and permanent mold casting. An  expendable mold means that the mold in which the molten metal solidiﬁ  es must be destroyed in order  to remove the casting. These molds are made out of sand, plaster, or similar materi- als, whose form is maintained by using binders of various kinds. Sand casting is the  most prominent example of the expendable mold processes. In sand casting, the  liquid metal is poured into a mold made of sand. After the metal hardens, the mold  must be sacriﬁ  ced in order to recover the casting. "
    },
    {
        "type": "text",
        "text": "A  permanent mold  is one that can be used over and over to produce many cast- ings. It is made of metal (or, less commonly, a ceramic refractory material) that  can withstand the high temperatures of the casting operation. In permanent mold  casting, the mold consists of two (or more) sections that can be opened to permit  removal of the ﬁ  nished part. Die casting is the most familiar process in this group. "
    },
    {
        "type": "text",
        "text": "More intricate casting geometries are generally possible with the expendable  mold processes. Part shapes in the permanent mold processes are limited by the  need to open the mold. On the other hand, some of the permanent mold processes  have certain economic advantages in high production operations. The expendable  mold and permanent mold casting processes are described in Chapter 11. "
    },
    {
        "type": "text",
        "text": "10.1.2  SAND-CASTING MOLDS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Sand casting is by far the most important casting process. A sand-casting mold will  be used to describe the basic features of a mold. Many of these features and terms  are common to the molds used in other casting processes. Figure 10.2(b) shows the  cross-sectional view of a typical sand-casting mold, indicating some of the terminol- ogy. The mold consists of two halves: cope and drag. The  cope  is the upper half of the  mold, and the  drag  is the bottom half. These two mold parts are contained in a box,  called a  ﬂ  ask , which is also divided into two halves, one for the cope and the other  for the drag. The two halves of the mold separate at the  parting line . "
    },
    {
        "type": "text",
        "text": "In sand casting (and other expendable mold processes) the mold cavity is formed  by means of a  pattern , which is made of wood, metal, plastic, or other material and  has the shape of the part to be cast. The cavity is formed by packing sand around the  pattern, about half each in the cope and drag, so that when the pattern is removed,  the remaining void has the desired shape of the cast part. The pattern is usually  made oversized to allow for shrinkage of the metal as it solidiﬁ  es and cools. The sand  for the mold is moist and contains a binder to maintain its shape. "
    },
    {
        "type": "text",
        "text": "The cavity in the mold provides the external surfaces of the cast part. In addition,  a casting may have internal surfaces. These surfaces are determined by means of a  core , a form placed inside the mold cavity to deﬁ  ne the interior geometry of the part.  In sand casting, cores are generally made of sand, although other materials can be  used, such as metals, plaster, and ceramics. "
    },
    {
        "type": "text",
        "text": "The  gating system  in a casting mold is the channel, or network of channels, by  which molten metal ﬂ  ows into the cavity from outside the mold. As shown in the ﬁ  g- ure, the gating system typically consists of a  downsprue  (also called simply the  sprue ),  through which the metal enters a  runner  that leads into the main cavity. At the top of  the downsprue, a  pouring cup  is often used to minimize splash and turbulence as the  metal ﬂ  ows into the downsprue. It is shown in the diagram as a simple cone-shaped  funnel. Some pouring cups are designed in the shape of a bowl, with an open channel  leading to the downsprue. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "In addition to the gating system, any casting in which shrinkage is signiﬁ  cant  requires a riser connected to the main cavity. The  riser  is a reservoir in the mold that  serves as a source of liquid metal for the casting to compensate for shrinkage during  solidiﬁ  cation. The riser must be designed to freeze after the main casting in order to  satisfy its function. "
    },
    {
        "type": "text",
        "text": "As the metal ﬂ  ows into the mold, the air that previously occupied the cavity, as  well as hot gases formed by reactions of the molten metal, must be evacuated so that  the metal will completely ﬁ  ll the empty space. In sand casting, for example, the natu- ral porosity of the sand mold permits the air and gases to escape through the walls  of the cavity. In permanent metal molds, small vent holes are drilled into the mold or  machined into the parting line to permit removal of air and gases. "
    },
    {
        "type": "text",
        "text": " Heating and Pouring ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "To perform a casting operation, the metal must be heated to a temperature some- what above its melting point and then poured into the mold cavity to solidify. Several  aspects of these two steps are discussed in this section. "
    },
    {
        "type": "text",
        "text": "10.2.1  HEATING THE METAL ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Heating furnaces of various kinds (Section 11.4.1) are used to heat the metal to a  molten temperature sufﬁ  cient for casting. The heat energy required is the sum of (1)  the heat to raise the temperature to the melting point, (2) the heat of fusion to con- vert it from solid to liquid, and (3) the heat to raise the molten metal to the desired  temperature for pouring. This can be expressed: "
    },
    {
        "type": "equation",
        "text": "\n$$\nH=\\rho\\,V\\{C_{s}\\,(T_{m}-\\,T_{o})+\\,H_{f}+\\,C_{l}\\,(T_{p}\\,-\\,T_{m})\\}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $H=$  total heat required to raise the temperature of the metal to the pour- ing temperature, J (Btu); $\\rho=$  density,  $\\mathrm{{g}/\\mathrm{{cm}}^{3}}$   $\\left(1\\mathrm{b}\\mathrm{m}/\\mathrm{in}^{3}\\right)$ ;  $C_{s}=$  weight speciﬁ  c heat for  the solid metal,  $\\mathrm{J/g-C}$  (Btu/lbm-F);  $T_{m}=$  melting temperature of the metal, C (F);  $T_{o}=$  starting temperature—usually ambient,  $\\mathrm{C}$  (F);  $H_{f}=$  heat of fusion,  $\\mathrm{J}/\\mathrm{g}$  ( $\\mathrm{{'Bup/}}$ lbm);  $C_{1}=$  weight speciﬁ  c heat of the liquid metal, $\\mathrm{J/g-C}$  (Btu/lbm-F);  $T_{p}=$  pouring  temperature, C (F); and  $V=$  volume of metal being heated, $\\mathrm{cm}^{3}\\left(\\mathrm{in}^{3}\\right)$ . "
    },
    {
        "type": "text",
        "text": "Example 10.1  Heating metal  for casting ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "One cubic meter of a certain eutectic alloy is heated in a crucible from room  temperature to $100^{\\circ}\\mathrm{C}$  above its melting point for casting. The alloy’s density $=$ $7.5\\;\\mathrm{g}/\\mathrm{cm}^{3}$ , melting point $=800^{\\circ}\\mathrm{C}$ , speciﬁ  c heat $=0.33\\;\\mathrm{J}/\\mathrm{g}^{\\circ}\\mathrm{C}$  in the solid state  and $0.29\\,\\mathrm{J/g^{\\circ}C}$  in the liquid state; and heat of fusion $=160\\,\\mathrm{J/g}$ . How much heat  energy must be added to accomplish the heating, assuming no losses? "
    },
    {
        "type": "text",
        "text": "Solution :  Assume ambient temperature in the foundry $=25^{\\circ}\\mathrm{C}$  and that the  density of the liquid and solid states of the metal are the same. Noting that one  $\\mathsf{m}^{3}=10^{6}\\,\\mathsf{c m}^{3}$ , and substituting the property values into Equation (10.1),  "
    },
    {
        "type": "text",
        "text": "$H=(7.5)\\,(10^{6})\\{0.33(800-25)+160+0.29\\,(100)\\}=3335(10^{6})\\,\\mathrm{J}$ The above equation is of conceptual value, but its computational value is limited,  "
    },
    {
        "type": "text",
        "text": "notwithstanding the calculation in Example 10.1. Use of Equation (10.1) is com- plicated by the following factors: (1) Speciﬁ  c heat and other thermal properties of  a solid metal vary with temperature, especially if the metal undergoes a change of  phase during heating. (2) A metal’s speciﬁ  c heat may be different in the solid and  liquid states. (3) Most casting metals are alloys, and most alloys melt over a tem- perature range between a solidus and liquidus rather than at a single melting point;  thus, the heat of fusion cannot be applied so simply as indicated above. (4) The  property values required in the equation for a particular alloy are not readily avail- able in most cases. (5) There are signiﬁ  cant heat losses to the environment during  heating. "
    },
    {
        "type": "text",
        "text": "10.2.2  POURING THE MOLTEN METAL ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "After heating, the metal is ready for pouring. Introduction of molten metal into the  mold, including its ﬂ  ow through the gating system and into the cavity, is a critical  step in the casting process. For this step to be successful, the metal must ﬂ  ow into  all regions of the mold before solidifying. Factors affecting the pouring operation  include pouring temperature, pouring rate, and turbulence. "
    },
    {
        "type": "text",
        "text": "The  pouring temperature  is the temperature of the molten metal as it is intro- duced into the mold. What is important here is the difference between the tempera- ture at pouring and the temperature at which freezing begins (the melting point for  a pure metal or the liquidus temperature for an alloy). This temperature difference is  sometimes referred to as the  superheat . This term is also used for the amount of heat  that must be removed from the molten metal between pouring and when solidiﬁ  ca- tion commences [7]. "
    },
    {
        "type": "text",
        "text": "Pouring rate  refers to the volumetric rate at which the molten metal is poured  into the mold. If the rate is too slow, the metal will chill and freeze before ﬁ  lling the  cavity. If the pouring rate is excessive, turbulence can become a serious problem.  Turbulence  in ﬂ  uid ﬂ  ow is characterized by erratic variations in the magnitude and  direction of the velocity throughout the ﬂ  uid. The ﬂ  ow is agitated and irregular  rather than smooth and streamlined, as in laminar ﬂ  ow. Turbulent ﬂ  ow should be  avoided during pouring for several reasons. It tends to accelerate the formation  of metal oxides that can become entrapped during solidiﬁ  cation, thus degrading  the quality of the casting. Turbulence also aggravates  mold erosion , the gradual  wearing away of the mold surfaces due to impact of the ﬂ  owing molten metal.  The densities of most molten metals are much higher than water and other ﬂ  uids  normally encountered. These molten metals are also much more chemically reac- tive than at room temperature. Consequently, the wear caused by the ﬂ  ow of these  metals in the mold is signiﬁ  cant, especially under turbulent conditions. Erosion is  especially serious when it occurs in the main cavity because the geometry of the  cast part is affected. "
    },
    {
        "type": "text",
        "text": "10.2.3  ENGINEERING ANALYSIS OF POURING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "There are several relationships that govern the ﬂ  ow of liquid metal through  the gating system and into the mold. An important relationship is  Bernoulli’s  theorem , which states that the sum of the energies (head, pressure, kinetic, and  friction) at any two points in a ﬂ  owing liquid are equal. This can be written in the  following form: "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "equation",
        "text": "\n$$\nh_{1}+\\frac{p_{1}}{\\rho}+\\frac{\\nu_{1}^{2}}{2g}+F_{1}=h_{2}+\\frac{p^{2}}{\\rho}+\\frac{\\nu_{2}^{2}}{2g}+F_{2}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $h=$  head, cm (in), $p=$  pressure on the liquid, $\\mathrm{N}/\\mathrm{cm}^{2}\\,(\\mathrm{lb}/\\mathrm{in}^{2});\\rho=\\mathrm{density},\\mathrm{g}/\\mathrm{cm}^{3}$ $\\mathrm{(l bm/in}^{3})$ ;  $\\nu~=$  ﬂ  ow velocity, cm/s (in/sec);  $g\\,=$ gravitational acceleration constant,  $981\\;\\mathrm{cm/s/s}$ $\\mathrm{s/s}\\;(32.2\\times12=386\\;\\mathrm{in/sec/sec})$ ; and $F=$  head losses due to friction, cm (in).  Subscripts 1 and 2 indicate any two locations in the liquid ﬂ  ow. "
    },
    {
        "type": "text",
        "text": "Bernoulli’s equation can be simpliﬁ  ed in several ways. If friction losses are ignored  (to be sure, friction will affect the liquid ﬂ  ow through a sand mold), and the system  is assumed to remain at atmospheric pressure throughout, then the equation can be  reduced to "
    },
    {
        "type": "equation",
        "text": "\n$$\nh_{1}+\\frac{\\nu_{1}^{2}}{2g}=h_{2}+\\frac{\\nu_{2}^{2}}{2g}\n$$\n   ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "This can be used to determine the velocity of the molten metal at the base of the  sprue. Let point 1 be deﬁ  ned at the top of the sprue and point 2 at its base. If point  2 is used as the reference plane, then the head at that point is zero ( $(h_{2}=0)$ ) and  $h_{1}$   is the height (length) of the sprue. When the metal is poured into the pouring cup  and overﬂ  ows down the sprue, its initial velocity at the top is zero ( $\\left(\\nu_{1}=0\\right)$ ). Hence,  Equation (10.3) further simpliﬁ  es to "
    },
    {
        "type": "equation",
        "text": "\n$$\nh_{1}=\\frac{\\nu_{2}^{2}}{2g}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "which can be solved for the ﬂ  ow velocity: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\nu=\\sqrt{2g h}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $\\nu\\,=$  the velocity of the liquid metal at the base of the sprue, $\\mathrm{{cm}/\\mathrm{{s}}}$  (in/sec);  $g=981\\ \\mathrm{cm/s/s}\\ (386\\ \\mathrm{in/sec/sec});$ ; and $h=$  the height of the sprue, cm (in). "
    },
    {
        "type": "text",
        "text": "Another relationship of importance during pouring is the  continuity law , which  states that the volume rate of ﬂ  ow remains constant throughout the liquid. The vol- ume ﬂ  ow rate is equal to the velocity multiplied by the cross-sectional area of the  ﬂ  owing liquid. The continuity law can be expressed: "
    },
    {
        "type": "equation",
        "text": "\n$$\nQ=\\nu_{1}A_{1}=\\nu_{2}A_{2}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $Q=$  volumetric ﬂ  ow rate,  $\\mathrm{cm}^{3}/\\mathrm{s}$   $(\\mathrm{in}^{3}/\\mathrm{sec}_{,}$ );  $\\nu\\,=$ velocity as before;  $A\\,=\\,\\mathrm{cross-}$ sectional area of the liquid, $\\mathrm{cm}^{2}\\left(\\mathrm{in}^{2}\\right)$ ; and the subscripts refer to any two points in the  ﬂ  ow system. Thus, an increase in area results in a decrease in velocity, and vice versa. "
    },
    {
        "type": "text",
        "text": "Equations (10.4) and (10.5) indicate that the sprue should be tapered. As the  metal accelerates during its descent into the sprue opening, the cross-sectional  area of the channel must be reduced; otherwise, as the velocity of the ﬂ  owing metal  increases toward the base of the sprue, air can be aspirated into the liquid and  conducted into the mold cavity. To prevent this condition, the sprue is designed  with a taper, so that the volume ﬂ  ow rate  $\\nu A$  is the same at the top and bottom of  the sprue. "
    },
    {
        "type": "text",
        "text": "Assuming that the runner from the sprue base to the mold cavity is horizontal  (and therefore the head  $h$  is the same as at the sprue base), then the volume rate  of ﬂ  ow through the gate and into the mold cavity remains equal to  $\\nu A$  at the base.  Accordingly, the time required to ﬁ  ll a mold cavity of volume  $V$ can be estimated as "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "equation",
        "text": "\n$$\nT_{M F}=\\frac{V}{Q}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $T_{M F}\\,=\\,\\mathrm{mod}$  ﬁ  lling time, s (sec);  $V=$ volume of mold cavity,  $\\mathrm{cm}^{3}\\ (\\mathrm{in}^{3})$ ; and  $Q=$  volume ﬂ  ow rate, as before. The mold ﬁ  lling time computed by Equation (10.6)  must be considered a minimum time. This is because the analysis ignores friction  losses and possible constriction of ﬂ  ow in the gating system; thus, the mold ﬁ  lling  time will be longer than what is given by Equation (10.6). "
    },
    {
        "type": "text",
        "text": "Example 10.2  Pouring  calculations ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A mold sprue is $20\\,\\mathrm{cm}$  long, and the cross-sectional area at its base is $2.5\\,\\mathrm{cm}^{2}$ .  The sprue feeds a horizontal runner leading into a mold cavity whose volume  is  $1560\\;\\mathrm{cm}^{3}$ . Determine: (a) velocity of the molten metal at the base of the  sprue, (b) volume rate of ﬂ  ow, and (c) time to ﬁ  ll the mold. "
    },
    {
        "type": "text",
        "text": "Solution:  (a) The velocity of the ﬂ  owing metal at the base of the sprue is given  by Equation (10.4): "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\nu=\\sqrt{2(981)(20)}=198.1\\,\\mathrm{cm/s}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "(b) The volumetric ﬂ  ow rate is "
    },
    {
        "type": "equation",
        "text": "\n$$\nQ=(2.5\\:\\mathrm{cm}^{2})\\:(198.1\\:\\mathrm{cm}/\\mathrm{s})=495\\:\\mathrm{cm}^{3}/\\mathrm{s}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "(c) Time required to ﬁ  ll a mold cavity of $1560\\,\\mathrm{cm}^{3}$  at this ﬂ  ow rate is "
    },
    {
        "type": "equation",
        "text": "\n$$\nT_{M F}=1560/495=3.2\\:\\mathrm{s}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "10.2.4 FLUIDITY",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The molten metal ﬂ  ow characteristics are often described by the term  ﬂ  uidity , a meas- ure of the capability of a metal to ﬂ  ow into and ﬁ  ll the mold before freezing. Fluidity is  the inverse of viscosity (Section 3.4); as viscosity increases, ﬂ  uidity decreases. Standard  testing methods are available to assess ﬂ  uidity, including the spiral mold test shown  in Figure 10.3, in which ﬂ  uidity is indicated by the length of the solidiﬁ  ed metal in the  spiral channel. A longer cast spiral means greater ﬂ  uidity of the molten metal. "
    },
    {
        "type": "text",
        "text": "Factors affecting ﬂ  uidity include pouring temperature relative to melting point,  metal composition, viscosity of the liquid metal, and heat transfer to the surroundings.  A higher pouring temperature relative to the freezing point of the metal increases  the time it remains in the liquid state, allowing it to ﬂ  ow further before freezing.  "
    },
    {
        "type": "image",
        "img_path": "images/6ab2835b284c98499ee59b46c66c31bb2c6873b509897af754aec63ae5c47b94.jpg",
        "img_caption": ""
    },
    {
        "type": "text",
        "text": "This tends to aggravate certain casting problems such as oxide formation, gas poros- ity, and penetration of liquid metal into the interstitial spaces between the grains of  sand forming the mold. This last problem causes the surface of the casting to contain  imbedded sand particles, thus making it rougher and more abrasive than normal. "
    },
    {
        "type": "text",
        "text": "Composition also affects ﬂ  uidity, particularly with respect to the metal’s solidiﬁ  - cation mechanism. The best ﬂ  uidity is obtained by metals that freeze at a constant  temperature (e.g., pure metals and eutectic alloys). When solidiﬁ  cation occurs over a  temperature range (most alloys are in this category), the partially solidiﬁ  ed portion  interferes with the ﬂ  ow of the liquid portion, thereby reducing ﬂ  uidity. In addition  to the freezing mechanism, metal composition also determines  heat of fusion —the  amount of heat required to solidify the metal from the liquid state. A higher heat of  fusion tends to increase the measured ﬂ  uidity in casting. "
    },
    {
        "type": "text",
        "text": " Solidiﬁ  cation and Cooling ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "After pouring into the mold, the molten metal cools and solidiﬁ  es. This section  examines the physical mechanism of solidiﬁ  cation that occurs during casting. Issues  associated with solidiﬁ  cation include the time for a metal to freeze, shrinkage, direc- tional solidiﬁ  cation, and riser design. "
    },
    {
        "type": "text",
        "text": "10.3.1  SOLIDIFICATION OF METALS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Solidiﬁ  cation involves the transformation of the molten metal back into the solid  state. The solidiﬁ  cation process differs depending on whether the metal is a pure  element or an alloy. "
    },
    {
        "type": "text",
        "text": "Pure Metals  A pure metal solidiﬁ  es at a constant temperature equal to its freez- ing point, which is the same as its melting point. The melting points of pure metals  are well known and documented (Table 4.1). The process occurs over time as shown  in the plot of Figure 10.4, called a cooling curve. The actual freezing takes time,  "
    },
    {
        "type": "image",
        "img_path": "images/99a697365bd2eb17b2bc98a7f05f294dca81a642b3647abbb459f6923133157c.jpg",
        "img_caption": "FIGURE 10.4  Cooling  curve for a pure metal  during casting. "
    },
    {
        "type": "text",
        "text": "called the  local solidiﬁ  cation time  in casting, during which the metal’s latent heat  of fusion is released into the surrounding mold. The  total solidiﬁ  cation time  is the  time taken between pouring and complete solidiﬁ  cation. After the casting has com- pletely solidiﬁ  ed, cooling continues at a rate indicated by the downward slope of the  cooling curve. "
    },
    {
        "type": "text",
        "text": "Because of the chilling action of the mold wall, a thin skin of solid metal is initially  formed at the interface immediately after pouring. Thickness of the skin increases to  form a shell around the molten metal as solidiﬁ  cation progresses inward toward the  center of the cavity. The rate at which freezing proceeds depends on heat transfer  into the mold, as well as the thermal properties of the metal. "
    },
    {
        "type": "text",
        "text": "It is of interest to examine the metallic grain formation and growth during this  solidiﬁ  cation process. The metal which forms the initial skin has been rapidly cooled  by the extraction of heat through the mold wall. This cooling action causes the grains  in the skin to be ﬁ  ne and randomly oriented. As cooling continues, further grain  formation and growth occur in a direction away from the heat transfer. Since the  heat transfer is through the skin and mold wall, the grains grow inwardly as needles  or spines of solid metal. As these spines enlarge, lateral branches form, and as these  branches grow, further branches form at right angles to the ﬁ  rst branches. This type  of grain growth is referred to as  dendritic growth , and it occurs not only in the freez- ing of pure metals but alloys as well. These treelike structures are gradually ﬁ  lled-in  during freezing, as additional metal is continually deposited onto the dendrites until  complete solidiﬁ  cation has occurred. The grains resulting from this dendritic growth  take on a preferred orientation, tending to be coarse, columnar grains aligned toward  the center of the casting. The resulting grain formation is illustrated in Figure 10.5. "
    },
    {
        "type": "text",
        "text": "Most Alloys   Most alloys freeze over a temperature range rather than at a single  temperature. The exact range depends on the alloy system and the particular com- position. Solidiﬁ  cation of an alloy can be explained with reference to Figure 10.6,  which shows the phase diagram for a particular alloy system (Section 6.1.2) and the  cooling curve for a given composition. As temperature drops, freezing begins at the  temperature indicated by the  liquidus  and is completed when the  solidus  is reached.  The start of freezing is similar to that of the pure metal. A thin skin is formed at  the mold wall due to the large temperature gradient at this surface. Freezing then  progresses as before through the formation of dendrites that grow away from the  walls. However, owing to the temperature spread between the liquidus and solidus,  the nature of the dendritic growth is such that an advancing zone is formed in which  both liquid and solid metal coexist. The solid portions are the dendrite structures  that have formed sufﬁ  ciently to trap small islands of liquid metal in the matrix. This  solid–liquid region has a soft consistency that has motivated its name as the  mushy  zone . Depending on the conditions of freezing, the mushy zone can be relatively  "
    },
    {
        "type": "image",
        "img_path": "images/d8419b90945ceb35f95e6508bd92cb839c68ed1785e1a0892266ea2a9e1f2f86.jpg"
    },
    {
        "type": "image",
        "img_path": "images/21a8cda2e2f57a6a36efe6c01f74c86757a2adffdb77af475b007e640fd0881a.jpg",
        "img_caption": "FIGURE 10.6  (a) Phase diagram  for a copper–nickel  alloy system and  (b) associated  cooling curve for  a $50\\%\\mathsf{\\breve{N i}}{-}50\\%\\mathsf{C u}$   composition during  casting. "
    },
    {
        "type": "text",
        "text": "narrow, or it can exist throughout most of the casting. The latter condition is pro- moted by factors such as slow heat transfer out of the hot metal and a wide differ- ence between liquidus and solidus temperatures. Gradually, the liquid islands in the  dendrite matrix solidify as the temperature of the casting drops to the solidus for the  given alloy composition. "
    },
    {
        "type": "text",
        "text": "Another factor complicating solidiﬁ  cation of alloys is that the composition of the  dendrites as they start to form favors the metal with the higher melting point. As  freezing continues and the dendrites grow, there develops an imbalance in compo- sition between the metal that has solidiﬁ  ed and the remaining molten metal. This  composition imbalance is ﬁ  nally manifested in the completed casting in the form of  segregation of the elements. The segregation is of two types, microscopic and mac- roscopic. At the microscopic level, the chemical composition varies throughout each  individual grain. This is due to the fact that the beginning spine of each dendrite has  a higher proportion of one of the elements in the alloy. As the dendrite grows in its  local vicinity, it must expand using the remaining liquid metal that has been partially  depleted of the ﬁ  rst component. Finally, the last metal to freeze in each grain is that  which has been trapped by the branches of the dendrite, and its composition is even  further out of balance. Thus, there is a variation in chemical composition within sin- gle grains of the casting. "
    },
    {
        "type": "text",
        "text": "At the macroscopic level, the chemical composition varies throughout the entire  casting. Since the regions of the casting that freeze ﬁ  rst (at the outside near the mold  walls) are richer in one component than the other, the remaining molten alloy is  deprived of that component by the time freezing occurs at the interior. Thus, there  is a general segregation through the cross section of the casting, sometimes called  ingot segregation , as illustrated in Figure 10.7. "
    },
    {
        "type": "text",
        "text": "Eutectic Alloys   Eutectic alloys constitute an exception to the general process by  which alloys solidify. A  eutectic alloy  is a particular composition in an alloy system  for which the solidus and liquidus are at the same temperature. Hence, solidiﬁ  cation  occurs at a constant temperature rather than over a temperature range, as described  above. The effect can be seen in the phase diagram of the lead–tin system shown in  "
    },
    {
        "type": "text",
        "text": "FIGURE 10.7  Characteristic grain structure in an alloy  casting, showing segregation of alloying components in the  center of casting. ",
        "text_level": 1
    },
    {
        "type": "image",
        "img_path": "images/631c9b0ba42519c243d698320a4044f6ece109dfff93b16d643a92627ce7321d.jpg"
    },
    {
        "type": "text",
        "text": "Figure 6.3. Pure lead has a melting point of  $327^{\\circ}\\mathrm{C}$   $(621^{\\circ}\\mathrm{F})$ , while pure tin melts at  $232^{\\circ}\\mathrm{C}$   $(450^{\\circ}\\mathrm{F})$ . Although most lead–tin alloys exhibit the typical solidus–liquidus  temperature range, the particular composition of  $61.9\\%$  tin and  $38.1\\%$  lead has a  melting (freezing) point of  $183^{\\circ}\\mathrm{C}$   $(362^{\\circ}\\mathrm{F})$ . This composition is the  eutectic compo- sition  of the lead–tin alloy system, and  $183^{\\circ}\\mathrm{C}$  is its  eutectic temperature . Lead–tin  alloys are not commonly used in casting, but  $\\mathrm{Pb–Sn}$  compositions near the eutec- tic are used for electrical soldering, where the low melting point is an advantage.  Examples of eutectic alloys encountered in casting include aluminum–silicon  $(11.6\\%$ Si) and cast iron ( $(4.3\\%$  C). "
    },
    {
        "type": "text",
        "text": "10.3.2  SOLIDIFICATION TIME ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Whether the casting is pure metal or alloy, solidiﬁ  cation takes time. The total solidi- ﬁ  cation time is the time required for the casting to solidify after pouring. This time is  dependent on the size and shape of the casting by an empirical relationship known  as  Chvorinov’s rule , which states: "
    },
    {
        "type": "equation",
        "text": "\n$$\nT_{T S}=C_{m}\\left({\\frac{V}{A}}\\right)^{n}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $T_{T S}\\,=$  total solidiﬁ  cation time, min;  $V=$  volume of the casting,  $\\mathrm{cm}^{3}\\ \\mathrm{(in}^{3}\\mathrm{)}$ ;  $A\\,=$  surface area of the casting,  $\\mathrm{cm}^{2}\\ (\\mathrm{in}^{2});n$  is an exponent usually taken to have  a value $=\\,2$ ; and  $C_{m}$  is the  mold constant . Given that  $n\\,=\\,2$ , the units of  $C_{m}$  are  $\\mathrm{min/cm^{2}}\\;(\\mathrm{min/in^{2}})$ , and its value depends on the particular conditions of the cast- ing operation, including mold material (e.g., speciﬁ  c heat, thermal conductivity),  thermal properties of the cast metal (e.g., heat of fusion, speciﬁ  c heat, thermal con- ductivity), and pouring temperature relative to the melting point of the metal. The  value of  $C_{m}$  for a given casting operation can be based on experimental data from  previous operations carried out using the same mold material, metal, and pouring  temperature, even though the shape of the part may be quite different. "
    },
    {
        "type": "text",
        "text": "Chvorinov’s rule indicates that a casting with a higher volume-to-surface area  ratio will cool and solidify more slowly than one with a lower ratio. This principle  is put to good use in designing the riser in a mold. To perform its function of feed- ing molten metal to the main cavity, the metal in the riser must remain in the liquid  phase longer than the casting. In other words, the  $T_{T S}$  for the riser must exceed the  $T_{T S}$  for the main casting. Since the mold conditions for both riser and casting are  the same, their mold constants will be equal. By designing the riser to have a larger  volume-to-area ratio, the main casting will most likely solidify ﬁ  rst and the effects  of shrinkage will be minimized. Before discussing how the riser might be designed  based on Chvorinov’s rule, consider the topic of shrinkage, which is the reason why  risers are needed. "
    },
    {
        "type": "text",
        "text": "10.3.3  SHRINKAGE ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The discussion of solidiﬁ  cation has neglected the impact of shrinkage that occurs dur- ing cooling and freezing. Shrinkage occurs in three steps: (1) liquid contraction during  cooling prior to solidiﬁ  cation; (2) contraction during the phase change from liquid  to solid, called  solidiﬁ  cation shrinkage ; and (3) thermal contraction of the solidiﬁ  ed  casting during cooling to room temperature. The three steps can be explained with  reference to a cylindrical casting made in an open mold, as shown in Figure 10.8. The  molten metal immediately after pouring is shown in part (0) of the series. Contraction  of the liquid metal during cooling from pouring temperature to freezing temperature  causes the height of the liquid to be reduced from its starting level as in (1) of the  ﬁ  gure. The amount of this liquid contraction is usually around  $0.5\\%$ . Solidiﬁ  cation  shrinkage, seen in part (2), has two effects. First, contraction causes a further reduc- tion in the height of the casting. Second, the amount of liquid metal available to feed  the top center portion of the casting becomes restricted. This is usually the last region  to freeze, and the absence of metal creates a void in the casting at this location. This  shrinkage cavity is called a  pipe  by foundrymen. Once solidiﬁ  ed, the casting experi- ences further contraction in height and diameter while cooling, as in (3). This shrink- age is determined by the solid metal’s coefﬁ  cient of thermal expansion, which in this  case is applied in reverse to determine contraction. "
    },
    {
        "type": "image",
        "img_path": "images/cfa7761b428181f0e4ddd75c1e40b7ec5e46394d4c550f3168591a2ec22beda5.jpg",
        "img_caption": "FIGURE 10.8  Shrinkage  of a cylindrical casting  during   solidiﬁ  cation  and cooling: (0)   starting  level of molten metal  immediately after  pouring; (1)   reduction in  level caused by liquid  contraction during  cooling; (2) reduction  in height and   formation  of shrinkage cavity  caused by   solidiﬁ  cation  shrinkage; and (3) further  reduction in height  and diameter due to  thermal contraction  during   cooling of the  solid metal. For clarity,  dimensional reductions  are exaggerated in our  sketches. "
    },
    {
        "type": "table",
        "img_path": "images/3fae86c2d24215fc236cc8f4f9e3366926aa361265bfcd5b03d9d66a419f588c.jpg",
        "table_caption": "TABLE  •  10.1  Typical linear shrinkage values for different casting metals due to solid thermal contraction. ",
        "table_footnote": "Compiled from [10]. "
    },
    {
        "type": "text",
        "text": "Solidiﬁ  cation shrinkage occurs in nearly all metals because the solid phase has  a higher density than the liquid phase. The phase transformation that accompanies  solidiﬁ  cation causes a reduction in the volume per unit weight of metal. The excep- tion is cast iron containing high carbon content, whose solidiﬁ  cation during the  ﬁ  nal stages of freezing is complicated by a period of graphitization, which results  in expansion that tends to counteract the volumetric decrease associated with the  phase change [7]. Compensation for solidiﬁ  cation shrinkage is achieved in several  ways depending on the casting operation. In sand casting, liquid metal is supplied  to the cavity by means of risers (Section 10.3.5). In die casting (Section 11.3.3), the  molten metal is applied under pressure.  "
    },
    {
        "type": "text",
        "text": "Pattern-makers account for thermal contraction by making the mold cavities  oversized. The amount by which the mold must be made larger relative to the ﬁ  nal  casting size is called the  pattern shrinkage allowance . Although the shrinkage is  volumetric, the dimensions of the casting are expressed linearly, so the allowances  must be applied accordingly. Special “shrink rules” with slightly elongated scales are  used to make the patterns and molds larger than the desired casting by the appropri- ate amount. Table 10.1 lists typical values of linear shrinkage for various cast metals;  these values can be used to determine shrink rule scales. "
    },
    {
        "type": "text",
        "text": "10.3.4  DIRECTIONAL SOLIDIFICATION ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "In order to minimize the damaging effects of shrinkage, it is desirable for the  regions of the casting most distant from the liquid metal supply to freeze ﬁ  rst and  for solidiﬁ  cation to progress from these remote regions toward the riser(s). In this  way, molten metal will continually be available from the risers to prevent shrink- age voids during freezing. The term  directional solidiﬁ  cation  is used to describe  this aspect of the freezing process and the methods by which it is controlled. The  desired directional solidiﬁ  cation is achieved by observing Chvorinov’s rule in  the design of the casting itself, its orientation within the mold, and the design of the riser  system that feeds it. For example, by locating sections of the casting with lower  V / A ratios away from the riser, freezing will occur ﬁ  rst in these regions and the supply of liq- uid metal for the rest of the casting will remain open until these bulkier sections solidify. "
    },
    {
        "type": "text",
        "text": "Another way to encourage directional solidiﬁ  cation is to use  chills —internal  or external heat sinks that cause rapid freezing in certain regions of the casting.  Internal chills  are small metal parts placed inside the cavity before pouring so that  the molten metal will solidify ﬁ  rst around these parts. The internal chill should have  a chemical composition similar to the metal being poured, most readily achieved by  making the chill out of the same metal as the casting itself. "
    },
    {
        "type": "image",
        "img_path": "images/1db4e1837b6cee2d1fe501d6bcbcab40c5637157277faab6472f82e3d533b694.jpg",
        "img_caption": "FIGURE 10.9  (a) External chill to  encourage rapid  freezing of the molten  metal in a thin section  of the casting; and (b)  the likely result if the  external chill were not  used. "
    },
    {
        "type": "text",
        "text": "External chills  are metal inserts in the walls of the mold cavity that can remove  heat from the molten metal more rapidly than the surrounding sand in order to  promote solidiﬁ  cation. They are often used effectively in sections of the casting  that are difﬁ  cult to feed with liquid metal, thus encouraging rapid freezing in these  sections while the connection to liquid metal is still open. Figure 10.9 illustrates a  possible application of external chills and the likely result in the casting if the chill  were not used. "
    },
    {
        "type": "text",
        "text": "As important as it is to initiate freezing in the appropriate regions of the cavity, it  is also important to avoid premature solidiﬁ  cation in sections of the mold nearest the  riser. Of particular concern is the passageway between the riser and the main cavity.  This connection must be designed in such a way that it does not freeze before the  casting, which would isolate the casting from the molten metal in the riser. Although  it is generally desirable to minimize the volume in the connection (to reduce wasted  metal), the cross-sectional area must be sufﬁ  cient to delay the onset of freezing. This  goal is usually aided by making the passageway short in length, so that it absorbs  heat from the molten metal in the riser and the casting. "
    },
    {
        "type": "text",
        "text": "10.3.5  RISER DESIGN ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "As described earlier, a riser, Figure 10.2(b), is used in a sand-casting mold to feed  liquid metal to the casting during freezing in order to compensate for solidiﬁ  cation  shrinkage. To function, the riser must remain molten until after the casting solidi- ﬁ  es. Chvorinov’s rule can be used to compute the size of a riser that will satisfy this  requirement. The following example illustrates the calculation. "
    },
    {
        "type": "text",
        "text": "Example 10.3  Riser design  using  Chvorinov’s rule ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A cylindrical riser must be designed for a sand-casting mold. The casting  itself is a steel rectangular plate with dimensions  $7.5\\:\\mathrm{cm}\\times12.5\\:\\mathrm{cm}\\times2.0\\:\\mathrm{cm}.$ Previous observations have indicated that the total solidiﬁ  cation time  $\\left(T_{T S}\\right)$   for this casting $=1.6$  min. The cylinder for the riser will have a diameter-to- height ratio $=1.0$ . Determine the dimensions of the riser so that its  $T_{\\mathit{T S}}=$   $2.0\\;\\mathrm{min}$ . "
    },
    {
        "type": "text",
        "text": "Solution :  First determine the  $V/A$  ratio for the plate. Its volume  $V=$  \n\n $7.5\\times12.5\\times2.0=187.5\\;\\mathrm{cm}^{3}$ , and its surface area  $A=2(7.5\\times12.5+7.5\\times\n\n$ $2.0+12.5\\times2.0)=267.5\\;\\mathrm{cm}^{2}$ . Given that  $T_{T S}=1.6\\;\\mathrm{min}$ , the mold constant  "
    },
    {
        "type": "image",
        "img_path": "images/09553ff90c902c2f78c516bb728fb8c02eda2ae896b1edbc8c397c877f133f3b.jpg"
    },
    {
        "type": "text",
        "text": "$C_{m}$  can be determined from Equation (10.7), using a value of  $n=2$  in the  equation. "
    },
    {
        "type": "equation",
        "text": "\n$$\nC_{m}={\\frac{T_{T S}}{(V/A)^{2}}}={\\frac{1.6}{(187.5/267.5)^{2}}}=3.26\\ \\mathrm{min/cm^{2}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Next the riser must be designed so that its total solidiﬁ  cation time is $2.0\\,\\mathrm{min}$ ,  using the same value of mold constant. The volume of the riser is given by "
    },
    {
        "type": "equation",
        "text": "\n$$\nV={\\frac{\\pi D^{2}h}{4}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "and the surface area is given by  $A=\\pi\\,D h+{\\frac{2\\pi D^{2}}{4}}$ "
    },
    {
        "type": "text",
        "text": "Since the  $D/H$  ratio $=1.0$ , then $D=H$ . Substituting  $D$  for  $H$  in the volume  and area formulas,  "
    },
    {
        "type": "equation",
        "text": "\n$$\nV=\\pi\\,D^{3}/4\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "and "
    },
    {
        "type": "equation",
        "text": "\n$$\nA=\\pi\\,D^{2}+2\\pi\\,D^{2}/4=1.5\\pi\\,D^{2}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Thus the  V / A  ratio $=D/6$ . Using this ratio in Chvorinov’s equation,  "
    },
    {
        "type": "equation",
        "text": "\n$$\nT_{T S}=2.0=3.26\\,\\Big(\\frac{D}{6}\\Big)^{2}=0.09056\\;D^{2}\n$$\n \n$$\nD^{2}=2.0/0.09056=22.086\\;\\mathrm{cm}^{2}\n$$\n \n$$\nD=4.7\\,\\mathrm{cm}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Since $H=D$ , then $H=4.7\\:\\mathrm{cm}$  also. "
    },
    {
        "type": "text",
        "text": "The riser represents waste metal that will be separated from the cast part and  remelted to make subsequent castings. It is desirable for the volume of metal in  the riser to be a minimum. Since the geometry of the riser is normally selected to  maximize the $V/A$  ratio, this tends to reduce the riser volume as much as possible.  Note that the volume of the riser in Example 10.3 is $V=\\pi(4.7)^{3}/4=81.5\\;\\mathrm{cm}^{3}$ , only  $44\\%$  of the volume of the plate (casting), even though its total solidiﬁ  cation time is  $25\\%$  longer. "
    },
    {
        "type": "text",
        "text": "Risers can be designed in different forms. The design shown in Figure 10.2(b)  is a  side riser . It is attached to the side of the casting by means of a small chan- nel. A  top riser  is one that is connected to the top surface of the casting. Risers  can be open or blind. An  open riser  is exposed to the outside at the top surface  of the cope. This has the disadvantage of allowing more heat to escape, promot- ing faster solidiﬁ  cation. A  blind riser  is entirely enclosed within the mold, as in  Figure 10.2(b). "
    }
]