[
    {
        "type": "text",
        "text": "Economic and  Product Design  Considerations in Machining ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Chapter Contents ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "23.1 Machinability\n\n "
    },
    {
        "type": "text",
        "text": "23.2 Tolerances and Surface Finish 23.2.1 Tolerances in Machining 23.2.2 Surface Finish in Machining\n\n "
    },
    {
        "type": "text",
        "text": "23.3 Selection of Cutting Conditions 23.3.1 Selecting Feed and Depth of  Cut 23.3.2 Optimizing Cutting Speed\n\n "
    },
    {
        "type": "text",
        "text": "23.4 Product Design Considerations in  Machining "
    },
    {
        "type": "text",
        "text": "This chapter concludes the coverage of conventional  machining with several remaining topics. The ﬁ  rst  topic is machinability, which is concerned with how  work material properties affect machining perform- ance. The second topic is concerned with the tolerances  and surface ﬁ  nishes (Chapter 5) that can be expected  in machining processes. Third, the selection of cutting  conditions (speed, feed, and depth of cut) in a machin- ing operation is explored. This selection determines to  a large extent the economic success of a given opera- tion. Finally, some guidelines are provided for product  designers to consider when they design parts that are to  be produced by machining. "
    },
    {
        "type": "text",
        "text": " Machinability ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Properties of the work material have a signiﬁ  cant  inﬂ  uence on the success of the machining operation.  These properties and other characteristics of the work  are often summarized in the term “machinability.”  Machinability  denotes the relative ease with which  a material (usually a metal) can be machined using  appropriate tooling and cutting conditions. "
    },
    {
        "type": "text",
        "text": "There are various criteria used to evaluate machina- bility, the most important of which are (1) tool life,  (2) forces and power, (3) surface ﬁ  nish, and (4) ease  of chip disposal. Although machinability generally  refers to the work material, it should be recognized  that machining performance depends on more than  just material. The type of machining operation, tool- ing, and cutting conditions are also important factors.  In addition, the machinability criterion is a source of  variation. One material may yield a longer tool life  whereas another material provides a better surface ﬁ  nish. All of these factors  make evaluation of machinability difﬁ  cult. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Machinability testing usually involves a comparison of work materials. The  machining performance of a test material is measured relative to that of a base  (standard) material. Possible measures of performance in machinability testing  include (1) tool life, (2) tool wear, (3) cutting force, (4) power in the operation, (5)  cutting temperature, and (6) material removal rate under standard test conditions.  The relative performance is expressed as an index number, called the machinability  rating (MR). The base material used as the standard is given a machinability rating  of 1.00. B1112 steel is often used as the base material in machinability compari- sons. Materials that are easier to machine than the base have ratings greater than  1.00, and materials that are more difﬁ  cult to machine have ratings less than 1.00.  Machinability ratings are often expressed as percentages rather than index numbers.  The following example illustrates how a machinability rating might be determined  using a tool life test as the basis of comparison. "
    },
    {
        "type": "text",
        "text": "Example 23.1  Machinability ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A series of tool life tests are conducted on two work materials under identical  cutting conditions, varying only speed in the test procedure. The ﬁ  rst material,  deﬁ  ned as the base material, yields a Taylor Tool Life equation $\\nu T^{0.28}=350$ ,  and the other material (test material) yields a Taylor equation $\\nu T^{0.27}=440$ ,  where speed is in $\\mathrm{m/min}$  and tool life is in min. Determine the machinability  rating of the test material using the cutting speed that provides a 60-min tool  life as the basis of comparison. This speed is denoted by $\\nu_{60}$ . "
    },
    {
        "type": "text",
        "text": "Solution:  The base material has a machinability rating $=1.0$ . Its $\\nu_{60}$  value can  be determined from the Taylor Tool Life equation as follows: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\nu_{60}=(350/60^{0.28})=111\\;\\mathrm{m/min}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The cutting speed at a 60-min tool life for the test material is determined  similarly: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\nu_{60}=(440/60^{0.27})=146\\;\\mathrm{m/min}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Accordingly, the machinability rating can be calculated as "
    },
    {
        "type": "text",
        "text": "$M R({\\mathrm{for~the~test~model}})={\\frac{146}{111}}=1.31\\;({\\bf131\\%})$ "
    },
    {
        "type": "text",
        "text": "Many work material factors affect machining performance. Important mechani- cal properties include hardness and strength. As hardness increases, abrasive wear  of the tool increases so that tool life is reduced. Strength is usually indicated as  tensile strength, even though machining involves shear stresses. Of course, shear  strength and tensile strength are correlated. As work material strength increases,  cutting forces, speciﬁ  c energy, and cutting temperature increase, making the material  more difﬁ  cult to machine. On the other hand, very low hardness can be detrimental  to machining performance. For example, low carbon steel, which has relatively low  hardness, is often too ductile to machine well. High ductility causes tearing of the  metal as the chip is formed, resulting in poor ﬁ  nish, and problems with chip disposal.  Cold drawing is often used on low carbon bars to increase surface hardness and  promote chip-breaking during cutting. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "A metal’s chemistry has an important effect on properties; and in some cases,  chemistry affects the wear mechanisms that act on the tool material. Through these  relationships, chemistry affects machinability. Carbon content has a signiﬁ  cant effect  on the properties of steel. As carbon is increased, the strength and hardness of the  steel increases; this reduces machining performance. Many alloying elements added  to steel to enhance properties are detrimental to machinability. Chromium, molyb- denum, and tungsten form carbides in steel, which increase tool wear and reduce  machinability. Manganese and nickel add strength and toughness to steel, which  reduce machinability. Certain elements can be added to steel to improve machining  "
    },
    {
        "type": "table",
        "img_path": "images/fcfafb3cace51231f240729b20af53cb0961a236a672624b4cb77badda697810.jpg",
        "table_caption": "TABLE •  23.1  Approximate values of Brinell hardness and typical machinability ratings for selected work  materials. ",
        "table_footnote": "Values are estimated average values based on [1], [4], [5], [7], and other sources. Ratings represent relative cutting speeds for a given  tool life (see Example 23.1). a  Machinability ratings are often expressed as percents (index number $\\times\\;100\\%$ ). b The list of alloy steels is by no means complete. The table includes some of the more common alloys and indicates the range of  machinability ratings among these steels. c The machinability of aluminum varies widely. It is expressed here as $M R=5.00$ , but the range is probably from 3.00 to 10.00 or  more. d Aluminum alloys, brasses, and bronzes also vary signiﬁ  cantly in machining performance. Different grades have different  machinability ratings. For each case, we have attempted to reduce the variation to a single average value to indicate relative  performance with other work materials. "
    },
    {
        "type": "text",
        "text": "performance, such as lead, sulfur, and phosphorus. The additives have the effect of  reducing the coefﬁ  cient of friction between the tool and chip, thereby reducing forces,  temperature, and built-up edge formation. Better tool life and surface ﬁ  nish result  from these effects. Steel alloys formulated to improve machinability are referred to  as  free machining steels  (Section 6.2.3). "
    },
    {
        "type": "text",
        "text": "Similar relationships exist for other work materials. Table 23.1 lists selected  metals and their approximate machinability ratings. These ratings are intended to  summarize the machining performance of the materials. "
    },
    {
        "type": "text",
        "text": " Tolerances and Surface Finish ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Machining operations are used to produce parts with deﬁ  ned geometries to toler- ances and surface ﬁ  nishes speciﬁ  ed by the product designer. This section examines  these issues of tolerance and surface ﬁ  nish in machining. "
    },
    {
        "type": "text",
        "text": "23.2.1  TOLERANCES IN MACHINING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "There is variability in any manufacturing process, and tolerances are used to set per- missible limits on this variability (Section 5.1.1). Machining is often selected when  tolerances are close, because it is more accurate than most other shape-making proc- esses. Table 23.2 indicates typical tolerances that can be achieved for most machining  operations examined in Chapter 21. It should be mentioned that the values in this  tabulation represent ideal conditions, yet conditions that are readily achievable in  a modern factory. If the machine tool is old and worn, process variability will likely  "
    },
    {
        "type": "table",
        "img_path": "images/017b62b4f40da88df2abcfa42266b2e460dd11fa604ae017f0258676bf48842d.jpg",
        "table_caption": "TABLE •  23.2  Typical tolerances and surface roughness values (arithmetic average) achievable in  machining operations. ",
        "table_footnote": "\\* Drilling tolerances are typically expressed as biased bilateral tolerances (e.g., $+~0.010/-0.002)$ ). Values in this table are expressed as  closest bilateral tolerance (e.g., $_{-0.006)}$ . Compiled from various sources, including [2], [5], [7], [8], [12], and [15]. "
    },
    {
        "type": "text",
        "text": "be greater than the ideal, and these tolerances would be difﬁ  cult to maintain. On  the other hand, newer machine tools can achieve closer tolerances than those listed. "
    },
    {
        "type": "text",
        "text": "Tighter tolerances usually mean higher costs. For example, if the product designer  speciﬁ  es a tolerance of $\\pm0.10\\,\\mathrm{mm}$  on a hole diameter of $6.0\\,\\mathrm{mm}$ , this tolerance could  be achieved by a drilling operation, according to Table 23.2. However, if the designer  speciﬁ  es a tolerance of  $\\pm0.025\\;\\mathrm{mm}$ , then an additional reaming operation is needed  to satisfy this tighter requirement. This is not to suggest that looser tolerances are  always good. It often happens that closer tolerances and lower variability in the  machining of the individual components will lead to fewer problems in assembly,  ﬁ  nal product testing, ﬁ  eld service, and customer acceptance. Although these costs  are not always as easy to quantify as direct manufacturing costs, they can neverthe- less be signiﬁ  cant. Tighter tolerances that push a factory to achieve better control  over its manufacturing processes may lead to lower total operating costs for the  company over the long run. "
    },
    {
        "type": "text",
        "text": "23.2.2  SURFACE FINISH IN MACHINING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Because machining is often the manufacturing process that determines the ﬁ  nal  geometry and dimensions of the part, it is also the process that determines the part’s  surface texture (Section 5.3.2). Table 23.2 lists typical surface roughness values that  can be achieved in various machining operations. These ﬁ  nishes should be readily  achievable by modern, well-maintained machine tools. "
    },
    {
        "type": "text",
        "text": "The roughness of a machined surface depends on many factors that can be  grouped as follows: (1) geometric factors, (2) work material factors, and (3) vibra- tion and machine tool factors. The discussion of surface roughness in this section  examines these factors and their effects. "
    },
    {
        "type": "text",
        "text": "Geometric Factors  These are the machining parameters that determine the sur- face geometry of a machined part. They include (1) type of machining operation; (2)  cutting tool geometry, most importantly nose radius; and (3) feed. The surface geom- etry that would result from these factors is referred to as the “ideal” or “theoretical”  surface roughness, which is the ﬁ  nish that would be obtained in the absence of work  material, vibration, and machine tool factors. "
    },
    {
        "type": "text",
        "text": "Type of operation refers to the machining process used to generate the surface.  For example, peripheral milling, facing milling, and shaping all produce a ﬂ  at surface;  however, the surface geometry is different for each operation because of differences  in tool shape and the way the tool interacts with the surface. A sense of the differ- ences can be seen in Figure 5.14 showing various possible lays of a surface. "
    },
    {
        "type": "text",
        "text": "Tool geometry and feed combine to form the surface geometry. The shape of the  tool point is the important tool geometry factor. The effects can be seen for a single- point tool in Figure 23.1. With the same feed, a larger nose radius causes the feed marks  to be less pronounced, thus leading to a better ﬁ  nish. If two feeds are compared with  the same nose radius, the larger feed increases the separation between feed marks,  leading to an increase in the value of ideal surface roughness. If feed rate is large  enough and the nose radius is small enough so that the end cutting edge participates in  creating the new surface, then the end cutting-edge angle will affect surface geometry.  In this case, a higher ECEA will result in a higher surface roughness value. In theory,  a zero ECEA would yield a perfectly smooth surface; however, imperfections in the  tool, work material, and machining process preclude achieving such an ideal ﬁ  nish. "
    },
    {
        "type": "image",
        "img_path": "images/f07f79d843d7a23b6e63a8e033c8a846b2987863038d539f56570fccc1f8330b.jpg",
        "img_caption": "FIGURE 23.1  Effect of geometric factors in determining the theoretical ﬁ  nish on a work surface for single-point  tools: (a) effect of nose radius, (b) effect of feed, and (c) effect of end cutting-edge angle. "
    },
    {
        "type": "text",
        "text": "The effects of nose radius and feed can be combined in an equation to predict the  ideal average roughness for a surface produced by a single-point tool. The equation  applies to operations such as turning, shaping, and planing: "
    },
    {
        "type": "equation",
        "text": "\n$$\nR_{i}=\\frac{f^{2}}{32N R}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $R_{i}=$  theoretical arithmetic average surface roughness, mm (in); $f\\!=$  feed, mm  (in); and $N R=$  nose radius on the tool point, mm (in). The equation assumes that the  nose radius is not zero and that feed and nose radius will be the principal factors that  determine the geometry of the surface. The values for  $R_{i}$  will be in units of mm (in),  which can be converted to  $\\mu\\mathrm{m}$  ( $\\mu$ -in). Equation (23.1) can also be used to estimate  the ideal surface roughness in face milling with insert tooling, using $f$ to represent  the chip load (feed per tooth).  "
    },
    {
        "type": "text",
        "text": "Equation (23.1) assumes a sharp cutting tool. As the tool wears, the shape of  the cutting point changes, which is reﬂ  ected in the geometry of the work surface.  For slight amounts of wear, the effect is not noticeable. However, when tool wear  becomes signiﬁ  cant, especially nose radius wear, surface roughness deteriorates  compared with the ideal values given by Equation (23.1). "
    },
    {
        "type": "text",
        "text": "Work Material Factors  Achieving the ideal surface ﬁ  nish is not possible in most  machining operations because of factors related to the work material and its interac- tion with the tool. Work material factors that affect ﬁ  nish include (1) built-up edge  effects—as the BUE cyclically forms and breaks away, particles are deposited on the  newly created work surface, causing it to have a rough “sandpaper” texture; (2) dam- age to the surface caused by the chip curling back into the work; (3) tearing of the  work surface during chip formation when machining ductile materials; (4) cracks in  "
    },
    {
        "type": "image",
        "img_path": "images/2ec7307488f38464a14766c90fb8d81dac1dbde43e16ed322cc36e6de83b1d6a.jpg",
        "img_caption": "FIGURE 23.2  Ratio of  actual surface  roughness to ideal  surface roughness  for several classes of  materials.  (Source: General  Electric Co. data [14].) "
    },
    {
        "type": "text",
        "text": "the surface caused by discontinuous chip formation when machining brittle materi- als; and (5) friction between the tool ﬂ  ank and the newly generated work surface.  These work material factors are inﬂ  uenced by cutting speed and rake angle, such  that an increase in cutting speed or rake angle generally improves surface ﬁ  nish. "
    },
    {
        "type": "text",
        "text": "The work material factors usually cause the actual surface ﬁ  nish to be worse than  the ideal. An empirical ratio can be developed to convert the ideal roughness value  into an estimate of the actual surface roughness value. This ratio takes into account  BUE formation, tearing, and other factors. The value of the ratio depends on cutting  speed as well as work material. Figure 23.2 shows the ratio of actual to ideal surface  roughness as a function of speed for several classes of work material. "
    },
    {
        "type": "text",
        "text": "The procedure for predicting the actual surface roughness in a machining opera- tion is to compute the ideal surface roughness value and then multiply this value by  the ratio of actual to ideal roughness for the appropriate class of work material. This  can be summarized as "
    },
    {
        "type": "equation",
        "text": "\n$$\nR_{a}=r_{a i}R_{i}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $R_{a}=$  the estimated value of actual roughness;  $r_{a i}=$  ratio of actual to ideal  surface ﬁ  nish from Figure 23.2, and $R_{i}=$  ideal roughness value from Equation (23.1). "
    },
    {
        "type": "text",
        "text": "A turning operation is performed on C1008 steel (a ductile steel) using a tool  with a nose radius $=1.2\\:\\mathrm{mm}$ . Cutting speed $=100\\:\\mathrm{m/min}$  and feed $=0.25\\,\\mathrm{mm}/$ rev. Compute an estimate of the surface roughness in this operation. "
    },
    {
        "type": "image",
        "img_path": "images/12506c0e3b756bb550837ee3ccefc8d2f6dd44f544be4600bd4a4c3016f96868.jpg"
    },
    {
        "type": "text",
        "text": "Solution:  The ideal surface roughness can be calculated from Equation  (23.1): "
    },
    {
        "type": "equation",
        "text": "\n$$\nR_{i}=(0.25)^{2}/(32\\times1.2)=0.0016\\,\\mathrm{mm}=1.6\\,\\mu\\mathrm{m}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "From the chart in Figure 23.2, the ratio of actual to ideal roughness for ductile  metals at $100\\:\\mathrm{m/min}$  is approximately 1.25. Accordingly, the actual surface  roughness for the operation would be (approximately) "
    },
    {
        "type": "equation",
        "text": "\n$$\nR_{a}=1.25\\times1.6=2.0\\,\\mu\\mathrm{m}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Vibration and Machine Tool Factors   These factors are related to the machine  tool, tooling, and setup in the operation. They include chatter or vibration in the  machine tool or cutting tool; deﬂ  ections in the ﬁ  xturing, often resulting in vibra- tion; and backlash in the feed mechanism, particularly on older machine tools. If  these machine tool factors can be minimized or eliminated, the surface roughness  in machining will be determined primarily by geometric and work material factors  described above. "
    },
    {
        "type": "text",
        "text": "Chatter or vibration in a machining operation can result in pronounced waviness  in the work surface. When chatter occurs, a distinctive noise occurs that can be rec- ognized by any experienced machinist. Possible steps to reduce or eliminate vibra- tion include (1) adding stiffness and/or damping to the setup, (2) operating at speeds  that do not cause cyclical forces whose frequency approaches the natural frequency  of the machine tool system, (3) reducing feeds and depths to reduce forces in cut- ting, and (4) changing the cutter design to reduce forces. Workpiece geometry can  sometimes play a role in chatter. Thin cross sections tend to increase the likelihood  of chatter, requiring additional supports to alleviate the condition. "
    },
    {
        "type": "text",
        "text": " Selection of Cutting Conditions ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "One of the practical problems in machining is selecting the proper cutting conditions  for a given operation. This is one of the tasks in process planning (Section 39.1). For  each operation, decisions must be made about machine tool, cutting tool(s), and cutting  conditions. These decisions must give due consideration to work part machinability,  part geometry, surface ﬁ  nish, and so forth. "
    },
    {
        "type": "text",
        "text": "23.3.1  SELECTING FEED AND DEPTH OF CUT ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Cutting conditions in a machining operation consist of speed, feed, depth of cut,  and cutting ﬂ  uid (whether a cutting ﬂ  uid should be used and, if so, what type of cut- ting ﬂ  uid). Tooling considerations are usually the dominant factor in decisions about  cutting ﬂ  uids (Section 22.4). Depth of cut is often predetermined by workpiece  geometry and operation sequence. Many jobs require a series of roughing opera- tions followed by a ﬁ  nal ﬁ  nishing operation. In the roughing operations, depth is  made as large as possible within the limitations of available horsepower, machine  tool and setup rigidity, strength of the cutting tool, and so on. In the ﬁ  nishing cut,  depth is set to achieve the ﬁ  nal dimensions for the part. "
    },
    {
        "type": "text",
        "text": "The problem then reduces to selection of feed and speed. In general, values of these  parameters should be decided in the order:  feed ﬁ  rst ,  speed second .   Determining the  appropriate feed rate for a given machining operation depends on the following factors:\n\n "
    },
    {
        "type": "text",
        "text": "➢   Tooling . What type of tooling will be used? Harder tool materials (e.g., cemented  carbides, ceramics, etc.) tend to fracture more readily than high-speed steel.  These tools are normally used at lower feed rates. HSS can tolerate higher feeds  because of its greater toughness.\n\n $\\succcurlyeq$ Roughing or ﬁ  nishing . Roughing operations involve high feeds, typically 0.5 to  $1.25~\\mathrm{mm/rev}$   $(0.020{-}0.050\\ \\mathrm{in/rev})$ ) for turning; ﬁ  nishing operations involve low  feeds, typically 0.125 to $0.4\\,\\mathrm{mm/rev}$  (0.005–0.015 in/rev) for turning.\n\n $\\succcurlyeq$ Constraints on feed in roughing . If the operation is roughing, how high can the  feed rate be set? To maximize metal removal rate, feed should be set as high as  possible. Upper limits on feed are imposed by cutting forces, setup rigidity, and  sometimes horsepower.\n\n ➢   Surface ﬁ  nish requirements in ﬁ  nishing . If the operation is ﬁ  nishing, what is the  desired surface ﬁ  nish? Feed is an important factor in surface ﬁ  nish, and com- putations like those in Example 23.2 can be used to estimate the feed that will  produce a desired surface ﬁ  nish. "
    },
    {
        "type": "text",
        "text": "23.3.2  OPTIMIZING CUTTING SPEED ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Selection of cutting speed is based on making the best use of the cutting tool, which  normally means choosing a speed that provides a high metal removal rate yet suitably  long tool life. Mathematical formulas have been derived to determine optimal cutting  speed for a machining operation, given that the various time and cost components  of the operation are known. The original derivation of these  machining economics   equations is credited to W. Gilbert [10]. The formulas allow the optimal cutting speed  to be calculated for either of two objectives: (1) maximum production rate, or (2) min- imum unit cost. Both objectives seek to achieve a balance between material removal  rate and tool life. The formulas are based on a known Taylor Tool Life equation for  the tool used in the operation. Accordingly, feed, depth of cut, and work material have  already been set. The derivation will be illustrated for a turning operation. Similar  derivations can be developed for other types of machining operations [3]. "
    },
    {
        "type": "text",
        "text": "Maximizing Production Rate  For maximum production rate, the speed that min- imizes machining time per workpiece is determined. Minimizing cutting time per  unit is equivalent to maximizing production rate. This objective is important in cases  when the production order must be completed as quickly as possible. "
    },
    {
        "type": "text",
        "text": "In turning, there are three time elements that contribute to the total production  cycle time for one part:\n\n "
    },
    {
        "type": "text",
        "text": "1.  Part handling time $T_{h}$ . This is the time the operator spends loading the part into  the machine tool at the beginning of the production cycle and unloading the  part after machining is completed. Any additional time required to reposition  the tool for the start of the next cycle should also be included here.\n\n "
    },
    {
        "type": "text",
        "text": "2.  Machining time $T_{m}$ . This is the time the tool is actually engaged in cutting metal  during the cycle. "
    },
    {
        "type": "text",
        "text": "FIGURE 23.3  Time elements in a  machining cycle plotted  as a function of cutting  speed. Total cycle time  per piece is minimized  at a certain value of  cutting speed. This is  the speed for maximum  production rate. "
    },
    {
        "type": "image",
        "img_path": "images/339a70f7646f1a554a554746dc82c7ba0cd081116afb1fcdf6287d343d8d38a9.jpg"
    },
    {
        "type": "text",
        "text": "3.  Tool change time   $T_{t}.$ . At the end of the tool life, the tool must be changed, which  takes time. This time must be apportioned over the number of parts cut during  the tool life. Let  $n_{p}=$  the number of pieces cut in one tool life (the number of  pieces cut with one cutting edge until the tool is changed); thus, the tool change  time per part  $=T_{t}/n_{p}$ . "
    },
    {
        "type": "text",
        "text": "The sum of these three time elements gives the total time per unit product for the  operation cycle: "
    },
    {
        "type": "equation",
        "text": "\n$$\nT_{c}=T_{h}+T_{m}+{\\frac{T_{t}}{n_{p}}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $T_{c}=$  production cycle time per piece, min; and the other terms are deﬁ  ned above. "
    },
    {
        "type": "text",
        "text": "The cycle time  $T_{c}$  is a function of cutting speed. As cutting speed is increased,  $T_{m}$  decreases and  $T_{t}/n_{p}$  increases;  $T_{h}$  is unaffected by speed. These relationships are  shown in Figure 23.3. "
    },
    {
        "type": "text",
        "text": "The cycle time per part is minimized at a certain value of cutting speed. This  optimal speed can be identiﬁ  ed by recasting Equation (23.3) as a function of speed.  Machining time in a straight turning operation is given by previous Equation (21.5): "
    },
    {
        "type": "equation",
        "text": "\n$$\nT_{m}={\\frac{\\pi D L}{\\nu f}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $T_{m}\\,=$  machining time, min;  $D\\;=\\;$ work part diameter, mm (in);  $L\\,=\\,\\mathrm{work}$ part length, mm (in); $f\\!=$  feed, mm/rev (in/rev); and $\\nu=$ cutting speed,  $\\mathrm{mm/min}$  for  consistency of units  $(\\mathrm{in}/\\mathrm{min}$  for consistency of units). "
    },
    {
        "type": "text",
        "text": "The number of pieces per tool $n_{p}$  is also a function of speed. It can be shown that "
    },
    {
        "type": "equation",
        "text": "\n$$\nn_{p}={\\frac{T}{T_{m}}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $T=$  tool life, min/tool; and $T_{m}=$  machining time per part, $\\mathrm{{min/pc}}$ . Both  $T$ and  $T_{m}$  are functions of speed; hence, the ratio is a function of speed: "
    },
    {
        "type": "equation",
        "text": "\n$$\nn_{p}={\\frac{f C^{1/n}}{\\pi D L\\nu^{1/n-1}}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The effect of this relation is to cause the  $T_{t}/n_{p}$  term in Equation (23.3) to increase  as cutting speed increases. Substituting Equations (21.5) and (23.5) into Equation  (23.3) for  $T_{c}$ ,  "
    },
    {
        "type": "equation",
        "text": "\n$$\nT_{c}=T_{h}+\\frac{\\pi D L}{f\\nu}+\\frac{T_{t}(\\pi D L\\nu^{1/n-1})}{f C^{1/n}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The cycle time per piece is a minimum at the cutting speed at which the derivative  of Equation (23.6) is zero: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\frac{d T_{c}}{d\\nu}=0\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Solving this equation yields the cutting speed for maximum production rate in  the operation: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\nu_{\\mathrm{max}}={\\frac{C}{\\left[\\left({\\frac{1}{n}}-1\\right)T_{t}\\right]^{n}}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $\\nu_{\\mathrm{max}}$  is expressed in m/min (ft/min). The corresponding tool life for maximum  production rate is "
    },
    {
        "type": "equation",
        "text": "\n$$\nT_{\\mathrm{max}}=\\left({\\frac{1}{n}}-1\\right)T_{t}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Minimizing Cost per Unit   For minimum cost per unit, the speed that minimizes  production cost per piece for the operation is determined. To derive the equations  for this case, the four cost components that determine total cost of producing one  part during a turning operation are identiﬁ  ed:\n\n "
    },
    {
        "type": "text",
        "text": "1.  Cost of part handling time . This is the cost of the time the operator spends load- ing and unloading the part. Let  $C_{o}=$  the cost rate (e.g.,  $\\S/\\mathrm{min}$ ) for the operator  and machine. Thus the cost of part handling time $=C_{o}T_{h}$ .\n\n 2.  Cost of machining time . This is the cost of the time the tool is engaged in  machining. Using $C_{o}$  again to represent the cost per minute of the operator and  machine tool, the cutting time cos ${\\mathfrak{s t}}=C_{o}T_{m}$ .\n\n 3.  Cost of tool change time . The cost of tool change time  $=C_{o}T_{t}/n_{p}$ .\n\n 4.  Tooling cost . In addition to the tool change time, the tool itself has a cost that  must be added to the total operation cost. This cost is the cost per cutting edge  $C_{t},$  divided by the number of pieces machined with that cutting edge  $n_{p}$ . Thus,  tool cost per workpiece is given by  $C_{t}/n_{p}$ . "
    },
    {
        "type": "text",
        "text": "Tooling cost requires an explanation, because it is affected by different tooling situa- tions. For disposable inserts (e.g., cemented carbide inserts), tool cost is determined as "
    },
    {
        "type": "equation",
        "text": "\n$$\nC_{t}=\\frac{P_{t}}{n_{e}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $C_{t}=$  cost per cutting edge,  $\\S/\\mathrm{tcol}$  life;  $P_{t}=$  price of the insert,  $\\S/$ insert; and  $n_{e}=$   number of cutting edges per insert. This depends on the insert type; for example, trian- gular inserts that can be used only one side (positive rake tooling) have three edges/ insert; if both sides of the insert can be used (negative rake tooling), there are six edges/ insert; and so forth. "
    },
    {
        "type": "text",
        "text": "For regrindable tooling (e.g., high-speed steel solid shank tools, brazed carbide  tools), the tool cost includes purchase price plus cost to regrind: "
    },
    {
        "type": "equation",
        "text": "\n$$\nC_{t}=\\frac{P_{t}}{n_{g}}+\\,T_{g}C_{g}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $C_{t}=$  cost per tool life, $\\S/$ tool life; $P_{t}=$  purchase price of the solid shank tool or  brazed insert, $\\mathbb{S}/\\mathrm{cool};n_{g}=$  number of tool lives per tool, which is the number of times  the tool can be ground before it can no longer be used (5–10 times for roughing tools  and 10–20 times for ﬁ  nishing tools);  $T_{g}=$  time to grind or regrind the tool, min/tool  life; and  $C_{g}=$  grinder’s rate, $\\S/\\mathrm{min}$ . "
    },
    {
        "type": "text",
        "text": "The sum of the four cost components gives the total cost per unit product  $C_{c}$  for  the machining cycle: "
    },
    {
        "type": "equation",
        "text": "\n$$\nC_{c}=C_{o}T_{h}+C_{o}T_{m}+\\frac{C_{o}T_{t}}{n_{p}}+\\frac{C_{t}}{n_{p}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "$C_{c}$  is a function of cutting speed, just as $T_{c}$  is a function of  $\\nu$ . The relationships for the  individual terms and total cost as a function of cutting speed are shown in Figure 23.4.  Equation (23.11) can be rewritten in terms of  $\\nu$  to yield: "
    },
    {
        "type": "equation",
        "text": "\n$$\nC_{c}=C_{o}T_{h}+\\frac{C_{o}\\pi D L}{f\\nu}+\\frac{(C_{o}T_{t}+C_{t})(\\pi D L\\nu^{1/n-1})}{f C^{1/n}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The cutting speed that obtains minimum cost per piece for the operation can be  determined by taking the derivative of Equation (23.12) with respect to  $\\nu$ , setting it  to zero, and solving for $\\nu_{\\mathrm{min}}$ : "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\nu_{\\mathrm{min}}=C\\bigg(\\frac{n}{1-n}\\cdot\\frac{C_{o}}{C_{o}T_{t}+C_{t}}\\bigg)^{n}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "image",
        "img_path": "images/6301c0053abc914fb3857b2e9af460824515f83523e28bb6c06845545459f098.jpg",
        "img_caption": ""
    },
    {
        "type": "text",
        "text": "The corresponding tool life is given by "
    },
    {
        "type": "equation",
        "text": "\n$$\nT_{\\mathrm{min}}=\\left(\\frac{1}{n}-1\\right)\\left(\\frac{C_{o}T_{t}+C_{t}}{C_{o}}\\right)\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Example 23.3  Determining  cutting speeds  in machining  economics "
    },
    {
        "type": "text",
        "text": "Suppose a turning operation is to be performed with HSS tooling on mild  steel, with Taylor tool life parameters  $n=0.125$ ,  $C=70\\:\\mathrm{m/min}$  (Table 23.2).  Work part length $=500\\:\\mathrm{mm}$  and diameter $=100\\:\\mathrm{mm}$ . Feed $=0.25\\;\\mathrm{mm/rev}.$   Handling time per piece $=5.0$  min, and tool change time $=2.0$  min. Cost of  machine and operator  $=\\S30/\\mathrm{hr}$ , and tooling cost $=\\S3$  per cutting edge. Find:  (a) cutting speed for maximum production rate, and (b) cutting speed for  minimum cost. "
    },
    {
        "type": "text",
        "text": "Solution:   (a) Cutting speed for maximum production rate is given by  Equation (23.7): "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\nu_{\\mathrm{max}}=70\\,\\bigg(\\frac{0.125}{0.875}\\cdot\\frac{1}{2}\\bigg)^{0.125}=50\\;\\mathrm{m/min}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "(b) Converting $C_{o}=\\S30/\\mathrm{hr}$  to  $\\S0.50/\\mathrm{min}$ , minimum cost cutting speed is given  by Equation (23.13): "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\nu_{\\mathrm{min}}=70\\,\\bigg(\\frac{0.125}{0.875}\\cdot\\frac{0.50}{0.5(2)+3.00}\\bigg)^{0.125}=42\\:\\mathrm{m/min}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Example 23.4  Production  rate and cost  in machining  economics "
    },
    {
        "type": "text",
        "text": "Determine the hourly production rate and cost per piece for the two cutting  speeds computed in Example 23.3. "
    },
    {
        "type": "text",
        "text": "Solution:   (a) For the cutting speed for maximum production,  $\\nu_{\\mathrm{max}}=50\\:\\mathrm{m/min}$ ,  machining time per piece and tool life are calculated as follows: "
    },
    {
        "type": "equation",
        "text": "\n$$\n{\\mathrm{Machinites~time~}}T_{m}={\\frac{\\pi(0.5)(0.1)}{(0.25)(10^{-3})(50)}}=12.57\\ {\\mathrm{min/pc}}\n$$\n \n$$\n{\\mathrm{Tcool~life~}}T=\\left({\\frac{70}{50}}\\right)^{8}=14.76~{\\mathrm{min/cuting~edge}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The number of pieces per tool $n_{p}=14.76/12.57=1.17$ . Use $n_{p}=1$ . From  Equation (23.3), average production cycle time for the operation is "
    },
    {
        "type": "equation",
        "text": "\n$$\nT_{c}=5.0+12.57+2.0/1=19.57\\,\\mathrm{min/pc}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Corresponding hourly production rate $R_{p}=60/19.57=3.1\\,\\mathrm{pc/hr}$ . From  Equation (23.11), average cost per piece for the operation is "
    },
    {
        "type": "equation",
        "text": "\n$$\nC_{c}=0.50(5.0)+0.50(12.57)+0.50(2.0)/1+3.00/1=\\S\\mathbf{12.7}9/\\mathbf{pc}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "table",
        "img_path": "images/92c9513fb3d7c98235c92f4c4dc35728f60b3c59a4939f03f1b2c054db387e4f.jpg"
    },
    {
        "type": "text",
        "text": "(b) For the cutting speed for minimum production cost per piece,  $\\nu_{\\mathrm{min}}=42\\:\\mathrm{m/min}$ ,  the machining time per piece and tool life are calculated as follows: "
    },
    {
        "type": "equation",
        "text": "\n$$\n{\\mathrm{Machinites~time~}}T_{m}={\\frac{\\pi(0.5)(0.1)}{(0.25)(10^{-3})(42)}}=14.96\\ {\\mathrm{min/pc}}\n$$\n \n$$\n{\\mathrm{Tcool~life~}}T=\\left({\\frac{70}{42}}\\right)^{8}=59.54\\;{\\mathrm{min/cuting~edge}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The number of pieces per tool $n_{p}=59.54/14.96=3.98\\to\\mathrm{Case\\}n_{p}=3$  to avoid  failure during the fourth workpiece. Average production cycle time for the  operation is "
    },
    {
        "type": "equation",
        "text": "\n$$\nT_{c}=5.0+14.96+2.0/3=20.63\\,\\mathrm{min/pc}.\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Corresponding hourly production rate $R_{p}=60/20.63=2.9\\,\\mathrm{p}$ c/hr . Average cost  per piece for the operation is "
    },
    {
        "type": "equation",
        "text": "\n$$\nC_{c}=0.50(5.0)+0.50(14.96)+0.50(2.0)/3+3.00/3=\\S\\mathbf{11.32/pc}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Note that production rate is greater for $\\nu_{\\mathrm{max}}$  and cost per piece is minimum for $\\nu_{\\mathrm{min}}$ . "
    },
    {
        "type": "text",
        "text": "Some Comments on Machining Economics   Some practical observations can  be made relative to these optimum cutting speed equations. First, as the values of  $C$ and $n$  increase in the Taylor tool life equation, the optimum cutting speed increases  by either Equation (23.7) or Equation (23.13). Cemented carbides and ceramic cut- ting tools should be used at speeds that are signiﬁ  cantly higher than for high-speed  steel tools. "
    },
    {
        "type": "text",
        "text": "Second, as the tool change time and/or tooling cost ( $T_{t}$  and  $C_{t}$ ) increase, the cut- ting speed equations yield lower values. Lower speeds allow the tools to last longer,  and it is wasteful to change tools too frequently if either the cost of tools or the time  to change them is high. An important effect of this tool cost factor is that disposable  inserts usually possess a substantial economic advantage over regrindable tooling.  Even though the cost per insert is signiﬁ  cant, the number of edges per insert is large  enough and the time required to change the cutting edge is low enough that disposable  tooling generally achieves higher production rates and lower costs per unit product. "
    },
    {
        "type": "text",
        "text": "Third, $\\nu_{\\mathrm{max}}$  is always greater than $\\nu_{\\mathrm{min}}$ . The  $C_{t}/n_{p}$  term in Equation (23.13) has the  effect of pushing the optimum speed value to the left in Figure 23.4, resulting in a  lower value than in Figure 23.3. Rather than taking the risk of cutting at a speed above  $\\nu_{\\mathrm{max}}$  or below $\\nu_{\\mathrm{min}}$ , some machine shops strive to operate in the interval between $\\nu_{\\mathrm{min}}$ and $\\nu_{\\mathrm{max}}\\mathrm{-}\\mathrm{an}$  interval sometimes referred to as the “high-efﬁ  ciency range.” "
    },
    {
        "type": "text",
        "text": "The procedures outlined for selecting feeds and speeds in machining are often  difﬁ  cult to apply in practice. The best feed rate is difﬁ  cult to determine because  the relationships between feed and surface ﬁ  nish, force, horsepower, and other con- straints are not readily available for each machine tool. Experience, judgment, and  experimentation are required to select the proper feed. The optimum cutting speed  is difﬁ  cult to calculate because the Taylor equation parameters  $C$  and $n$  are not usu- ally known without prior testing. Testing of this kind in a production environment  is expensive. "
    },
    {
        "type": "text",
        "text": " Product Design Considerations in Machining ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Several important aspects of product design have already been considered in the  discussion of tolerance and surface ﬁ  nish (Section 23.2). In this section, some  design guidelines for machining are presented, compiled from sources [1], [5],  and [15]:\n\n "
    },
    {
        "type": "text",
        "text": "$\\succcurlyeq$ If possible, parts should be designed that do not need machining. If this is  not possible, then minimize the amount of machining required on the parts.  In general, a lower-cost product is achieved through the use of net shape  processes such as precision casting, closed die forging, or (plastic) molding;  or near net shape processes such as impression die forging. Reasons why  machining may be required include close tolerances; good surface ﬁ  nish;  and special geometric features such as threads, precision holes, cylindrical  sections with high degree of roundness, and similar shapes that cannot be \n\n "
    },
    {
        "type": "text",
        "text": "➢   Tolerances should be speciﬁ  ed to satisfy functional requirements, but process  capabilities should also be considered. See Table 23.2 for tolerance capabilities in  machining. Excessively close tolerances add cost but may not add value to the part.  As tolerances become tighter (smaller), product costs generally increase because  of additional processing, ﬁ  xturing, inspection, sortation, rework, and scrap.\n\n ➢   Surface ﬁ  nish should be speciﬁ  ed to meet functional and/or aesthetic require- ments, but better ﬁ  nishes generally increase processing costs by requiring addi- tional operations such as grinding or lapping.\n\n $\\succcurlyeq$ Machined features such as sharp corners, edges, and points should be avoided;  they are often difﬁ  cult to accomplish by machining. Sharp internal corners  require pointed cutting tools that tend to break during machining. Sharp external  corners and edges tend to create burrs and are dangerous to handle.\n\n ➢   Deep holes that must be bored should be avoided. Deep hole boring requires  a long boring bar. Boring bars must be stiff, and this often requires use of high  modulus materials such as cemented carbide, which is expensive.\n\n ➢   Machined parts should be designed so they can be produced from standard  available stock. Choose exterior dimensions equal to or close to the standard  stock size to minimize machining; for example, rotational parts with outside  diameters that are equal to standard bar stock diameters.\n\n ➢   Parts should be designed to be rigid enough to withstand forces of cutting and  workholder clamping. Machining of long narrow parts, large ﬂ  at parts, parts with  thin walls, and similar shapes should be avoided if possible.\n\n $\\succcurlyeq$ Undercuts as in Figure 23.5 should be avoided because they often require  additional setups and operations and/or special tooling; they can also lead to  stress concentrations in service.\n\n $\\succcurlyeq$ Materials with good machinability should be selected by the designer  (Section 23.1). As a rough guide, the machinability rating of a material cor- relates with the allowable cutting speed and production rate that can be used.  Thus, parts made of materials with low machinability cost more to produce.  Parts that are hardened by heat treatment must usually be ﬁ  nish ground or  machined with higher cost tools after hardening to achieve ﬁ  nal size and  tolerance. "
    },
    {
        "type": "image",
        "img_path": "images/ea2a4d55469d5180da40635bd3dab1d22ba4cb26dc3b49ee9fe2cb134c5ddbc2.jpg"
    },
    {
        "type": "text",
        "text": "$\\gg$ Machined parts should be designed with features that can be produced in a mini- mum number of setups—one setup if possible. This usually means geometric  features that can be accessed from one side of the part (see Figure 23.6). $\\gg$ Machined parts should be designed with features that can be achieved with  standard cutting tools. This means avoiding unusual hole sizes, threads, and fea- tures with unusual shapes requiring special form tools. In addition, it is help- ful to design parts such that the number of individual cutting tools needed in  machining is minimized; this often allows the part to be completed in one setup  on a machine such as a machining center (Section 21.5). "
    },
    {
        "type": "text",
        "text": "References ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": " [1] Bakerjian, R. (ed.).  Tool and Manufacturing  Engineers Handbook .   4th ed. Vol VI,  Design  for Manu fact ur ability . Society of Manufactur- ing Engineers, Dearborn, Mich., 1992.\n\n  [2] Black, J, and Kohser, R.  DeGarmo’s Materials  and Processes in Manufacturing , 11th ed., John  Wiley & Sons, Hoboken, New Jersey, 2012.\n\n  [3] Boothroyd, G., and Knight, W. A.  Fundamen- tals of Metal Machining and Machine Tools ,  3rd ed. CRC Taylor & Francis, Boca Raton,  Florida, 2006. "
    },
    {
        "type": "text",
        "text": " [4] Boston, O. W.  Metal Processing , 2nd ed. John  Wiley & Sons, New York, 1951.\n\n  [5] Bralla, J. G. (ed.).  Design for Manu fact ur ability  Handbook , 2nd ed. McGraw-Hill, New York, 1998.\n\n  [6] Brierley, R. G., and Siekman, H. J.  Machining  Principles and Cost Control . McGraw-Hill,  New York, 1964.\n\n  [7] Drozda, T. J., and Wick, C. (eds.).  Tool and  Manufac  turing Engineers Handbook . 4th ed.  Vol I,  Machining . Society of Manufacturing  Engineers, Dearborn, Michigan, 1983. "
    }
]