[
    {
        "type": "text",
        "text": "Microfabrication  Technologies ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "CHAPTER CONTENTS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "35.1  Microsystem Products ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "35.1.1 Types of Microsystem Devices\n\n 35.1.2 Microsystem Applications\n\n "
    },
    {
        "type": "text",
        "text": "35.2  Microfabrication Processes ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "35.2.1 Silicon Layer Processes\n\n 35.2.2 LIGA Process\n\n 35.2.3 Other Microfabrication Processes An important trend in engineering design and manufac- turing is the growth in the number of products and/or  components of products whose features sizes are meas- ured in microns  $(1\\ \\mu\\mathrm{m}\\,=\\,10^{-3}\\ \\mathrm{mm}\\,=\\,10^{-6}\\ \\mathrm{m})$ ). Several  terms have been applied to these miniaturized items.  The term  micro electromechanical systems  (MEMS)  emphasizes the miniaturization of systems consisting of  both electronic and mechanical components. The word  micromachines  is sometimes used for these devices.  Microsystem technology  (MST) is a more general term  that refers to the products (not necessarily limited to  electromechanical products) as well as the fabrication  technologies to produce them. A related term is  nanote- chnology , which refers to even smaller products whose  dimensions are measured in nanometers ( $(1\\ \\mathrm{nm}=10^{-3}$ $\\mu\\mathrm{m}\\,=\\,10^{-9}\\mathrm{~m}$ ). Figure 35.1 indicates the relative sizes  and other factors associated with these terms. Microfab- rication techniques are discussed in the current chapter  and nanofabrication in Chapter 36. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Microsystem Products ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Designing products that are smaller and comprised  of even smaller parts and subassemblies means less  material usage, lower power requirements, greater  functionality per unit space, and accessibility to regions  that are forbidden to larger products. In most cases,  smaller products should mean lower prices because  less material is used; however, the price of a given  product is inﬂ  uenced by the costs of research, devel- opment, and production, and how these costs can be  spread over the number of units sold. The economies  of scale that result in lower-priced products have not  yet fully been realized in microsystems technology,  except for a limited number of cases that are examined  in this section. "
    },
    {
        "type": "table",
        "img_path": "images/851aed3885a21d5d92dcf079a16385ffcb9b51a191f9b13f1e31010d740305fd.jpg",
        "table_footnote": "Key: $\\mathsf{n m}=$  nanometer, $\\mu{\\mathsf{m}}=$ micron or micrometer, mm $=$  millimeter, $\\mathsf{m}=$  meter "
    },
    {
        "type": "text",
        "text": "FIGURE 35.1  Terminology and relative sizes for microsystems and related technologies. "
    },
    {
        "type": "text",
        "text": "35.1.1  TYPES OF MICROSYSTEM DEVICES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Microsystem products can be classiﬁ  ed by type of device (e.g., sensor, actuator)  or by application area (e.g., medical, automotive). The device categories are as  follows [1]: "
    },
    {
        "type": "text",
        "text": "➢   Microsensors . A sensor is a device that detects or measures some physical phe- nomenon such as heat or pressure. It includes a transducer that converts one  form of physical variable into another form (e.g., a piezoelectric device converts  mechanical force into electrical current) plus the physical packaging and exter- nal connections. Most microsensors are fabricated on a silicon substrate using the  same processing technologies as those used for integrated circuits (Chapter 33).  Microscopic-sized sensors have been developed for measuring force, pressure,  position, speed, acceleration, temperature, ﬂ  ow, and a variety of optical, chemical,  environmental, and biological variables. The term  hybrid microsensor  is often used  when the sensing element (transducer) is combined with electronic components in  the same device.  "
    },
    {
        "type": "text",
        "text": "$\\gg$   Microactuators . Like a sensor, an actuator converts a physical variable of  one type into another type, but the converted variable usually involves some  mechanical action (e.g., a piezoelectric device oscillating in response to an alter- nating electrical ﬁ  eld). An actuator causes a change in position or the applica- tion of force. Examples of microactuators include valves, positioners, switches,  pumps, and rotational and linear motors [1]. Figure 35.2 shows a microscopic  ratchet mechanism fabricated of silicon. ➢   Microstructures and microcomponents . These terms are used to denote a  microsized part that is not a sensor or actuator. Examples of microstructures  and microcomponents include microscopic gears, lenses, mirrors, nozzles, and  beams. These items must be combined with other components (microscopic or  otherwise) to provide a useful function. Figure 35.3 shows a microscopic gear  alongside a human hair for comparison. $\\gg$   Microsystems and micro-instruments . These terms denote the integration of  several of the preceding components together with the appropriate electronics  "
    },
    {
        "type": "image",
        "img_path": "images/9fa3eca7fe67356126b8891138b5fcd10e40737dfa88bf0d06fbbcfec4c22fd2.jpg",
        "img_caption": "FIGURE 35.2  Microscopic ratchet  mechanism  fabricated of silicon  (Photo courtesy of Paul  McWhorter). "
    },
    {
        "type": "image",
        "img_path": "images/37317af35aa6eb0002d083c36c9237efe432f937f5ceef273dcca207e17f7507.jpg",
        "img_caption": "FIGURE 35.3  A microscopic gear  and a human hair. The  image was made using  a scanning electron  microscope. The gear is  high-density  polyethylene molded by  a process similar to the  LIGA process (Section  35.2.2) except that the  mold cavity was  fabricated using a  focused ion beam.  (Photo courtesy of  M. Ali, International  Islamic University  Malaysia.) "
    },
    {
        "type": "text",
        "text": "package into a miniature system or instrument. Microsystems and micro-instru- ments tend to be very application speciﬁ  c; for example, microlasers, optical  chemical analyzers, and micro spectrometers. The economics of manufacturing  these kinds of systems have tended to make commercialization difﬁ  cult. "
    },
    {
        "type": "text",
        "text": "35.1.2  MICROSYSTEM APPLICATIONS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The preceding microdevices and systems have been applied in a wide variety of  ﬁ  elds. There are many problem areas that can be approached best using very small  devices. Some important examples are the following: "
    },
    {
        "type": "text",
        "text": "Ink-Jet Printing Heads  This is currently one of the largest applications of MST,  because a typical ink-jet printer uses up several cartridges each year. The operation  of an ink-jet printing head is depicted in Figure 35.4. An array of resistance heat- ing elements is located above a corresponding array of nozzles. Ink is supplied by a  reservoir and ﬂ  ows between the heaters and nozzles. Each heating element can be  independently activated under microprocessor control in microseconds. When acti- vated by a pulse of current, the liquid ink immediately beneath the heater boils to  form a vapor bubble, forcing ink to be expelled through the nozzle opening. The ink  hits the paper and dries almost immediately to form a dot that is part of an alpha- numeric character or other image. Meanwhile, the vapor bubble collapses, drawing  more ink from the reservoir to replenish the supply. Today’s ink-jet printers possess  resolutions of 1200 dots per inch (dpi), which converts to a nozzle separation of only  about $21\\;\\mu\\mathrm{m}$ , certainly in the microsystem range. "
    },
    {
        "type": "text",
        "text": "Thin-Film Magnetic Heads  Read-write heads are key components in magnetic  storage devices. These heads were previously manufactured from horseshoe mag- nets that were manually wound with insulated copper wire. Because the reading  and writing of magnetic media with higher-bit densities are limited by the size of the  read-write head, hand-wound horseshoe magnets were a limitation on the techno- logical trend toward greater storage densities. Development of thin-ﬁ  lm magnetic  heads at IBM Corporation was an important breakthrough in digital storage tech- nology as well as a signiﬁ  cant success story for microfabrication technologies. Thin- ﬁ  lm read-write heads are produced annually in hundreds of millions of units, with a  market of several billions of dollars per year. "
    },
    {
        "type": "text",
        "text": "A simpliﬁ  ed sketch of the read-write head is presented in Figure 35.5, showing its  MST parts. The copper conductor coils are fabricated by electroplating copper through  "
    },
    {
        "type": "image",
        "img_path": "images/bcbbe345838fce6ffd1bd3b38b3e70cb4ed683dd13af0f169c107cbed232bacc.jpg",
        "img_caption": "FIGURE 35.4  Diagram  of an ink-jet printing  head. "
    },
    {
        "type": "image",
        "img_path": "images/47ec315714f61ca2aa2cc82f01994aaad4538513422c3b2cbcd8e978b3a0356d.jpg",
        "img_caption": "FIGURE 35.5  Thin-ﬁ  lm magnetic  read-write head (simpliﬁ  ed). "
    },
    {
        "type": "text",
        "text": "a resist mold. The cross section of the coil is about 2 to $3\\;\\mu\\mathrm{m}$  on a side. The thin-ﬁ  lm  cover, only a few $\\mu\\mathrm{m}$  thick, is made of nickel–iron alloy. The miniature size of the read- write head has permitted the signiﬁ  cant increases in bit densities of magnetic storage  media. The small sizes are made possible by microfabrication technologies. "
    },
    {
        "type": "text",
        "text": "Compact Discs  Compact discs (CDs) and digital versatile discs (DVDs) 1  are  important commercial products today, as storage media for audio, video, games, and  computer software and data applications. A CD disk is molded of polycarbonate  (Section 8.2.2), which has ideal optical and mechanical properties for the applica- tion. The disk is $120\\,\\mathrm{mm}$  in diameter and $1.2\\,\\mathrm{mm}$  thick. The data consists of small pits  (depressions) in a helical track that begins at a diameter of $46\\,\\mathrm{mm}$  and ends at about  $117\\,\\mathrm{mm}$ . The tracks in the spiral are separated by about $1.6\\,\\mu\\mathrm{m}$ . Each pit in the track  is about  $0.5\\;\\mu\\mathrm{{m}}$  wide and about $0.8\\;\\mu\\mathrm{m}$  to $3.5\\ \\mu\\mathrm{m}$  long. These dimensions certainly  qualify CDs as products of microsystem technology. The corresponding dimensions  of DVDs are even smaller, permitting much higher data storage capacities. "
    },
    {
        "type": "text",
        "text": "Although most of the microfabrication processes are discussed in Section 35.2, the  production sequence for CDs is brieﬂ  y described here, because it is rather unique and  uses several processes that are quite conventional. As consumer products, music CDs  are mass-produced by plastic injection molding (Section 13.6). To make the mold,  a master is created from a smooth, thin layer of positive photoresist coated onto a  $300{\\mathrm{-mm}}$  diameter glass plate. A modulated laser beam writes the data onto the pho- toresist by exposing microscopic regions on the surface as the plate is rotated and  moved slowly and precisely to create the spiral track. When the photoresist is devel- oped, the exposed regions are removed. These regions in the master will correspond  to the pits in the CD. A thin layer of nickel is then deposited onto the surface of the  master by sputtering (Section 27.5.1). Electroforming (Section 27.3.2) is then used to  build up the thickness of the nickel (to several mm), thus creating a negative impres- sion of the master. This is called the “father.” Several impressions are made of the  father by the same electroforming process, in effect creating a negative impression  of the father, whose surface geometry is identical to the original glass plate master.  These impressions are called “mothers.” Finally, the mothers are used to create the  actual mold impressions (called “stampers”), again by electroforming, and these are  used to mass-produce the CDs.  The process sequence is similar for DVDs but more  involved because of the smaller scale and different data format requirements. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Once molded, the pitted side of the polycarbonate disk is coated with aluminum  by sputtering to create a mirror surface. To protect this layer, a thin polymer coating  (e.g., acrylic) is deposited onto the metal. Thus, the ﬁ  nal compact disk is a sandwich  with a relatively thick polycarbonate substrate on one side, a thin polymer layer on  the other side, and in between a very thin layer of aluminum. In subsequent opera- tion, the laser beam of a CD player (or other data reader) is directed through the  polycarbonate substrate onto the reﬂ  ective surface, and the reﬂ  ected beam is inter- preted as a sequence of binary digits. "
    },
    {
        "type": "text",
        "text": "Automotive  Microsensors and other microdevices are widely used in modern  automotive products. Use of these microsystems is consistent with the increased  application of on-board electronics to accomplish control and safety functions for  the vehicle. The functions include electronic engine control, cruise control, anti-lock  braking systems, air-bag deployment, automatic transmission control, power steer- ing, all-wheel drive, automatic stability control, on-board navigation systems, and  remote locking and unlocking, not to mention air conditioning and radio. These con- trol systems and safety features require sensors and actuators, and a growing number  of these are microscopic in size. There are currently 20 to 100 sensors installed in a  modern automobile, depending on make and model. In 1970 there were virtually no  on-board sensors. Some speciﬁ  c on-board microsensors are listed in Table 35.1. "
    },
    {
        "type": "text",
        "text": "Medical  Opportunities for using microsystems technology in this area are tremen- dous. Indeed, signiﬁ  cant strides have already been made, and many of the traditional  medical and surgical methods have already been transformed by MST. One of the driv- ing forces behind the use of microscopic devices is the principle of minimal-invasive  therapy, which involves the use of very small incisions or even available body oriﬁ  ces  to access the medical problem of concern. Advantages of this approach over the use  of relatively large surgical incisions include less patient discomfort, quicker recovery,  fewer and smaller scars, shorter hospital stays, and lower health insurance costs. "
    },
    {
        "type": "text",
        "text": "Among the techniques based on miniaturization of medical instrumentation is  the ﬁ  eld of endoscopy,  now routinely used for diagnostic purposes and with growing  applications in surgery. It is standard medical practice today to use endoscopic exami- nation accompanied by laparoscopic surgery for hernia repair and removal of organs  such as gall bladder and appendix. Growing use of similar procedures is expected in  brain surgery, operating through one or more small holes drilled through the skull. "
    },
    {
        "type": "text",
        "text": "Other applications of MST in the medical ﬁ  eld now include or are expected to  include (1) angioplasty, in which damaged blood vessels and arteries are repaired  "
    },
    {
        "type": "table",
        "img_path": "images/a8233dfb799e58daa9ab507a74ae20cbcb87eb15e8bb22eb3721e74d562719a6.jpg",
        "table_caption": "TABLE  •  35.1  Microsensors installed in a modern automobile. ",
        "table_footnote": "Compiled from [1] and [5]. "
    },
    {
        "type": "text",
        "text": "using surgery, lasers, or miniaturized inﬂ  atable balloons at the end of a catheter that  is inserted into the vein; (2) tele microsurgery, in which a surgical operation is per- formed remotely using a stereo microscope and microscopic surgical tools; (3) arti- ﬁ  cial prostheses, such as heart pacemakers and hearing aids; (4) implantable sensor  systems to monitor physical variables in the human body such as blood pressure and  temperature; (5) drug delivery devices that can be swallowed by a patient and then  activated by remote control at the exact location intended for treatment, such as the  intestine, and (6) artiﬁ  cial eyes. "
    },
    {
        "type": "text",
        "text": "Chemical and Environmental  A principal role of microsystem technology in  chemical and environmental applications is the analysis of substances to measure  trace amounts of chemicals or detect harmful contaminants. A variety of chemical  microsensors have been developed. They are capable of analyzing very small sam- ples of the substance of interest. Micropumps are sometimes integrated into these  systems so that the proper amounts of the substance can be delivered to the sensor  component. "
    },
    {
        "type": "text",
        "text": "Other Applications  There are many other applications of microsystem technol- ogy beyond those described above. Some examples are in the following: "
    },
    {
        "type": "text",
        "text": "➢   Scanning probe microscope . This is a technology for measuring microscopic  details of surfaces, allowing surface structures to be examined at the nanometer  level. To operate in this dimensional range, the instruments require probes that  are only a few microns in length and that scan the surface at a distance measured  in nanometers. These probes are produced using microfabrication techniques. "
    },
    {
        "type": "text",
        "text": "➢   Biotechnology . In biotechnology, the specimens of interest are often microscopic  in size. To study these specimens, manipulators and other tools are needed that  are of the same size scale. Microdevices are being developed for holding, mov- ing, sorting, dissecting, and injecting the small samples of biomaterials under a  microscope.\n\n ➢   Electronics . Printed circuit board (PCB) and connector technologies are dis- cussed in Chapter 34, but they should also be cited here in the context of MST.  Miniaturization trends in electronics have forced PCBs, contacts, and connec- tors to be fabricated with smaller and more complex physical details, and with  mechanical structures that are more consistent with the microdevices discussed  in this chapter than with the integrated circuits discussed in Chapter 33. "
    },
    {
        "type": "text",
        "text": " Microfabrication Processes ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Many of the products in microsystem technology are based on silicon, and most of the  processing techniques used in the fabrication of microsystems are borrowed from the  microelectronics industry. There are several important reasons why silicon is a desir- able material in MST: (1) The microdevices in MST often include electronic circuits,  so both the circuit and the microdevice can be fabricated in combination on the same  substrate. (2) In addition to its desirable electronic properties, silicon also possesses  useful mechanical properties, such as high strength and elasticity, good hardness, and  relatively low density.  (3) The technologies for processing silicon are well- established,  owing to their widespread use in microelectronics. (4) Use of single-crystal silicon  permits the production of physical features to very close tolerances. "
    },
    {
        "type": "text",
        "text": "Microsystem technology often requires silicon to be fabricated along with other  materials to obtain a particular microdevice. For example, microactuators often con- sist of several components made of different materials. Accordingly, microfabrication  techniques consist of more than just silicon processing. The coverage of the micro- fabrication processes is organized into three sections: (1) silicon layering processes,  (2) the LIGA process, and (3) other processes accomplished on a microscopic scale. "
    },
    {
        "type": "text",
        "text": "35.2.1  SILICON LAYER PROCESSES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The ﬁ  rst application of silicon in microsystems technology was in the fabrication of  Si piezoresistive sensors for the measurement of stress, strain, and pressure in the  early 1960s [5]. Silicon is now widely used in MST to produce sensors, actuators, and  other microdevices. The basic processing technologies are those used to produce  integrated circuits (Chapter 33). However, it should be noted that certain differ- ences exist between the processing of ICs and the fabrication of the microdevices  covered in this chapter:  "
    },
    {
        "type": "text",
        "text": "1.  The aspect ratios in microfabrication are generally much greater than in IC  fabrication.  Aspect ratio  is deﬁ  ned as the height-to-width ratio of the features  produced, as illustrated in Figure 35.6. Typical aspect ratios in semiconductor  processing are about 1.0 or less, whereas in microfabrication the corresponding  ratio might be as high as 400 [5].  "
    },
    {
        "type": "image",
        "img_path": "images/f1d51e94bde84cd36e53e8078fee6dc55359d663fc9a2f94b460ddf9b2bc7cc4.jpg",
        "img_caption": "FIGURE 35.6  Aspect ratio (height-to-width ratio) typical in (a) fabrication of integrated circuits and  (b) microfabricated components. "
    },
    {
        "type": "text",
        "text": "2.  The sizes of the devices made in microfabrication are often much larger than  in IC processing, in which the prevailing trend in microelectronics is inexorably  toward greater circuit densities and miniaturization. \n\n 3.  The structures produced in microfabrication often include cantilevers and  bridges and other shapes requiring gaps between layers. These kinds of struc- tures are uncommon in IC fabrication. \n\n 4.  The usual silicon processing techniques are sometimes supplemented to obtain  a three-dimensional structure or other physical feature in the microsystem. "
    },
    {
        "type": "text",
        "text": "Notwithstanding these differences, it must nevertheless be recognized that most  of the silicon-processing steps used in microfabrication are the same or very sim- ilar to those used to produce ICs. After all, silicon is the same material whether  it is used for integrated circuits or microdevices. The processing steps are listed in  Table 35.2, together with brief descriptions and text references where the reader can  obtain more detailed descriptions. All of these process steps are discussed in previ- ous chapters. As in IC fabrication, the various processes in Table 35.2 add, alter, or  remove layers of material from a substrate according to geometric data contained in  lithographic masks. Lithography is the fundamental technology that determines the  shape of the microdevice being fabricated. "
    },
    {
        "type": "text",
        "text": "Regarding the preceding list of differences between IC fabrication and micro- device fabrication, the issue of aspect ratio should be addressed in more detail. The  structures in IC processing are basically planar, whereas three-dimensional struc- tures are more likely to be required in microsystems. The features of microdevices  are likely to possess large height-to-width ratios. These 3-D features can be produced  in single-crystal silicon by wet etching, provided the crystal structure is oriented to  allow the etching process to proceed anisotropically. Chemical wet etching of poly- crystalline silicon is isotropic, with the formation of cavities under the edges of the  resist, as illustrated in Figure 33.16. However, in single-crystal Si, the etching rate  depends on the orientation of the lattice structure. In Figure 35.7, the three crystal  faces of silicon’s cubic lattice structure are illustrated. Certain etching solutions, such  as potassium hydroxide (KOH) and sodium hydroxide  $\\mathrm{(NaOH)}$ , have a very low  etching rate in the direction of the (111) crystal face. This permits the formation of  "
    },
    {
        "type": "table",
        "img_path": "images/fad8d551150f1ad7f9016bd4c327ef9876f498104f16596579feb1fc53f30ed9.jpg",
        "table_caption": "TABLE  •  35.2  Silicon layering processes used in microfabrication. "
    },
    {
        "type": "text",
        "text": "distinct geometric structures with sharp edges in a single-crystal Si substrate whose  lattice is oriented to favor etch penetration vertically or at sharp angles into the sub- strate. Structures such as those in Figure 35.8 can be created using this procedure.  It should be noted that anisotropic wet etching is also desirable in IC fabrication  "
    },
    {
        "type": "image",
        "img_path": "images/3fd6423587995b7e21ab2ced5b9b5a5519d5e0af265ce305d1a812b6898574c8.jpg",
        "img_caption": "FIGURE 35.7  Three  crystal faces in the  silicon cubic lattice  structure: (a) (100)  crystal face, (b) (110)  crystal face, and (c)  (111) crystal face. "
    },
    {
        "type": "image",
        "img_path": "images/3e10d72e072c63dbba2cb92d5191d17c09b12a6fab813d89bb86d112527e0fae.jpg",
        "img_caption": "FIGURE 35.8  Several  structures that can be  formed in single-crystal  silicon substrate by  bulk micromachining:  (a) (110) silicon and  (b) (100) silicon. "
    },
    {
        "type": "text",
        "text": "(Section 33.4.5), but its consequence is greater in microfabrication because of the  larger aspect ratios. The term  bulk micromachining  is used for the relatively deep  wet etching process into single-crystal silicon substrate (Si wafer); whereas the term  surface micromachining  refers to the planar structuring of the substrate surface,  using much more shallow layering processes. "
    },
    {
        "type": "text",
        "text": "Bulk micromachining can be used to create thin membranes in a microstructure.  However, a method is needed to control the etching penetration into the silicon, so  as to leave the membrane layer. A common method used for this purpose is to dope  the silicon substrate with boron atoms, which signiﬁ  cantly reduce the etching rate  of the silicon. The processing sequence is shown in Figure 35.9. In step (2), epitaxial  deposition is used to apply the upper layer of silicon so that it will possess the same  single-crystal structure and lattice orientation as the substrate (Section 33.4.2). This  is a requirement of bulk micromachining that will be used to provide the deeply  etched region in subsequent processing. The use of boron doping to establish the  etch resistant layer of silicon is called the $\\pmb{p}^{+}$   etch-stop technique . "
    },
    {
        "type": "text",
        "text": "Surface micromachining can be used to construct cantilevers, overhangs, and similar  structures on a silicon substrate, as shown in part (5) of Figure 35.10. The cantilevered  "
    },
    {
        "type": "image",
        "img_path": "images/c86069e4aa31e62d9f0f75995f0af80b0f871017dd1d98bbaad8f62e02523ee7.jpg",
        "img_caption": "FIGURE 35.9  Formation of a thin membrane in a silicon substrate: (1) silicon substrate is doped with boron; (2) a  thick layer of silicon is applied on top of the doped layer by epitaxial deposition; (3) both sides are thermally oxidized  to form a ${\\sf S i O}_{2}$  resist on the surfaces; (4) the resist is patterned by lithography; and (5) anisotropic etching is used to  remove the silicon except in the boron-doped layer. "
    },
    {
        "type": "image",
        "img_path": "images/32ebb7f9abf7dbf2f4308c98921ad7438f1b113575e59c66a20645aebd0fe977.jpg",
        "img_caption": "FIGURE 35.10  Surface micromachining to form cantilevers: (1) on the silicon substrate is formed a silicon dioxide  layer, whose thickness will determine the gap size for the cantilevered member; (2) portions of the  ${\\sf S i O}_{2}$  layer are  etched using lithography; (3) a polysilicon layer is applied; (4) portions of the polysilicon layer are etched using  lithography; and (5) the ${\\sf S i O}_{2}$  layer beneath the cantilevers is selectively etched. "
    },
    {
        "type": "image",
        "img_path": "images/8910ed788a7a1b968368e843223c27a160f838ad665a106fcf3d83284b917ba1.jpg",
        "img_caption": "FIGURE 35.11  The lift-off technique: (1) resist is applied to substrate and structured by  lithography; (2) platinum is deposited onto surfaces; and (3) resist is removed, taking with  it the platinum on its surface but leaving the desired platinum microstructure. "
    },
    {
        "type": "text",
        "text": "beams in the ﬁ  gure are parallel to but separated by a gap from the silicon surface. Gap  size and beam thickness are in the micron range. The process sequence to fabricate this  type of structure is depicted in the earlier parts of Figure 35.10. "
    },
    {
        "type": "text",
        "text": "Dry etching, which involves material removal through the physical and/or chemi- cal interaction between the ions in an ionized gas (a plasma) and the atoms of a sur- face that has been exposed to the ionized gas (Section 33.4.5), provides anisotropic  etching in almost any material. Its anisotropic penetration characteristic is not lim- ited to a single-crystal silicon substrate. On the other hand, etch selectivity is more  of a problem in dry etching; that is, any surfaces exposed to the plasma are attacked. "
    },
    {
        "type": "text",
        "text": "A procedure called the  lift-off technique  is used in microfabrication to pattern  metals such as platinum on a substrate. These structures are used in certain chemical  sensors, but are difﬁ  cult to produce by wet etching. The processing sequence in the  lift-off technique is illustrated in Figure 35.11. "
    },
    {
        "type": "text",
        "text": "35.2.2  LIGA PROCESS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "LIGA is an important process in MST. It was developed in Germany in the early  1980s, and the letters  LIGA  stand for the German words  LI thographie (in particu- lar, X-ray lithography, although other lithographic exposure methods are also used,  such as ion beams in Figure 35.3),  G alvanoformung (translated electrode position or  electroforming), and  A bformtechnik (plastic molding). The letters also indicate the  LIGA processing sequence. These processing steps have each been described in pre- vious sections of this book: X-ray lithography in Section 33.3.2; electrode position and  electroforming in Sections 27.3.1 and 27.3.2, respectively; and plastic molding proc- esses in Sections 13.6 and 13.7. The integration of these steps in LIGA technology is  examined in this section. "
    },
    {
        "type": "image",
        "img_path": "images/fc23197d506cc40ac73af9690c229456eac8dc84102ce936edb47bef75ddf033.jpg",
        "img_caption": "FIGURE 35.12  LIGA processing steps: (1) thick layer of resist applied and $\\mathsf{X}$ -ray exposure through mask, (2) exposed  portions of resist removed, (3) electrode position to ﬁ  ll openings in resist, (4) resist stripped to provide (a) a mold or (b)  a metal part. "
    },
    {
        "type": "text",
        "text": "The LIGA process is illustrated in Figure 35.12. The brief description provided  in the ﬁ  gure’s caption needs to be expanded: (1) A thick layer of (X-ray) radia- tion-sensitive resist is applied to a substrate. Layer thickness can range between  several microns to centimeters, depending on the size of the part(s) to be pro- duced. The common resist material used in LIGA is poly methyl meth a cry late  (PMMA, Section 8.2.2 under “Acrylics”). The substrate must be a conductive  material for the subsequent electrode position processes performed. The resist  is exposed through a mask to high-energy X-ray radiation. (2) The irradiated  areas of the positive resist are chemically removed from the substrate surface,  leaving the unexposed portions standing as a three-dimensional plastic structure.  (3) The regions where the resist has been removed are ﬁ  lled with metal using  electrode position. Nickel is the common plating metal used in LIGA. (4) The  remaining resist structure is stripped (removed), yielding a three-dimensional  metal structure. Depending on the geometry created, this metallic structure may  be (a) the mold used for producing plastic parts by injection molding, reaction  injection molding, or compression molding. In the case of injection molding, in  which thermoplastic parts are produced, these parts may be used as “lost molds”  in investment casting (Section 11.2.4). Alternatively, (b) the metal part may be a  pattern for fabricating plastic molds that will be used to produce more metallic  parts by electrode position. "
    },
    {
        "type": "text",
        "text": "As the description indicates, LIGA can produce parts by several different meth- ods. This is one of the greatest advantages of this microfabrication process: (1) LIGA  is a versatile process. Other advantages include (2) high aspect ratios are possible  in the fabricated part; (3) a wide range of part sizes is feasible, with heights ranging  from micrometers to centimeters; and (4) close tolerances can be achieved. A signiﬁ  - cant disadvantage of LIGA is that it is a very expensive process, so large quantities  of parts are usually required to justify its application. Also, the required use of x-ray  radiation is a disadvantage. "
    },
    {
        "type": "image",
        "img_path": "images/f605352ac0e5fa83fdd62932a5412ed3134ef73219a104a76b6b7bb8df929eb3.jpg",
        "img_caption": "FIGURE 35.13  Steps in mold-making for soft lithography: (1) master pattern fabricated by  traditional lithography, (2) poly dimethyl silo x a ne ﬂ  at mold is cast from the master pattern,  and (3) cured ﬂ  at mold is peeled off pattern for use. "
    },
    {
        "type": "text",
        "text": "35.2.3  OTHER MICROFABRICATION PROCESSES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "MST research is providing several additional fabrication techniques, most of which  are variations of lithography or adaptations of macro-scale processes. This section  discusses several of these additional techniques. "
    },
    {
        "type": "text",
        "text": "Soft Lithography  This term refers to processes that use an elastomeric ﬂ  at mold  (similar to a rubber ink stamp) to create a pattern on a substrate surface. The sequence  for creating the mold is illustrated in Figure 35.13. A master pattern is fabricated on a  silicon surface using one of the lithography processes such as UV photolithography  or electron beam lithography. This master pattern is then used to produce the ﬂ  at  mold for the soft lithography process. The common mold material is polydimeth- ylsiloxane (PDMS, a silicon rubber, Section 8.4.3). After the PDMS has cured, it is  peeled away from the pattern and attached to a substrate for support and handling.  "
    },
    {
        "type": "text",
        "text": "Two of the soft lithography processes are micro-imprint lithography and micro- contact printing. In  micro-imprint lithography , the mold is pressed into the sur- face of a soft resist to displace the resist away from certain regions of the substrate  for subsequent etching. The process sequence is illustrated in Figure 35.14. The ﬂ  at  mold consists of raised and depressed regions, and the raised regions correspond  to areas on the resist surface that will be displaced to expose the substrate. The  resist material is a thermoplastic polymer that has been softened by heating before  pressing. The alteration of the resist layer is by mechanical deformation rather  than electromagnetic radiation, as in the more traditional lithography methods.  The compressed regions of the resist layer are subsequently removed by aniso- tropic etching (Section 34.4.5). The etching process also reduces the thickness of  "
    },
    {
        "type": "image",
        "img_path": "images/1fd9451b71a3b1787ec33729a0a54baf294a364f7abd08128ed8fa98b92347cf.jpg",
        "img_caption": "FIGURE 35.14  Steps in micro-imprint lithography:(1) mold positioned above and (2) pressed into resist, (3) mold is  lifted, and (4) remaining resist is removed from substrate surface in deﬁ  ned regions. "
    },
    {
        "type": "text",
        "text": "the remaining resist layer, but enough remains to protect the substrate for sub- sequent processing. Micro-imprint lithography can be set up for high production  rates at modest cost. A mask is not required in the imprint procedure, although the  mold requires an analogous preparation. "
    },
    {
        "type": "text",
        "text": "The same type of ﬂ  at stamp can be used in a printing mode, in which case the  process is called  micro-contact printing . In this form of soft lithography, the mold is  used to transfer a pattern of a substance to a substrate surface, much like ink can be  transferred to a paper surface. This process allows very thin layers to be fabricated  onto the substrate. "
    },
    {
        "type": "text",
        "text": "Nontraditional and Traditional Processes in Microfabrication  A number of  nontraditional machining processes (Chapter 25), as well as conventional manu- facturing processes, are important in microfabrication.  Photochemical machining (PCM, Section 25.4.2) is an essential process in IC processing and microfabrication,  but it has been referred to in previous descriptions here and in Chapter 33 as wet  chemical etching (combined with photolithography). PCM is often used with conven- tional processes of  electroplating,   electroforming , and/or  electroless plating  (Section  27.3) to add layers of metallic materials according to microscopic pattern masks. "
    },
    {
        "type": "text",
        "text": "Other nontraditional processes capable of micro-level processing include [5]: (1)  electric discharge machining , used to cut holes as small as  $0.3\\;\\mathrm{mm}$  in diameter with  aspect ratios (depth-to-diameter) as high as 100; (2)  electron-beam machining , for  cutting holes of diameter smaller than $100\\,\\mu\\mathrm m$  in hard-to-machine materials; (3)  laser- beam machining , which can produce complex proﬁ  les and holes as small as  $10\\,\\mu\\mathrm m$  in  diameter with aspect ratios (depth-to-width or depth-to-diameter) approaching 50; (4)  ultrasonic machining , capable of drilling holes in hard and brittle materials as small  as $50\\,\\mu\\mathrm{m}$  in diameter; and (5)  wire electric discharge cutting , or  wire-EDM , which can  cut very narrow swaths with aspect ratios (depth-to-width) greater than 100. "
    },
    {
        "type": "text",
        "text": "Trends in conventional machining have included its capabilities for taking  smaller and smaller cut sizes and associated tolerances. Referred to as  ultra- high-precision machining , the enabling technologies have included single-crystal  diamond cutting tools and position control systems with resolutions as ﬁ  ne as 0.01  $\\mu\\mathrm{m}$  [5]. Figure 35.15 depicts one reported application, the milling of grooves in  "
    },
    {
        "type": "image",
        "img_path": "images/e6407c3c4bed569a1f7f81041e1dd07f8742e4d0f1d75d97284c8fe10d4740f7.jpg",
        "img_caption": "FIGURE 35.15  Ultra-high-precision  milling of grooves in  aluminum foil. "
    },
    {
        "type": "text",
        "text": "aluminum foil using a single-point diamond ﬂ  y-cutter. The aluminum foil is $100\\,\\mu\\mathrm m$   thick, and the grooves are $85\\,\\mu\\mathrm{m}$  wide and $70\\,\\mu\\mathrm m$  deep. Similar ultra-high-precision  machining is being applied today to produce products such as computer hard discs,  photocopier drums, mold inserts for compact disk reader heads, and high-deﬁ  nition  TV projection lenses. "
    },
    {
        "type": "text",
        "text": "Rapid Prototyping Technologies  Several rapid prototyping (RP) methods  (Chapter 32) have been adapted to produce micro-sized parts [7]. RP methods use  a layer additive approach to build three-dimensional components, based on a CAD  (computer-aided design) geometric model of the component. Each layer is very  thin, typically as low as  $0.05~\\mathrm{mm}$  thick, which approaches the scale of microfabri- cation technologies. By making the layers even thinner, microcomponents can be  fabricated.  "
    },
    {
        "type": "text",
        "text": "One approach is called  electrochemical fabrication  (EFAB), which involves the  electrochemical deposition of metallic layers in speciﬁ  c areas that are determined by  pattern masks created by “slicing” a CAD model of the object to be made (Section  33.1). The deposited layers are generally 5 to $10\\,\\mu\\mathrm{m}$  thick, with feature sizes as small  as $20~\\mu\\mathrm{m}$  in width. EFAB is carried out at temperatures below  $60^{\\circ}\\mathrm{C}$   $(140^{\\mathrm{o}}\\mathrm{F)}$  and  does not require a clean room environment. However, the process is slow, requiring  about 40 minutes to apply each layer, or about 35 layers (a height between 180 and  $360\\,\\mu\\mathrm{m})$ ) per 24-hour period. To overcome this disadvantage, the mask for each layer  can contain multiple copies of the part slice pattern, permitting many parts to be  produced simultaneously in a batch process. "
    },
    {
        "type": "text",
        "text": "Another RP approach, called  micro stereo lithography , is based on stereolithog- raphy (STL, Section 32.2.1), but the scale of the processing steps is reduced in size.  Whereas the layer thickness in conventional stereo lithography ranges between  $75\\,\\mu\\mathrm{m}$  and $500\\,\\mu\\mathrm{m}$ , micro stereo lithography (MSTL) uses layer thicknesses between  10 and $20\\;\\mu\\mathrm m$  typically, with even thinner layers possible. The laser spot size in STL  is typically around  $250\\ \\mu\\mathrm{m}$  in diameter, whereas MSTL uses a spot size as small as  1 or $2\\,\\mu\\mathrm m$ . Another difference in MSTL is that the work material is not limited to a  photosensitive polymer. Researchers report success in fabricating 3-D microstruc- tures from ceramic and metallic materials. The difference is that the starting material  is a powder rather than a liquid. "
    },
    {
        "type": "text",
        "text": "Photo fabrication  This term applies to an industrial process in which ultraviolet  exposure through a pattern mask causes a signiﬁ  cant modiﬁ  cation in the chemical  solubility of an optically clear material. The change is manifested in the form of an  increase in solubility to certain etchants. For example, hydroﬂ  uoric acid etches the  UV-exposed photosensitive glass between 15 and 30 times faster than the same  glass that has not been exposed. Masking is not required during etching, the differ- ence in solubility being the determining factor in which portions of the glass are  removed. "
    },
    {
        "type": "text",
        "text": "Origination of photo fabrication actually preceded the microprocessing of silicon.  Now, with the growing interest in microfabrication technologies, there is a renewed  interest in the older technology. Examples of modern materials used in photofab- rication include Corning Glass Works’ Fotoform(tm) glasses and Fotoceram(tm)  ceramics, and DuPont’s Dycril and Templex photosensitive solid polymers. When  processing these materials, aspect ratios of around 3:1 can be obtained with the  polymers and 20:1 with the glasses and ceramics. "
    }
]