[
    {
        "type": "text",
        "text": "Bulk Deformation  Processes in  Metalworking ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Chapter Contents ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "18.1 Rolling ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "18.1.1 Flat Rolling and Its Analysis 18.1.2 Shape Rolling 18.1.3 Rolling Mills\n\n "
    },
    {
        "type": "text",
        "text": "18.2 Other Deformation Processes  Related to Rolling "
    },
    {
        "type": "text",
        "text": "18.3 Forging ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "18.3.1 Open-Die Forging 18.3.2 Impression-Die Forging 18.3.3 Flashless Forging 18.3.4 Forging Hammers, Presses,  and Dies\n\n "
    },
    {
        "type": "text",
        "text": "18.4 Other Deformation Processes  Related to Forging "
    },
    {
        "type": "text",
        "text": "18.5 Extrusion ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "18.5.1 Types of Extrusion 18.5.2 Analysis of Extrusion 18.5.3 Extrusion Dies and Presses 18.5.4 Other Extrusion Processes 18.5.5 Defects in Extruded Products "
    },
    {
        "type": "text",
        "text": "18.6 Wire and Bar Drawing ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "18.6.1 Analysis of Drawing 18.6.2 Drawing Practice 18.6.3 Tube Drawing "
    },
    {
        "type": "text",
        "text": "The deformation processes described in this chapter  accomplish signiﬁ  cant shape change in metal parts  whose initial form is bulk rather than sheet. The start- ing forms include cylindrical bars and billets, rectangular  billets and slabs, and similar elementary geometries. The  bulk deformation processes reﬁ  ne the starting shapes,  sometimes improving mechanical properties, and always  adding commercial value. Deformation processes work  by stressing the metal sufﬁ  ciently to cause it to plasti- cally ﬂ  ow into the desired shape. "
    },
    {
        "type": "text",
        "text": "Bulk deformation processes are performed as cold,  warm, and hot working operations. Cold and warm  working are appropriate when the shape change is less  severe, and there is a need to improve mechanical prop- erties and achieve good ﬁ  nish on the part. Hot work- ing is generally required when massive deformation of  large work parts is involved. "
    },
    {
        "type": "text",
        "text": "The commercial and technological importance of  bulk deformation processes derives from the following:\n\n "
    },
    {
        "type": "text",
        "text": "➢   When performed as hot working operations, they  can achieve signiﬁ  cant change in the shape of the  work part.\n\n $\\gg$ When performed as cold working operations, they  can be used not only to shape the product, but also  to increase its strength through strain hardening.\n\n $\\gg$ These processes produce little or no waste as a by- product of the operation. Some bulk deformation  operations are  near net shape  or  net shape  processes;  they achieve ﬁ  nal product geometry with little or no  subsequent machining. The bulk deformation processes covered in this  chapter are (1) rolling, (2) forging, (3) extrusion, and  (4) wire and bar drawing. The chapter also documents  the variations and related operations of the four basic  processes that have been developed over the years. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Rolling is a deformation process in which the thickness of the work is reduced by  compressive forces exerted by two opposing rolls. The rolls rotate as illustrated in  Figure 18.1 to pull and simultaneously squeeze the work between them. The basic  process shown in the ﬁ  gure is ﬂ  at rolling, used to reduce the thickness of a rectangular  cross section. A closely related process is shape rolling, in which a square cross section  is formed into a shape such as an I-beam. "
    },
    {
        "type": "text",
        "text": "Most rolling processes are very capital intensive, requiring massive pieces of  equipment, called rolling mills, to perform them. The high investment cost requires  the mills to be used for production in large quantities of standard items such as  sheets and plates. Most rolling is carried out by hot working, called  hot rolling ,  owing to the large amount of deformation required. Hot-rolled metal is generally  free of residual stresses, and its properties are isotropic. Disadvantages of hot roll- ing are that the product cannot be held to close tolerances, and the surface has a  characteristic oxide scale. "
    },
    {
        "type": "text",
        "text": "Steelmaking provides the most common application of rolling mill operations  (Historical Note 18.1). The sequence of steps in a steel rolling mill illustrates the  variety of products made. Similar steps occur in other basic metal industries. The  work starts out as a cast steel ingot that has just solidiﬁ  ed. While it is still hot,  the ingot is placed in a furnace where it remains for many hours until it has reached  a uniform temperature throughout, so that the metal will ﬂ  ow consistently during  rolling. For steel, the desired temperature for rolling is around  $1200^{\\circ}\\mathrm{C}$   $(2200^{\\circ}\\mathrm{F})$ .  The heating operation is called  soaking , and the furnaces in which it is carried out  are called  soaking pits . "
    },
    {
        "type": "text",
        "text": "From soaking, the ingot is moved to the rolling mill, where it is rolled into one of  three intermediate shapes called blooms, billets, or slabs. A  bloom  has a square cross  section  $150\\;\\mathrm{mm}\\times150\\;\\mathrm{mm}$   $(6\\;\\mathrm{in}\\times6$  in) or larger. A  slab  is rolled from an ingot or  a bloom and has a rectangular cross section of width $250~\\mathrm{mm}$  (10 in) or more and  thickness $40\\,\\mathrm{mm}$  (1.5 in) or more. A  billet  is rolled from a bloom and is square with  dimensions $40\\:\\mathrm{mm}\\:(1.5\\:\\mathrm{in})$  on a side or larger. These intermediate shapes are subse- quently rolled into ﬁ  nal product shapes. "
    },
    {
        "type": "text",
        "text": "Blooms are rolled into structural shapes and rails for railroad tracks. Billets are  rolled into bars and rods. These shapes are the raw materials for machining, wire  drawing, forging, and other metalworking processes. Slabs are rolled into plates,  sheets, and strips. Hot-rolled plates are used in shipbuilding, bridges, boilers, welded  structures for various heavy machines, tubes and pipes, and many other products.  "
    },
    {
        "type": "image",
        "img_path": "images/c88f9c2f35f7035d1a211a56a029dfdaf52957f261d13da4b8cb0b4dea4f9046.jpg",
        "img_caption": "FIGURE 18.1  The  rolling process  (speciﬁ  cally, ﬂ  at rolling). "
    },
    {
        "type": "image",
        "img_path": "images/ffe115878b413d5d27462575081747c4d3f2d60d1ada64e26733036ccb1ed357.jpg",
        "img_caption": "FIGURE 18.2  Some  of the steel products  made in a rolling mill. "
    },
    {
        "type": "text",
        "text": "Figure 18.2 shows some of these rolled steel products. Further ﬂ  attening of hot- rolled plates and sheets is often accomplished by  cold rolling , in order to prepare  them for subsequent sheet metal operations (Chapter 19). Cold rolling strengthens  the metal and permits a tighter tolerance on thickness. In addition, the surface of the  cold-rolled sheet is absent of scale and generally superior to the corresponding hot- rolled product. These characteristics make cold-rolled sheets, strips, and coils ideal  for stampings, exterior panels, and other parts of products ranging from automobiles  to appliances and ofﬁ  ce furniture. "
    },
    {
        "type": "text",
        "text": "Historical Note 18.1  Rolling ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Rolling of gold and silver by manual methods dates from  the fourteenth century. Leonardo da Vinci designed one  of the ﬁ  rst rolling mills in 1480, but it is doubtful that his  design was ever built. By around 1600, cold rolling of  lead and tin was accomplished on manually operated  rolling mills. By around 1700, hot rolling of iron was be- ing done in Belgium, England, France, Germany, and  Sweden. These mills were used to roll iron bars into  sheets. Prior to this time, the only rolls in steelmaking  were slitting mills—pairs of opposing rolls with collars  (cutting disks) used to slit iron and steel into narrow  strips for making nails and similar products. Slitting  mills were not intended to reduce thickness. "
    },
    {
        "type": "text",
        "text": "Modern rolling practice dates from 1783 when a  patent was issued in England for using grooved rolls to  produce iron bars.  The Industrial Revolution created a tre- mendous demand for iron and steel, stimulating develop- ments in rolling. The ﬁ  rst mill for rolling railway rails was  started in 1820 in England. The ﬁ  rst I-beams were rolled  in France in 1849. In addition, the size and capacity of  ﬂ  at rolling mills increased dramatically during this period. Rolling is a process that requires a very large power  source. Water wheels were used to power rolling mills  until the eighteenth century. Steam engines increased  the capacity of these rolling mills until soon after 1900  when electric motors replaced steam. "
    },
    {
        "type": "text",
        "text": "18.1.1  FLAT ROLLING AND ITS ANALYSIS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Flat rolling is illustrated in Figures 18.1 and 18.3. It involves the rolling of slabs,  strips, sheets, and plates—work parts of rectangular cross section in which the width  is greater than the thickness. In ﬂ  at rolling, the work is squeezed between two rolls  so that its thickness is reduced by an amount called the  draft : "
    },
    {
        "type": "equation",
        "text": "\n$$\nd=t_{o}-t_{f}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $d=$  draft, mm (in);  $t_{o}=$  starting thickness, mm (in); and  $t_{f}=$  ﬁ  nal thickness,  $\\mathrm{mm}$  (in). Draft is sometimes expressed as a fraction of the starting stock thickness,  called the  reduction : "
    },
    {
        "type": "equation",
        "text": "\n$$\nr={\\frac{d}{t_{o}}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $r=$  reduction. When a series of rolling operations are used, reduction is taken  as the sum of the drafts divided by the original thickness. "
    },
    {
        "type": "text",
        "text": "In addition to thickness reduction, rolling usually increases work width. This is  called  spreading , and it tends to be most pronounced with low width-to-thickness  ratios and low coefﬁ  cients of friction. Conservation of matter is preserved, so the  volume of metal exiting the rolls equals the volume entering: "
    },
    {
        "type": "equation",
        "text": "\n$$\nt_{o}w_{o}L_{o}=t_{f}w_{f}L_{f}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $w_{o}$  and  $w_{f}$ are the before and after work widths, mm (in); and  $L_{o}$  and  $L_{f}$  are  the before and after work lengths, mm (in). Similarly, before and after volume rates  of material ﬂ  ow must be the same, so the before and after velocities can be related: "
    },
    {
        "type": "equation",
        "text": "\n$$\nt_{o}w_{o}\\nu_{o}=t_{f}w_{f}\\nu_{f}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $\\nu_{o}$  and $\\nu_{f}$  are the entering and exiting velocities of the work. "
    },
    {
        "type": "image",
        "img_path": "images/6edd98868e9fcf4f69a47e7ebc7667c632ef5916de7c1587efdb6fb922ddc846.jpg",
        "img_caption": "FIGURE 18.3  Side view of ﬂ  at  rolling, indicating before and after  thicknesses, work velocities,  angle of contact with rolls, and  other features. "
    },
    {
        "type": "text",
        "text": "The rolls contact the work along an arc deﬁ  ned by the angle  u .  Each roll has  radius  $R$ ,  and its rotational speed gives it a surface velocity  $\\nu_{r}.$  This velocity is  greater than the entering speed of the work $\\nu_{o}$  and less than its exiting speed  $\\nu_{f}.$ .   Since the metal ﬂ  ow is continuous, there is a gradual change in velocity of the  work between the rolls. However, there is one point along the arc where work  velocity equals roll velocity. This is called the  no-slip point , also known as the  neutral point . On either side of this point, slipping and friction occur between roll  and work. The amount of slip between the rolls and the work can be measured by  means of the  forward slip , a term used in rolling that is deﬁ  ned: "
    },
    {
        "type": "equation",
        "text": "\n$$\ns=\\frac{\\nu_{f}-\\nu_{r}}{\\nu_{r}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $s=$  forward slip;  $\\nu_{f}$   \"  ﬁ  nal (exiting) work velocity, m/s (ft/sec); and  $\\nu_{r}$   \"  roll  speed, m/s (ft/sec). ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The true strain experienced by the work in rolling is based on before and after  stock thicknesses. In equation form, "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\epsilon=\\ln\\frac{t_{o}}{t_{f}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The true strain can be used to determine the average ﬂ  ow stress   ${\\overline{{Y}}}_{f}$  applied to the  work material in ﬂ  at rolling. Recall from the previous chapter, Equation (18.2), that "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\overline{{Y}}_{f}=\\frac{K\\epsilon^{n}}{1+n}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The average ﬂ  ow stress is used to compute estimates of force and power in rolling. "
    },
    {
        "type": "text",
        "text": "Friction in rolling occurs with a certain coefﬁ  cient of friction, and the compres- sion force of the rolls, multiplied by this coefﬁ  cient of friction, results in a friction  force between the rolls and the work. On the entrance side of the no-slip point,  friction force is in one direction, and on the other side it is in the opposite direc- tion. However, the two forces are not equal. The friction force on the entrance side  is greater, so that the net force pulls the work through the rolls. If this were not the  case, rolling would not be possible. There is a limit to the maximum possible draft  that can be accomplished in ﬂ  at rolling with a given coefﬁ  cient of friction, deﬁ  ned by: "
    },
    {
        "type": "equation",
        "text": "\n$$\nd_{\\operatorname*{max}}=\\mu^{2}R\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $d_{\\mathrm{max}}=$  maximum draft, ${\\sf m m}\\left(\\mathrm{in}\\right);\\mu={\\sf c}$ oefﬁ  cient of friction; and $R=$  roll radius  $\\mathrm{mm}$  (in). The equation indicates that if friction were zero, draft would be zero, and it  would be impossible to accomplish the rolling operation. "
    },
    {
        "type": "text",
        "text": "Coefﬁ  cient of friction in rolling depends on lubrication, work material, and  working temperature. In cold rolling, the value is around 0.1; in warm working, a  typical value is around 0.2; and in hot rolling,  $\\mu$  is around 0.4 [16]. Hot rolling is  often characterized by a condition called  sticking , in which the hot work surface  adheres to the rolls over the contact arc. This condition often occurs in the rolling of  steels and high-temperature alloys. When sticking occurs, the coefﬁ  cient of friction  can be as high as 0.7. The consequence of sticking is that the surface layers of the  work are restricted to move at the same speed as the roll speed  $\\nu_{r};$  and below the  surface, deformation is more severe in order to allow passage of the piece through  the roll gap. "
    },
    {
        "type": "image",
        "img_path": "images/ed30251a2246dc18d0db6d595ab0fe28ffc25d8a6933111b0493ab868a57b460.jpg",
        "img_caption": "FIGURE 18.4  Typical variation in pressure  along the contact length in ﬂ  at rolling. The  peak pressure is located at the neutral point.  The area beneath the curve, representing the  integration in Equation (18.9), is the roll force $F_{\\ast}$ "
    },
    {
        "type": "text",
        "text": "Given a coefﬁ  cient of friction sufﬁ  cient to perform rolling, roll force  $F$  required  to maintain separation between the two rolls can be computed by integrating the  unit roll pressure (shown as $p$  in Figure 18.3) over the roll-work contact area. This  can be expressed: "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=w\\intop_{0}^{L}p d L\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $F=$  rolling force, $\\mathbf{N}$  (lb); $w=$  the width of the work being rolled, mm (in);  $p~=$  roll pressure, MPa  $\\mathrm{(lb/in^{2})}$ ; and  $L\\,=$ length of contact between rolls and  work, mm (in). The integration requires two separate terms, one for either side of  the neutral point. Variation in roll pressure along the contact length is signiﬁ  cant.  A sense of this variation can be obtained from the plot in Figure 18.4. Pressure  reaches a maximum at the neutral point, and trails off on either side to the entrance  and exit points. As friction increases, maximum pressure increases relative to  entrance and exit values. As friction decreases, the neutral point shifts away from  the entrance and toward the exit in order to maintain a net pull force in the  direc  tion of rolling. Otherwise, with low friction, the work would slip rather than  pass between the rolls. "
    },
    {
        "type": "text",
        "text": "An approximation of the results obtained by Equation (18.9) can be calculated  based on the average ﬂ  ow stress experienced by the work material in the roll gap.  That is, "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=\\overline{{Y}}_{f}w L\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where   ${\\overline{{Y}}}_{f}=$  average ﬂ  ow stress from Equation (18.7), MPa  $\\mathrm{(lb/in}^{2})$ ; and the product  $w L$  is the roll-work contact area,  $\\mathrm{mm}^{2}$   $(\\mathrm{in}^{2})$ ). Contact length can be approximated by "
    },
    {
        "type": "equation",
        "text": "\n$$\nL=\\sqrt{R(t_{o}-t_{f})}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The torque in rolling can be estimated by assuming that the roll force is centered  on the work as it passes between the rolls, and that it acts with a moment arm of one- half the contact length $L$ .  Thus, torque for each roll is "
    },
    {
        "type": "equation",
        "text": "\n$$\nT=0.5\\;F L\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The power required to drive each roll is the product of torque and angular veloc- ity. Angular velocity is $2\\pi N_{j}$ ,  where $N=$  rotational speed of the roll. Thus, the power  for each roll is $2\\pi N T.$  Substituting Equation (18.12) for torque in this expression for  power, and doubling the value to account for the fact that a rolling mill consists of  two powered rolls, the following expression is obtained: "
    },
    {
        "type": "equation",
        "text": "\n$$\nP=2\\pi N F L\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $P={\\mathrm{power}},{\\mathrm{J}}/{\\mathrm{s}}$  or W  $\\mathrm{(in{-}l b/m i n}$ ); $N=$  rotational speed $,1/\\mathrm{s}\\,(\\mathrm{rev/min});F=\\mathrm{coll}\\mathrm{.}$ ing force,  $\\mathbf{N}$  (lb); and $L=$ contact length,  $\\mathrm{m}$  (in). "
    },
    {
        "type": "text",
        "text": "Example 18.1  Flat rolling ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A $300{\\mathrm{-mm}}$ -wide strip $25\\,\\mathrm{mm}$  thick is fed through a rolling mill with two powered  rolls each of radius $=250\\,\\mathrm{mm}$ . The work thickness is to be reduced to $22\\,\\mathrm{mm}$  in  one pass at a roll speed of $50\\,\\mathrm{rev/min}$ . The work material has a ﬂ  ow curve deﬁ  ned  by $K=275$  MPa and $n=0.15$ , and the coefﬁ  cient of friction between the rolls  and the work is assumed to be 0.12. Determine if the friction is sufﬁ  cient to permit  the rolling operation to be accomplished. If so, calculate the roll force, torque, and  horsepower. "
    },
    {
        "type": "text",
        "text": "Solution:  The draft attempted in this rolling operation is "
    },
    {
        "type": "equation",
        "text": "\n$$\nd=25-22=3{\\mathrm{~mm}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "From Equation (18.8), the maximum possible draft for the given coefﬁ  cient of  friction is "
    },
    {
        "type": "equation",
        "text": "\n$$\nd_{\\operatorname*{max}}=(0.12)^{2}(250)=3.6\\,\\mathrm{mm}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Since the maximum allowable draft exceeds the attempted reduction, the roll- ing operation is feasible. To compute rolling force, contact length $L$  and average  ﬂ  ow stress ${\\overline{{Y}}}_{f}$  are needed. The contact length is given by Equation (18.11): "
    },
    {
        "type": "equation",
        "text": "\n$$\nL=\\sqrt{250(25-22)}=27.4\\,\\mathrm{mm}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "${\\overline{{Y}}}_{f}$    is determined from the true strain: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\epsilon=\\ln\\frac{25}{22}=0.128\n$$\n \n$$\n\\overline{{Y}}_{f}=\\frac{275(0.128)^{0.15}}{1.15}=175.7\\,\\mathrm{MPa}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "table",
        "img_path": "images/8de371f4112f66810aa614701f1976c51c7ddf126de1a567f8aab2f8c6273015.jpg"
    },
    {
        "type": "text",
        "text": "Rolling force is determined from Equation (18.10): "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=175.7(300)(27.4)=\\mathbf{1},\\mathbf{444},\\mathbf{786\\;N}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Torque required to drive each roll is given by Equation (18.12): "
    },
    {
        "type": "equation",
        "text": "\n$$\nT=0.5(1,444,786)(27.4)(10^{-3})=\\mathbf{19,786\\;N{-m}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "and the power is obtained from Equation (18.13): "
    },
    {
        "type": "text",
        "text": "$P=2\\pi\\,(50)(1,444,786)(27.4)(10^{-3})=12,432,086\\ \\mathrm{N-m/min}=207,201\\ \\mathrm{N-m/s(W)}$ "
    },
    {
        "type": "text",
        "text": "For comparison, convert this to horsepower, noting that one horsepower $=$   745.7 W: "
    },
    {
        "type": "equation",
        "text": "\n$$\nH P={\\frac{207{,}201}{745.7}}=278\\;\\mathbf{h}\\mathbf{p}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "It can be seen from this example that large forces and power are required in roll- ing. Inspection of Equations (18.10) and (18.13) indicates that force and/or power to  roll a strip of a given width and work material can be reduced by any of the following: \n\n (1) using hot rolling rather than cold rolling to reduce strength and strain hardening \n\n ( $K$  and $n$ ) of the work material; (2) reducing the draft in each pass; (3) using a smaller  roll radius $R$  to reduce force; and (4) using a lower rolling speed $N$  to reduce power. "
    },
    {
        "type": "text",
        "text": "18.1.2  SHAPE ROLLING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "In shape rolling, the work is deformed into a contoured cross section. Products made by  shape rolling include construction shapes such as I-beams, L-beams, and U-channels;  rails for railroad tracks; and round and square bars and rods (see Figure 18.2). The  process is accomplished by passing the work through rolls that have the reverse of the  desired shape. "
    },
    {
        "type": "text",
        "text": "Most of the principles that apply in ﬂ  at rolling are also applicable to shape rolling.  Shaping rolls are more complicated; and the work, usually starting as a square shape,  requires a gradual transformation through several rolls in order to achieve the ﬁ  nal  cross section. Designing the sequence of intermediate shapes and corresponding rolls is  called  roll-pass design . Its goal is to achieve uniform deformation throughout the cross  section in each reduction. Otherwise, certain portions of the work are reduced more  than others, causing greater elongation in these sections. The consequence of non- uniform reduction can be warping and cracking of the rolled product. Both horizontal  and vertical rolls are utilized to achieve consistent reduction of the work material. "
    },
    {
        "type": "text",
        "text": "18.1.3  ROLLING MILLS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Various rolling mill conﬁ  gurations are available to deal with the variety of applications  and technical problems in the rolling process. The basic rolling mill consists of two  opposing rolls and is referred to as a  two-high  rolling mill, shown in Figure 18.5(a).  The rolls in these mills have diameters in the range 0.6 to  $1.4\\textrm{m}$  (2.0–4.5 ft). The  "
    },
    {
        "type": "image",
        "img_path": "images/50aba029fb836fc3e68144afc5c9f49575b2ed4931f983eb1a1b9375f17601c1.jpg",
        "img_caption": "FIGURE 18.5  Various conﬁ  gurations of rolling mills: (a) 2-high, (b) 3-high, (c) 4-high, (d) cluster mill, and (e) tandem  rolling mill. "
    },
    {
        "type": "text",
        "text": "two-high conﬁ  guration can be either reversing or nonreversing. In the  nonrevers- ing mill , the rolls always rotate in the same direction, and the work always passes  through from the same side. The  reversing mill  allows the direction of roll rotation  to be reversed, so that the work can be passed through in either direction. This per- mits a series of reductions to be made through the same set of rolls, simply by pass- ing through the work from opposite directions multiple times. The disadvantage of  the reversing conﬁ  guration is the signiﬁ  cant angular momentum possessed by large  rotating rolls and the associated technical problems involved in reversing the direction. "
    },
    {
        "type": "text",
        "text": "Several alternative arrangements are illustrated in Figure 18.5. In the  three-high conﬁ  guration, Figure 18.5(b), there are three rolls in a vertical column, and the direc- tion of rotation of each roll remains unchanged. To achieve a series of reductions, the  work can be passed through from either side by raising or lowering the strip after  each pass. The equipment in a three-high rolling mill becomes more complicated,  because an elevator mechanism is needed to raise and lower the work. "
    },
    {
        "type": "text",
        "text": "As several of the previous equations indicate, advantages are gained in reduc- ing roll diameter. Roll-work contact length is reduced with a lower roll radius, and  this leads to lower forces, torque, and power. The  four-high  rolling mill uses two  smaller-diameter rolls to contact the work and two backing rolls behind them, as in  Figure 18.5(c). Owing to the high roll forces, these smaller rolls would deﬂ  ect elasti- cally between their end bearings as the work passes through unless the larger back- ing rolls were used to support them. Another roll conﬁ  guration that allows smaller  working rolls against the work is the  cluster rolling mill , shown in Figure 18.5(d). "
    },
    {
        "type": "text",
        "text": "To achieve higher throughput rates in standard products, a  tandem rolling mill  is  often used. This conﬁ  guration consists of a series of rolling stands, as represented in  Figure 18.5(e). Although only three stands are shown in the sketch, a typical tandem  rolling mill may have eight or ten stands, each making a reduction in thickness or  a reﬁ  nement in shape of the work passing through. With each rolling step, work  velocity increases, and the problem of synchronizing the roll speeds at each stand is  a signiﬁ  cant one. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Modern tandem rolling mills are often supplied directly by continuous casting  operations (Section 6.2.2). These setups achieve a high degree of integration among  the processes required to transform starting raw materials into ﬁ  nished products.  Advantages include elimination of soaking pits, reduction in ﬂ  oor space, and shorter  manufacturing lead times. These technical advantages translate into economic bene- ﬁ  ts for a mill that can accomplish continuous casting and rolling. "
    },
    {
        "type": "text",
        "text": " Other Deformation Processes Related to Rolling ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Several other bulk deformation processes use rolls to form the work part. The opera- tions include thread rolling, ring rolling, gear rolling, and roll piercing. "
    },
    {
        "type": "text",
        "text": "Thread Rolling  Thread rolling is used to form threads on cylindrical parts by  rolling them between two dies. It is the most important commercial process for  mass producing external threaded components (e.g., bolts and screws). The com- peting process is thread cutting (Section 21.7.1). Most thread rolling operations  are performed by cold working in thread rolling machines. These machines are  equipped with special dies that determine the size and form of the thread. The dies  are of two types: (1) ﬂ  at dies, which reciprocate relative to each other, as illustrated  in Figure 18.6; and (2) round dies, which rotate relative to each other to accomplish  the rolling action. "
    },
    {
        "type": "text",
        "text": "Production rates in thread rolling can be high, ranging up to eight parts per second  for small bolts and screws. Not only are these rates signiﬁ  cantly higher than thread cut- ting, but there are other advantages over machining as well: (1) better material utiliza- tion, (2) stronger threads due to work hardening, (3) smoother surface, and (4) better  fatigue resistance due to compressive stresses introduced by rolling. "
    },
    {
        "type": "text",
        "text": "Ring Rolling  Ring rolling is a deformation process in which a thick-walled ring of  smaller diameter is rolled into a thin-walled ring of larger diameter. The before and  after views of the process are illustrated in Figure 18.7. As the thick-walled ring is  compressed, the deformed material elongates, causing the diameter of the ring to be  enlarged. Ring rolling is usually performed as a hot-working process for large rings  and as a cold-working process for smaller rings. "
    },
    {
        "type": "image",
        "img_path": "images/4bee2658275f7b4c416e25e7bd70dafbcbe659aa241bb07d7bc685a656dba48f.jpg",
        "img_caption": "FIGURE 18.6  Thread rolling with ﬂ  at dies: (1) start of cycle and (2) end of cycle. "
    },
    {
        "type": "image",
        "img_path": "images/9edf1ef02735842f13ffd62cb894d89fe59b9290df6a9f955e8a4e8b05d394de.jpg",
        "img_caption": "FIGURE 18.7  Ring rolling used to reduce the wall thickness and increase the diameter of a ring: (1) start and  (2) completion of process. "
    },
    {
        "type": "text",
        "text": "Applications of ring rolling include ball and roller bearing races, steel tires for  railroad wheels, and rings for pipes, pressure vessels, and rotating machinery. The  ring walls are not limited to rectangular cross sections; the process permits rolling of  more complex shapes. There are several advantages of ring rolling over alternative  methods of making the same parts: raw material savings, ideal grain orientation for  the application, and strengthening through cold working. "
    },
    {
        "type": "text",
        "text": "Gear Rolling  Gear rolling is a cold working process to produce certain gears. The  automotive industry is an important user of these products. The setup in gear roll- ing is similar to thread rolling, except that the deformed features of the cylindrical  blank or disk are oriented parallel to its axis (or at an angle in the case of helical  gears) rather than spiraled as in thread rolling. Alternative production methods for  gears include several machining operations, discussed in Section 21.7.2. Advantages  of gear rolling compared to machining are similar to those of thread rolling: higher  production rates, better strength and fatigue resistance, and less material waste.  "
    },
    {
        "type": "text",
        "text": "Roll Piercing  Roll piercing is a specialized hot working process for making seam- less thick-walled tubes. It utilizes two opposing rolls, and hence it is grouped with the  rolling processes. The process is based on the principle that when a solid cylindrical  part is compressed on its circumference, as in Figure 18.8(a), high tensile stresses are  developed at its center. If compression is high enough, an internal crack is formed.  In roll piercing, this principle is exploited by the setup shown in Figure 18.8(b).  "
    },
    {
        "type": "image",
        "img_path": "images/74213d2af3806acf9133159fdea6ecf02d9b835148f141f497417c50273763ed.jpg",
        "img_caption": "FIGURE 18.8  Roll piercing: (a) formation of internal stresses and cavity by compression of cylindrical part; and  (b) setup of Mannesmann roll mill for producing seamless tubing. "
    },
    {
        "type": "text",
        "text": "Compressive stresses on a solid cylindrical billet are applied by two rolls, whose axes  are oriented at slight angles  $(\\sim6^{\\circ})$  from the axis of the billet, so that their rotation  tends to pull the billet through the rolls. A mandrel is used to control the size and  ﬁ  nish of the hole created by the action. The terms  rotary tube piercing  and  Mannes- mann process  are also used for this tube-making operation. "
    },
    {
        "type": "text",
        "text": " Forging ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Forging is a deformation process in which the work is compressed between two dies,  using either impact or gradual pressure to form the part. It is the oldest of the metal  forming operations, dating back to perhaps 5000  B . C . E . (Historical Note 18.2). Today,  forging is an important industrial process used to make a variety of high-strength  components for automotive, aerospace, and other applications. These components  include engine crankshafts and connecting rods, gears, aircraft structural compo- nents, and jet engine turbine parts. In addition, steel and other basic metals industries  use forging to establish the basic form of large components that are subsequently  machined to ﬁ  nal shape and dimensions. "
    },
    {
        "type": "text",
        "text": "Historical Note 18.2  Forging ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The forging process dates from the earliest written  records of man, around 7000 years ago. There is evi- dence that forging was used in ancient Egypt, Greece,  Persia, India, China, and Japan to make weapons, jew- elry, and a variety of implements. Craftsmen in the art  of forging during these times were held in high regard. Engraved stone platens were used as impression  dies in the hammering of gold and silver in ancient  Crete around 1600  B . C . E . This evolved into the fabrica- tion of coins by a similar process around 800  B . C . E .  More complicated impression dies were used in  Rome around 200  C . E .  The blacksmith’s trade remained  relatively unchanged for many centuries until the drop  hammer with guided ram was introduced near the end  of the eighteenth century. This development brought  forging practice into the Industrial Age. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "Forging is carried out in many different ways. One way to classify the operations  is by working temperature. Most forging operations are performed hot or warm, ow- ing to the signiﬁ  cant deformation demanded by the process and the need to reduce  strength and increase ductility of the work metal. However, cold forging is also very  common for certain products. The advantage of cold forging is the increased strength  that results from strain hardening of the component. "
    },
    {
        "type": "text",
        "text": "Either impact or gradual pressure is used in forging. The distinction derives more  from the type of equipment used than differences in process technology. A forging  machine that applies an impact load is called a  forging hammer , while one that applies  gradual pressure is called a  forging press . "
    },
    {
        "type": "text",
        "text": "Another difference among forging operations is the degree to which the ﬂ  ow of  the work metal is constrained by the dies. By this classiﬁ  cation, there are three types  of forging operations, shown in Figure 18.9: (a) open-die forging, (b) impression- die forging, and (c) ﬂ  ashless forging. In  open-die forging , the work is compressed  between two ﬂ  at (or almost ﬂ  at) dies, thus allowing the metal to ﬂ  ow without con- straint in a lateral direction relative to the die surfaces. In  impression-die forging , the die surfaces contain a shape or impression that is imparted to the work during  "
    },
    {
        "type": "image",
        "img_path": "images/be306bd4ec5a24bc88844685275621b875479be1605a55a4a186d76268f86aab.jpg",
        "img_caption": "FIGURE 18.9  Three types of forging operation illustrated by cross-sectional sketches: (a) open-die forging,  (b) impression-die forging, and (c) ﬂ  ashless forging. "
    },
    {
        "type": "text",
        "text": "compression, thus constraining metal ﬂ  ow to a signiﬁ  cant degree. In this type of  operation, a portion of the work metal ﬂ  ows beyond the die impression to form  ﬂ  ash , as shown in the ﬁ  gure. Flash is excess metal that must be trimmed off later. In  ﬂ  ashless forging , the work is completely constrained within the die and no excess  ﬂ  ash is produced. The volume of the starting workpiece must be controlled very  closely so that it matches the volume of the die cavity. "
    },
    {
        "type": "text",
        "text": "18.3.1  OPEN-DIE FORGING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The simplest case of open-die forging involves compression of a work part of cylin- drical cross section between two ﬂ  at dies, much in the manner of a compression test  (Section 3.1.2). This forging operation, known as  upsetting  or  upset forging , reduces  the height of the work and increases its diameter. "
    },
    {
        "type": "text",
        "text": "Analysis of Open-Die Forging  If open-die forging is carried out under ideal con- ditions of no friction between work and die surfaces, then homogeneous deformation  occurs, and the radial ﬂ  ow of the material is uniform throughout its height, as pictured  in Figure 18.10. Under these ideal conditions, the true strain experienced by the work  during the process can be determined by "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\epsilon=\\mathrm{ln}\\frac{h_{o}}{h}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $h_{o}=$  starting height of the work, mm (in); and  $h=$  the height at some inter- mediate point in the process, mm (in). At the end of the compression stroke,  $h=$  its  ﬁ  nal value $h_{f},$  and the true strain reaches its maximum value. "
    },
    {
        "type": "image",
        "img_path": "images/fa27ec7d2540b943827d6f4ef3c697e646c1c08a7ee2aa602bf0450d0a7ef407.jpg",
        "img_caption": "FIGURE 18.10  Homogeneous  deformation of a  cylindrical work part  under ideal conditions  in an open-die forging  operation: (1) start of  process with workpiece  at its original length  and diameter, (2) partial  compression, and  (3) ﬁ  nal size. "
    },
    {
        "type": "text",
        "text": "Estimates of force to perform upsetting can be calculated. The force required to  continue the compression at any given height $h$  during the process can be obtained  by multiplying the corresponding cross-sectional area by the ﬂ  ow stress: "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=Y_{f}A\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $F=$  force, lb (N); $A=$  cross-sectional area of the part, $\\mathrm{mm}^{2}\\left(\\mathrm{in}^{2}\\right)$ ; and  $Y_{f}=$  ﬂ  ow  stress corresponding to the strain given by Equation (18.14), MPa  $\\mathrm{(lb/in^{2})}$ ). Area  $A$   continuously increases during the operation as height is reduced. Flow stress  $Y_{f}$ also  increases as a result of work hardening, except when the metal is perfectly plastic  (e.g., in hot working). In this case, the strain hardening exponent $n=0$ , and ﬂ  ow stress  $Y_{f}$  equals the metal’s yield strength  Y . Force reaches a maximum value at the end of  the forging stroke, when both area and ﬂ  ow stress are at their highest values. "
    },
    {
        "type": "text",
        "text": "An actual upsetting operation does not occur quite as shown in Figure 18.10 because  friction opposes the ﬂ  ow of work metal at the die surfaces. This creates the barreling  effect shown in Figure 18.11. When performed on a hot work part with cold dies, the  barreling effect is even more pronounced. This results from a higher coefﬁ  cient of fric- tion typical in hot working and heat transfer at and near the die surfaces, which cools  the metal and increases its resistance to deformation. The hotter metal in the middle  of the part ﬂ  ows more readily than the cooler metal at the ends. These effects are more  signiﬁ  cant as the diameter-to-height ratio of the work part increases, due to the greater  contact area at the work-die interface. "
    },
    {
        "type": "image",
        "img_path": "images/6c291405c2047b3fe449ba9e4e4514d9a9f4ba78af114ae8c40d9b6897dcd6f4.jpg",
        "img_caption": "FIGURE 18.11  Actual  deformation of a  cylindrical work part in  open-die forging,  showing pronounced  barreling: (1) start of  process, (2) partial  deformation, and  (3) ﬁ  nal shape. "
    },
    {
        "type": "text",
        "text": "All of these factors cause the actual upsetting force to be greater than what is  predicted by Equation (18.15). As an approximation, a shape factor can be applied  to Equation (18.15) to account for effects of the $D/h$  ratio and friction: "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=K_{f}Y_{f}A\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $F,\\,Y_{f},$  and $A$  have the same deﬁ  nitions as in the previous equation; and  $K_{f}$ is  the forging shape factor, deﬁ  ned as "
    },
    {
        "type": "equation",
        "text": "\n$$\nK_{f}=1+\\frac{0.4\\,\\mu D}{h}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $\\mu\\,=$ coefﬁ  cient of friction;  $D\\;=\\;$ work part diameter or other dimension  represent  ing contact length with die surface, mm (in); and  $h\\,=$  work part height,  mm (in). "
    },
    {
        "type": "text",
        "text": "Example 18.2  Open-die  forging ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A cylindrical workpiece is subjected to a cold upset forging operation. The  starting piece is $75\\:\\mathrm{mm}$  in height and $50\\,\\mathrm{mm}$  in diameter. It is reduced in the  operation to a height of $36\\:\\mathrm{mm}$ . The work material has a ﬂ  ow curve deﬁ  ned by  $K=350$  MPa and $n=0.17.$ . Assume a coefﬁ  cient of friction of 0.1. Determine  the force as the process begins, at intermediate heights of  $62\\:\\mathrm{mm}$ ,  $49\\,\\mathrm{mm}$ , and  at the ﬁ  nal height of $36\\:\\mathrm{mm}$ . "
    },
    {
        "type": "text",
        "text": "Solution :   Workpiece volume  $V=75\\pi(50^{2}/4)=147,262\\,\\mathrm{mm}^{3}.$  At the moment  contact is made by the upper die, $h=75\\:\\mathrm{mm}$  and the force $F=0.$ . At the start  of yielding, $h$  is slightly less than $75\\,\\mathrm{mm}$ ; assume that strain $=0.002$ , at which  the ﬂ  ow stress is "
    },
    {
        "type": "equation",
        "text": "\n$$\nY_{f}=K\\epsilon^{n}=350(0.002)^{0.17}=121.7\\,\\mathrm{MPa}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The diameter is still approximately $D=50\\:\\mathrm{mm}$  and area $A=\\pi(50^{2}/4)=$ $1963.5\\;\\mathrm{mm}^{2}$ . For these conditions, the adjustment factor  $K_{f}$  is computed as "
    },
    {
        "type": "equation",
        "text": "\n$$\nK_{f}=1+{\\frac{0.4(0.1)(50)}{75}}=1.027\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The forging force is "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=1.027(121.7)(1963.5)=245{,}410\\ \\mathrm{N}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "At $h=62\\:\\mathrm{mm}$ , "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\epsilon=\\ln\\frac{75}{62}=\\ln\\left(1.21\\right)=0.1904\n$$\n \n$$\nY_{f}=350(0.1904)^{17}=264.0\\,\\mathrm{MPa}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Assuming constant volume, and neglecting barreling, "
    },
    {
        "type": "equation",
        "text": "$A=147{,}262/62=2375.2\\,\\mathrm{mm}^{2}$  and  $D={\\sqrt{\\frac{4(2375.2)}{\\pi}}}=55.0\\,{\\mathrm{mm}}$ \n$$\nK_{f}=1+{\\frac{0.4(0.1)(55)}{62}}=1.035\n$$\n \n$$\nF\\,{=}\\,1.035(264)(2375.2)\\,{=}\\,649{,}303\\;\\mathrm{N}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Similarly, at $h=49\\,\\mathrm{mm}$ , $F=955{,}642{\\:}\\mathrm{N}$ ; and at $h=36\\;{\\mathrm{mm}},F=1,467,422\\;{\\mathrm{N}}$ .  The load-stroke curve in Figure 18.12 was developed from the values in this  example. "
    },
    {
        "type": "text",
        "text": "Open-Die Forging Practice  Open-die hot forging is an important industrial  process. Shapes generated by open-die operations are simple; examples include  shafts, disks, and rings. In some applications, the dies have slightly contoured sur- faces that help to shape the work. In addition, the work must often be manipu- lated (e.g., rotating in steps) to effect the desired shape change. Skill of the human  operator is a factor in the success of these operations. An example of open-die  forging in the steel industry is the shaping of a large square cast ingot into a round  cross section. Open-die forging operations produce rough forms, and subsequent  operations are required to reﬁ  ne the parts to ﬁ  nal geometry and dimensions. An  important contribution of open-die hot-forging is that it creates a favorable grain  ﬂ  ow and metallurgical structure in the metal. "
    },
    {
        "type": "image",
        "img_path": "images/6b76ffdf83ed66472b66966bd64982e91a6d685a5fd956ebcb125cafbcfe5f15.jpg",
        "img_caption": "FIGURE 18.12  Upsetting force as a  function of height  $h$  and height reduction  $(h_{o}-h)$ . This plot is sometimes called  the load stroke curve. "
    },
    {
        "type": "image",
        "img_path": "images/68b0cbee94f6e84be694f225cb1cc71453d0e32effe8a9bf9fc28194fe786a94.jpg",
        "img_caption": "FIGURE 18.13  Several open-die forging operations: (a) fullering, (b) edging, and (c) cogging. "
    },
    {
        "type": "text",
        "text": "Operations classiﬁ  ed as open-die forging or related operations include fuller- ing, edging, and cogging, illustrated in Figure 18.13.  Fullering  is a forging operation  performed to reduce the cross section and redistribute the metal in a work part in  preparation for subsequent shape forging. It is accomplished by dies with convex  surfaces. Fullering die cavities are often designed into multi-cavity impression dies,  so that the starting bar can be rough formed before ﬁ  nal shaping.  Edging  is similar  to fullering, except that the dies have concave surfaces. "
    },
    {
        "type": "text",
        "text": "A  cogging  operation consists of a sequence of forging compressions along the  length of a workpiece to reduce cross section and increase length. It is used in the  steel industry to produce blooms and slabs from cast ingots. It is accomplished using  open dies with ﬂ  at or slightly contoured surfaces. The term  incremental forging  is  sometimes used for this process. "
    },
    {
        "type": "text",
        "text": "18.3.2  IMPRESSION-DIE FORGING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Impression-die forging, sometimes called  closed-die forging , is performed with  dies that contain the inverse of the desired shape of the part. The process is  illustrated in a three-step sequence in Figure 18.14. The raw workpiece is shown  as a cylindrical part similar to that used in the previous open-die operation. As  the die closes to its ﬁ  nal position, ﬂ  ash is formed by metal that ﬂ  ows beyond the  die cavity and into the small gap between the die plates. Although this ﬂ  ash must  "
    },
    {
        "type": "image",
        "img_path": "images/da84f2c3fd6fc25efdaff7b55acdc9089041725dc819e53c9360dc8c58ee0157.jpg",
        "img_caption": "FIGURE 18.14  Sequence in impression-die forging: (1) just prior to initial contact with raw workpiece, (2) partial  compression, and (3) ﬁ  nal die closure, causing ﬂ  ash to form in gap between die plates. "
    },
    {
        "type": "text",
        "text": "be cut away from the part in a subsequent trimming operation, it actually serves  an important function during impression-die forging. As the ﬂ  ash begins to form  in the die gap, friction resists continued ﬂ  ow of metal into the gap, thus constrain- ing the bulk of the work material to remain in the die cavity. In hot forging, metal  ﬂ  ow is further restricted because the thin ﬂ  ash cools quickly against the die plates,  thereby increasing its resistance to deformation. Restricting metal ﬂ  ow in the gap  causes the compression pressures on the part to increase signiﬁ  cantly, thus forc- ing the material to ﬁ  ll the sometimes intricate details of the die cavity to ensure a  high-quality product. "
    },
    {
        "type": "text",
        "text": "Several forming steps are often required in impression die forging to transform  the starting blank into the desired ﬁ  nal geometry. Separate cavities in the die are  needed for each step. The beginning steps are designed to redistribute the metal in  the work part to achieve a uniform deformation and desired metallurgical struc- ture in the subsequent steps. The ﬁ  nal steps bring the part to its ﬁ  nal geometry. In  addition, when drop forging is used, several blows of the hammer may be required  for each step. When impression-die drop forging is done manually, as it often is,  considerable operator skill is required under adverse conditions to achieve con- sistent results. "
    },
    {
        "type": "text",
        "text": "Because of ﬂ  ash formation in impression die forging and the more complex part  shapes made with these dies, forces in this process are signiﬁ  cantly greater and more  difﬁ  cult to analyze than in open-die forging. Relatively simple formulas and design  factors are often used to estimate forces in impression-die forging. The force formula  is the same as previous Equation (18.16) for open-die forging, but its interpretation  is slightly different: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\textstyle F=K_{f}Y_{f}A\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $F=$  maximum force in the operation,  $\\mathbf{N}$  (lb);  $A\\,=$ projected area of the  part including ﬂ  ash, $\\mathrm{mm}^{2}$   $(\\mathrm{in}^{2})$ );  $Y_{f}=$  ﬂ  ow stress of the material, MPa  $\\mathrm{(lb/in^{2})}$ ; and  $K_{f}=$  forging shape factor. In hot forging, the appropriate value of  $Y_{f}$  is the yield  "
    },
    {
        "type": "table",
        "img_path": "images/f3462a064ca9e804c94054fd079f674a2139533c2fb2fedc7c7ae49b33790501.jpg",
        "table_caption": "TABLE  •  18.1  Typical $K_{t}$ values for various part shapes in impression-die and ﬂ  ashless forging. "
    },
    {
        "type": "text",
        "text": "strength of the metal at the elevated temperature. In other cases, selecting the  proper value of ﬂ  ow stress is difﬁ  cult because the strain varies throughout the  workpiece for complex shapes.  $K_{f}$  in Equation (18.18) is a factor intended to  account for increases in force required to forge part shapes of various complexi- ties. Table 18.1 indicates the range of values of  $K_{f}$ for different part geometries.  Obviously, the problem of specifying the proper  $K_{f}$ value for a given work part  limits the accuracy of the force estimate. "
    },
    {
        "type": "text",
        "text": "Equation (18.18) applies to the maximum force during the operation, since this  is the load that will determine the required capacity of the press or hammer used in  the operation. The maximum force is reached at the end of the forging stroke, when  the projected area is greatest and friction is maximum. "
    },
    {
        "type": "text",
        "text": "Impression-die forging is not capable of close tolerance work, and machining  is often required to achieve the accuracies needed. The basic geometry of the  part is obtained from the forging process, with machining performed on those  portions of the part that require precision ﬁ  nishing (e.g., holes, threads, and sur- faces that mate with other components). The advantages of forging, compared  to machining the part completely, are higher production rates, conservation of  metal, greater strength, and favorable grain orientation of the metal that results  from forging. A comparison of the grain ﬂ  ow in forging and machining is illus- trated in Figure 18.15. "
    },
    {
        "type": "text",
        "text": "Improvements in the technology of impression-die forging have resulted in the  capability to produce forgings with thinner sections, more complex geometries,  drastic reductions in draft requirements on the dies, closer tolerances, and the vir- tual elimination of machining allowances. Forging processes with these features  are known as  precision forging . Common work metals used for precision forg- ing include aluminum and titanium. A comparison of precision and conventional  "
    },
    {
        "type": "image",
        "img_path": "images/4b675fee68c2764bb4d1c82310ebb4199ab8aa6874bbb8e2ff2636ac45876764.jpg",
        "img_caption": "FIGURE 18.15  Comparison of metal  grain ﬂ  ow in a part that  is: (a) hot forged with  ﬁ  nish machining, and  (b) machined complete. "
    },
    {
        "type": "image",
        "img_path": "images/a617e50dd739f414e11c8f6d2d8b80cf95edb7fa7ba6e6ded23aa6742d61afe4.jpg",
        "img_caption": "FIGURE 18.16  Cross sections of  (a) conventional- and  (b) precision forgings.  Dashed lines in  (a) indicate subsequent  machining required to  make the conventional  forging equivalent in  geometry to the  precision forging. In both  cases, ﬂ  ash extensions  must be trimmed. "
    },
    {
        "type": "text",
        "text": "impression-die forging is presented in Figure 18.16. Note that precision forging in  this example does not eliminate ﬂ  ash, although it reduces it. Some precision forg- ing operations are accomplished without producing ﬂ  ash. Depending on whether  machining is required to ﬁ  nish the part geometry, precision forgings are properly  classiﬁ  ed as  near net shape  or  net shape  processes. "
    },
    {
        "type": "text",
        "text": "18.3.3  FLASHLESS FORGING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "As mentioned above, impression-die forging is sometimes called closed-die forging in  industry terminology. However, there is a technical distinction between impression- die forging and true closed-die forging. The distinction is that in closed-die forging,  the raw workpiece is completely contained within the die cavity during compression,  and no ﬂ  ash is formed. The process sequence is illustrated in Figure 18.17. The term  ﬂ  ashless forging  is appropriate to identify this process. "
    },
    {
        "type": "text",
        "text": "Flashless forging imposes requirements on process control that are more demand- ing than impression-die forging. Most important is that the work volume must equal  "
    },
    {
        "type": "image",
        "img_path": "images/9cd575029b9c5220250e3fa84d5fd72432e222f9e2633a178767164db1ba1b5e.jpg",
        "img_caption": "FIGURE 18.17  Flashless forging:  (1) just before initial  contact with workpiece,  (2) partial compression,  and (3) ﬁ  nal punch and  die closure. Symbols $V$ and $F$  indicate motion  ( $V=$  velocity) and  applied force,  respectively. "
    },
    {
        "type": "image",
        "img_path": "images/59208590bdae21093e3587de1ae8fa4630672939ed6871ff675ef9243df5672f.jpg",
        "img_caption": "FIGURE 18.18  Coining operation: (1) start of cycle, (2) compression stroke, and (3) ejection of ﬁ  nished part. "
    },
    {
        "type": "text",
        "text": "the space in the die cavity within a very close tolerance. If the starting blank is too  large, excessive pressures may cause damage to the die or press. If the blank is too  small, the cavity will not be ﬁ  lled. Because of the special demands made by ﬂ  ashless  forging, the process lends itself best to part geometries that are usually simple and  symmetrical, and to work materials such as aluminum and magnesium and their alloys.  Flashless forging is often classiﬁ  ed as a  precision forging  process [5]. "
    },
    {
        "type": "text",
        "text": "Forces in ﬂ  ashless forging reach values comparable to those in impression die  forging. Estimates of these forces can be computed using the same methods as for  impression die forging: Equation (18.18) and Table 18.1. "
    },
    {
        "type": "text",
        "text": "Coining  is a special application of closed-die forging in which ﬁ  ne details in the  die are impressed into the top and bottom surfaces of the work part. There is little  ﬂ  ow of metal in coining, yet the pressures required to reproduce the surface details  in the die cavity are high, as indicated by the value of  $K_{f}$  in Table 18.1. A common  application of coining is, of course, in the minting of coins, shown in Figure 18.18.  The process is also used to provide good surface ﬁ  nish and dimensional accuracy on  work parts made by other operations. "
    },
    {
        "type": "text",
        "text": "18.3.4  FORGING HAMMERS, PRESSES, AND DIES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Equipment used in forging consists of forging machines, classiﬁ  ed as hammers or  presses, and forging dies, which are the special tooling used in these machines. In addi- tion, auxiliary equipment is needed, such as furnaces to heat the work, mechanical  devices to load and unload the work, and trimming stations to cut away the ﬂ  ash in  impression-die forging. "
    },
    {
        "type": "text",
        "text": "Forging Hammers  Forging hammers operate by applying an impact loading against  the work. The term  drop hammer  is often used for these machines, owing to the means  "
    },
    {
        "type": "image",
        "img_path": "images/9d886b9159ec21c9d5d9cc96b73cdf55c217ab266135496848eeea761e5fa37b.jpg",
        "img_caption": "FIGURE 18.19  Drop  forging hammer, fed by  conveyor and heating  units at the right of the  scene. (Photo courtesy  of Ajax-Ceco.) "
    },
    {
        "type": "text",
        "text": "of delivering the impact energy; see Figures 18.19 and 18.20. Drop hammers are most  frequently used for impression-die forging. The upper portion of the forging die is  attached to the ram, and the lower portion is attached to the anvil. In the operation,  the work is placed on the lower die, and the ram is lifted and then dropped. When the  upper die strikes the work, the impact energy causes the part to assume the form of  the die cavity. Several blows of the hammer are often required to achieve the desired  change in shape. Drop hammers can be classiﬁ  ed as gravity drop hammers and power  drop hammers.  Gravity drop hammers  achieve their energy by the falling weight of  "
    },
    {
        "type": "image",
        "img_path": "images/29139032e5e0fe02a8125d2ad12e25acf9dc810a74de23185a938316bcec24de.jpg",
        "img_caption": "FIGURE 18.20  Diagram showing details of  a drop hammer for impression-die forging. "
    },
    {
        "type": "text",
        "text": "a heavy ram. The force of the blow is determined by the height of the drop and the  weight of the ram.  Power drop hammers  accelerate the ram by pressurized air or  steam. One of the disadvantages of drop hammers is that a large amount of the impact  energy is transmitted through the anvil and into the ﬂ  oor of the building. "
    },
    {
        "type": "text",
        "text": "Forging Presses   Presses apply gradual pressure, rather than sudden impact,  to accomplish the forging operation. Forging presses include mechanical presses,  hydraulic presses, and screw presses.  Mechanical presses  operate by means of  eccentrics, cranks, or knuckle joints, which convert the rotating motion of a drive  motor into the translation motion of the ram. These mechanisms are very similar  to those used in stamping presses (Section 19.5.2). Mechanical presses typically  achieve very high forces at the bottom of the forging stroke.  Hydraulic presses   use a hydraulically driven piston to actuate the ram.  Screw presses  apply force by  a screw mechanism that drives the vertical ram. Both screw drive and hydraulic  drive operate at relatively low ram speeds and can provide a constant force  throughout the stroke. These machines are therefore suitable for forging (and  other forming) operations that require a long stroke. "
    },
    {
        "type": "text",
        "text": "Forging Dies   Proper die design is important in the success of a forging opera- tion. Parts to be forged must be designed based on knowledge of the principles and  limitations of this process. The purpose here is to describe some of the terminology  and guidelines used in the design of forgings and forging dies. Design of open dies is  generally straightforward because the dies are relatively simple in shape. The follow- ing comments apply to impression dies and closed dies. Figure 18.21 deﬁ  nes some of  the terminology in an impression die. "
    },
    {
        "type": "text",
        "text": "Some of the principles and limitations that must be considered in the part design  or in the selection of forging as the manufacturing process is provided in the follow- ing discussion of forging die terminology [5]:\n\n "
    },
    {
        "type": "text",
        "text": "➢   Parting line . The parting line is the plane that divides the upper die from the  lower die. Called the ﬂ  ash line in impression-die forging, it is the plane where the  two die halves meet. Its selection by the designer affects grain ﬂ  ow in the part,  required load, and ﬂ  ash formation.\n\n ➢   Draft . Draft is the amount of taper on the sides of the part required to remove  it from the die. The term also applies to the taper on the sides of the die cavity.  Typical draft angles are  $3^{\\circ}$  on aluminum and magnesium parts and  $5^{\\circ}$  to  $7^{\\circ}$  on  steel parts. Draft angles on precision forgings are near zero.\n\n ➢   Webs and ribs . A web is a thin portion of the forging that is parallel to the part- ing line, while a rib is a thin portion that is perpendicular to the parting line.  These part features cause difﬁ  culty in metal ﬂ  ow as they become thinner.\n\n ➢   Fillet and corner radii . Fillet and corner radii are illustrated in Figure 18.21. Small  radii tend to limit metal ﬂ  ow and increase stresses on die surfaces during forging.\n\n $\\gg$ Flash . Flash formation plays a critical role in impression-die forging by causing  pressure buildup inside the die to promote ﬁ  lling of the cavity. This pressure  buildup is controlled by designing a ﬂ  ash land and gutter into the die, as pictured  in Figure 18.21. The land determines the surface area along which lateral ﬂ  ow  of metal occurs, thereby controlling the pressure increase inside the die. The  gutter permits excess metal to escape without causing the forging load to reach  extreme values. "
    },
    {
        "type": "image",
        "img_path": "images/05148abcfc7a763451858b7876608be680ae332ef2a07111eb21a5c2e3a31d61.jpg",
        "img_caption": "FIGURE 18.21  Terminology for a  conventional impression- die in forging. "
    },
    {
        "type": "text",
        "text": "Other Deformation Processes  Related to Forging ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "In addition to the conventional forging operations discussed in the preceding sections,  other metal forming operations are closely associated with forging. "
    },
    {
        "type": "text",
        "text": "Upsetting and Heading  Upsetting (also called  upset forging ) is a deformation  opera  tion in which a cylindrical work part is increased in diameter and reduced in  length.  This operation is analyzed in the discussion of open-die forging (Section 18.3.1).  However, as an industrial operation, it can also be performed as closed-die forging,  as in Figure 18.22. "
    },
    {
        "type": "image",
        "img_path": "images/26eed755e407a60d380ae15287bd25ec8126054c7c61d41134454f59136e29ce.jpg",
        "img_caption": "FIGURE 18.22  An upset forging operation to form a head on a bolt or similar hardware item. The cycle is as follows:  (1) Wire stock is fed to the stop; (2) gripping dies close on the stock and the stop is retracted; (3) punch moves forward;  and (4) bottoms to form the head. "
    },
    {
        "type": "image",
        "img_path": "images/6dba64601358f49663edb9df85265ccac6cd5fdb28f85f880321894ab937b11c.jpg",
        "img_caption": "FIGURE 18.23  Examples of heading (upset forging) operations: (a) heading a nail using open dies, (b) round head  formed by punch, (c) and (d) heads formed by die, and (e) carriage bolt head formed by punch and die. "
    },
    {
        "type": "text",
        "text": "Upsetting is widely used in the fastener industry to form heads on nails, bolts,  and similar hardware products. In these applications, the term  heading  is often used  to denote the operation. Figure 18.23 illustrates a variety of heading applications,  indicating various possible die conﬁ  gurations. Owing to these types of applications,  more parts are produced by upsetting than by any other forging operation. It is  performed as a mass-production operation—cold, warm, or hot—on special upset  forging machines, called headers or formers. These machines are usually equipped  with horizontal slides, rather than vertical slides as in conventional forging hammers  and presses. Long wire or bar stock is fed into the machines, the end of the stock is  upset forged, and then the piece is cut to length to make the desired hardware item.  For bolts and screws, thread rolling (Section 18.2) is used to form the threads. "
    },
    {
        "type": "text",
        "text": "There are limits on the amount of deformation that can be achieved in upsetting,  usually deﬁ  ned as the maximum length of stock to be forged. The maximum length that  can be upset in one blow is three times the diameter of the starting stock. Otherwise,  the metal bends or buckles instead of compressing properly to ﬁ  ll the cavity. "
    },
    {
        "type": "text",
        "text": "Swaging and Radial Forging  Swaging and radial forging are forging processes  used to reduce the diameter of a tube or solid rod. Swaging is often performed on  the end of a workpiece to create a tapered section. The  swaging  process, shown in  Figure 18.24, is accomplished by means of rotating dies that hammer a workpiece  "
    },
    {
        "type": "image",
        "img_path": "images/8e2ba1ab3fd863c7089031b5e1ce85ee3c9fba7c2e1d093f36e829174a3b3e51.jpg",
        "img_caption": "FIGURE 18.24  Swaging  process to reduce solid  rod stock; the dies rotate  as they hammer the  work. In radial forging,  the workpiece rotates  while the dies remain  in a ﬁ  xed orientation as  they hammer the work. "
    },
    {
        "type": "image",
        "img_path": "images/787d3d8108467936bbb2c769b6a3535a98a5cb0cf03f5cc5c425e902888dedb4.jpg",
        "img_caption": "FIGURE 18.25  Examples of parts made  by swaging:  (a) reduction of solid  stock, (b) tapering a  tube, (c) swaging to  form a groove on a  tube, (d) pointing of a  tube, and (e) swaging of  neck on a gas cylinder. "
    },
    {
        "type": "text",
        "text": "radially inward to taper it as the piece is fed into the dies. Figure 18.25 illustrates  some of the shapes and products that are made by swaging. A mandrel is sometimes  required to control the shape and size of the internal diameter of tubular parts that  are swaged.  Radial forging  is similar to swaging in its action against the work and  is used to create similar part shapes. The difference is that in radial forging the dies  do not rotate around the workpiece; instead the work is rotated as it feeds into the  hammering dies. "
    },
    {
        "type": "text",
        "text": "Roll Forging  Roll forging is a deformation process used to reduce the cross section  of a cylindrical (or rectangular) workpiece by passing it through a set of opposing rolls  that have grooves matching the desired shape of the ﬁ  nal part. The typical operation is  illustrated in Figure 18.26. Roll forging is generally classiﬁ  ed as a forging process even  though it utilizes rolls. The rolls do not turn continuously in roll forging, but rotate  through only a portion of one revolution corresponding to the desired deformation  to be accomplished on the part. Roll-forged parts are generally stronger and possess  favorable grain structure compared to competing processes such as machining that  might be used to produce the same part geometry. "
    },
    {
        "type": "image",
        "img_path": "images/79b390d3c1950437b47800e1b3e567acf0736d5ae30664c4efee10dff83eeafa.jpg",
        "img_caption": "FIGURE 18.26  Roll forging. "
    },
    {
        "type": "image",
        "img_path": "images/6fa8c0b2b424f8b49bee018370ef34556278096ae52606998e232f7c252f53a7.jpg",
        "img_caption": "FIGURE 18.27  Orbital forging. At end of deformation cycle, lower die lifts to eject part. "
    },
    {
        "type": "text",
        "text": "Orbital Forging  In this process, deformation occurs by means of a cone-shaped  upper die that is simultaneously rolled and pressed into the work part. As illustrated  in Figure 18.27, the work is supported on a lower die, which has a cavity into which  the work is compressed. Because the axis of the cone is inclined, only a small area of  the work surface is compressed at any moment. As the upper die revolves, the area  under compression also revolves. These operating characteristics of orbital forging  result in a substantial reduction in press load required to accomplish deformation  of the work. "
    },
    {
        "type": "text",
        "text": "Hubbing  Hubbing is a deformation process in which a hardened steel form is  pressed into a soft steel (or other soft metal) block. The process is often used to  make mold cavities for plastic molding and die casting, as sketched in Figure 18.28.  The hardened steel form, called the  hub , is machined to the geometry of the part to  be molded. Substantial pressures are required to force the hub into the soft block,  and this is usually accomplished by a hydraulic press. Complete formation of the die  cavity in the block often requires several steps—hubbing followed by annealing to  recover the work metal from strain hardening. When signiﬁ  cant amounts of material  are deformed in the block, as shown in the ﬁ  gure, the excess must be machined away.  The advantage of hubbing in this application is that it is generally easier to machine  the positive form than the mating negative cavity. This advantage is multiplied in  cases where more than one cavity are made in the die block. "
    },
    {
        "type": "text",
        "text": "Isothermal Forging  Isothermal forging is a term applied to a hot-forging opera- tion in which the work part is maintained at or near its starting elevated temperature  during deformation, usually by heating the forging dies to the same elevated tem- perature. By avoiding chill of the workpiece on contact with the cold die surfaces as  in conventional forging, the metal ﬂ  ows more readily and the force required to per- form the process is reduced. Isothermal forging is more expensive than conventional  forging and is usually reserved for difﬁ  cult-to-forge metals, such as titanium and  "
    },
    {
        "type": "image",
        "img_path": "images/9ffd92f4b3633fa0db2211630ce107e590b06ef50eb1479579d458df3f8c72f5.jpg",
        "img_caption": "FIGURE 18.28  Hubbing: (1) before  deformation, and  (2) as the process is  completed. Note that the  excess material formed  by the penetration of  the hub must be  machined away. "
    },
    {
        "type": "text",
        "text": "superalloys, and for complex part shapes. The process is sometimes carried out in a  vacuum to avoid rapid oxidation of the die material. Similar to isothermal forging  is  hot-die forging , in which the dies are heated to a temperature that is somewhat  below that of the work metal. "
    },
    {
        "type": "text",
        "text": "Trimming   Trimming is an operation used to remove ﬂ  ash on the work part  in impression-die forging. In most cases, trimming is accomplished by shearing,  as in Figure 18.29, in which a punch forces the work through a cutting die, the  blades for which have the proﬁ  le of the desired part. Trimming is usually done  while the work is still hot, which means that a separate trimming press is included  at each forging hammer or press. In cases where the work might be damaged by  the cutting process, trimming may be done by alternative methods, such as grinding  or sawing. "
    },
    {
        "type": "image",
        "img_path": "images/7c92e37e7673f1c09c71641c4962ed959bdb8077cd080b7cf85735c7ff39fd06.jpg",
        "img_caption": "FIGURE 18.29  Trimming operation  (shearing process) to remove the  ﬂ  ash after impression-die forging. "
    },
    {
        "type": "text",
        "text": "Extrusion is a compression process in which the work metal is forced to ﬂ  ow through  a die opening to produce a desired cross-sectional shape. The process can be likened  to squeezing toothpaste out of a toothpaste tube. Extrusion dates from around 1800  (Historical Note 18.3). There are several advantages of the modern process: (1) a  variety of shapes are possible, especially with hot extrusion; (2) grain structure and  strength properties are enhanced in cold and warm extrusion; (3) fairly close toler- ances are possible, especially in cold extrusion; and (4) in some extrusion operations,  little or no wasted material is created. However, a limitation is that the cross section  of the extruded part must be uniform throughout its length. "
    },
    {
        "type": "text",
        "text": "Historical Note 18.3  Extrusion ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Extrusion as an industrial process was invented around  1800 in England, during the Industrial Revolution when  that country was leading the world in technological  innovations. The invention consisted of the ﬁ  rst hydrau- lic press for extruding lead pipes. An important step  forward was made in Germany around 1890, when the  ﬁ  rst horizontal extrusion press was built for extruding  metals with higher melting points than lead.  The feature  that made this possible was the use of a dummy block  that separated the ram from the work billet. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "18.5.1  TYPES OF EXTRUSION ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Extrusion is carried out in various ways. One important distinction is between direct  extrusion and indirect extrusion. Another classiﬁ  cation is by working temperature:  cold, warm, or hot extrusion. Finally, extrusion is performed as either a continuous  process or a discrete process. "
    },
    {
        "type": "text",
        "text": "Direct versus Indirect Extrusion  Direct extrusion (also called  forward extrusion )  is illustrated in Figure 18.30. A metal billet is loaded into a container, and a ram  compresses the material, forcing it to ﬂ  ow through one or more openings in a die at  the opposite end of the container. As the ram approaches the die, a small portion of  the billet remains that cannot be forced through the die opening. This extra portion,  called the  butt , is separated from the product by cutting it just beyond the exit of  the die. "
    },
    {
        "type": "image",
        "img_path": "images/e9c8e229311738f090a0cd5e57a387b015e06e9e9ba96e296bc95de92d08af44.jpg"
    },
    {
        "type": "image",
        "img_path": "images/8052ed75b4e3c16abb33fd077ba219c133ca9bf565cb110ee057c69f40e96536.jpg",
        "img_caption": "FIGURE 18.31  (a) Direct extrusion  to produce a hollow  or semi-hollow cross  section; (b) hollow and  (c) semi-hollow cross  sections. "
    },
    {
        "type": "text",
        "text": "One of the problems in direct extrusion is the signiﬁ  cant friction that exists  between the work surface and the walls of the container as the billet is forced  to slide toward the die opening. This friction causes a substantial increase in the  ram force required in direct extrusion. In hot extrusion, the friction problem is  aggravated by the presence of an oxide layer on the surface of the billet. This  oxide layer can cause defects in the extruded product. To address these problems,  a dummy block is often used between the ram and the work billet. The diameter  of the dummy block is slightly smaller than the billet diameter, so that a narrow  ring of work metal (mostly the oxide layer) is left in the container, leaving the  ﬁ  nal product free of oxides. "
    },
    {
        "type": "text",
        "text": "Hollow sections (e.g., tubes) are possible in direct extrusion by the process setup in  Figure 18.31. The starting billet is prepared with a hole parallel to its axis. This allows  passage of a mandrel that is attached to the dummy block. As the billet is compressed,  the material is forced to ﬂ  ow through the clearance between the mandrel and the die  opening. The resulting cross section is tubular. Semi-hollow cross-sectional shapes are  usually extruded in the same way. "
    },
    {
        "type": "text",
        "text": "The starting billet in direct extrusion is usually round in cross section, but the ﬁ  nal  shape is determined by the shape of the die opening. Obviously, the largest dimension  of the die opening must be smaller than the diameter of the billet. "
    },
    {
        "type": "text",
        "text": "In  indirect extrusion , also called  backward extrusion  and  reverse extrusion , Figure 18.32(a), the die is mounted to the ram rather than at the opposite end of  the container. As the ram penetrates into the work, the metal is forced to ﬂ  ow  through the clearance in a direction opposite to the motion of the ram. Since the  billet is not forced to move relative to the container, there is no friction at the  container walls, and the ram force is therefore lower than in direct extrusion. Limi- tations of indirect extrusion are imposed by the lower rigidity of the hollow ram  and the difﬁ  culty in supporting the extruded product as it exits the die. "
    },
    {
        "type": "text",
        "text": "Indirect extrusion can produce hollow (tubular) cross sections, as in Figure 18.32(b).  In this method, the ram is pressed into the billet, forcing the material to ﬂ  ow around the  "
    },
    {
        "type": "image",
        "img_path": "images/298073862edf0b01f5f6c4b5633eadc7af42d1833363730347bbe25dc6a29d1e.jpg",
        "img_caption": "FIGURE 18.32  Indirect extrusion to produce (a) a solid cross section and (b) a hollow cross section. "
    },
    {
        "type": "text",
        "text": "ram and take a cup shape. There are practical limitations on the length of the extruded  part that can be made by this method. Support of the ram becomes a problem as work  length increases. "
    },
    {
        "type": "text",
        "text": "Hot versus Cold Extrusion  Extrusion can be performed either hot or cold, depend- ing on work metal and amount of strain to which it is subjected during deformation.  Metals that are typically extruded hot include aluminum, copper, magnesium, zinc,  tin, and their alloys. These same metals are sometimes extruded cold. Steel alloys are  usually extruded hot, although the softer, more ductile grades are sometimes cold  extruded (e.g., low carbon steels and stainless steel). Aluminum is probably the most  ideal metal for extrusion (hot and cold), and many commercial aluminum products  are made by this process (structural shapes, door and window frames, etc.). "
    },
    {
        "type": "text",
        "text": "Hot extrusion  involves prior heating of the billet to a temperature above its recrystal- lization temperature. This reduces strength and increases ductility of the metal, permit- ting more extreme size reductions and more complex shapes to be achieved in the  process. Additional advantages include reduction of ram force, increased ram speed,  and reduction of grain ﬂ  ow characteristics in the ﬁ  nal product. Cooling of the billet  as it contacts the container walls is a problem, and  isothermal   extrusion  is sometimes  used to overcome this problem. Lubrication is critical in hot extrusion for certain met- als (e.g., steels), and special lubricants have been developed that are effective under  the harsh conditions in hot extrusion. Glass is sometimes used as a lubricant in hot  extrusion; in addition to reducing friction, it also provides effective thermal insulation  between the billet and the extrusion container. "
    },
    {
        "type": "text",
        "text": "Cold extrusion  and warm extrusion are generally used to produce discrete parts,  often in ﬁ  nished (or near ﬁ  nished) form. The term  impact extrusion  is used to  indicate high-speed cold extrusion, and this method is described in Section 18.5.4.  Some important advantages of cold extrusion include increased strength due to  strain hardening, close tolerances, improved surface ﬁ  nish, absence of oxide layers,  and high production rates. Cold extrusion at room temperature also eliminates the  need for heating the starting billet. "
    },
    {
        "type": "text",
        "text": "Continuous versus Discrete Processing  A true continuous process operates  in steady state mode for an indeﬁ  nite period of time. Some extrusion operations  approach this ideal by producing very long sections in one cycle, but these opera- tions are ultimately limited by the size of the starting billet that can be loaded  into the extrusion container. These processes are more accurately described as  semi-continuous operations. In nearly all cases, the long section is cut into smaller  lengths in a subsequent sawing or shearing operation. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "In a discrete extrusion operation, a single part is produced in each extrusion cycle.  Impact extrusion is an example of the discrete processing case. "
    },
    {
        "type": "text",
        "text": "18.5.2  ANALYSIS OF EXTRUSION ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Reference Figure 18.33 as some of the parameters in extrusion are discussed. The  diagram assumes that both billet and extrudate are round in cross section. One  impor  tant parameter is the  extrusion ratio , also called the  reduction ratio . The ratio  is deﬁ  ned: "
    },
    {
        "type": "equation",
        "text": "\n$$\nr_{x}=\\frac{A_{o}}{A_{f}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $r_{x}=$  extrusion ratio; $A_{o}=$  cross-sectional area of the starting billet, $\\mathrm{mm}^{2}\\left(\\mathrm{in}^{2}\\right)$ ; and  $A_{f}=$  ﬁ  nal cross-sectional area of the extruded section, $\\mathrm{mm}^{2}$   $(\\mathrm{in}^{2})$ ). The ratio applies for  both direct and indirect extrusion. The value of $r_{x}$  can be used to determine true strain in  extrusion, given that ideal deformation occurs with no friction and no redundant work: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\epsilon=\\mathrm{ln}\\:r_{x}=\\mathrm{ln}\\frac{A_{o}}{A_{f}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Under the assumption of ideal deformation (no friction and no redundant work), the  pressure applied by the ram to compress the billet through the die opening depicted  in the ﬁ  gure can be computed as follows: "
    },
    {
        "type": "equation",
        "text": "\n$$\np=\\overline{{Y}}_{f}\\ln r_{x}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where   ${\\overline{{Y}}}_{f}=$  average ﬂ  ow stress during deformation, MPa  $(1b/i n^{2})$ ). For convenience,  Equation (17.2) is restated from the previous chapter: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\overline{{Y}}_{f}=\\frac{K\\epsilon^{n}}{1+n}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "In fact, extrusion is not a frictionless process, and the previous equations grossly  underestimate the strain and pressure in an extrusion operation. Friction exists  "
    },
    {
        "type": "image",
        "img_path": "images/aacf377d2622fc73bf868e9dfcea4cf4b071d422d7a7195854f11971339fbd9d.jpg"
    },
    {
        "type": "text",
        "text": "between the die and the work as the billet squeezes down and passes through the  die opening. In direct extrusion, friction also exists between the container wall  and the billet surface. The effect of friction is to increase the strain experienced by  the metal. Thus, the actual pressure is greater than that given by Equation (18.21),  which assumes no friction. "
    },
    {
        "type": "text",
        "text": "Various methods have been suggested to calculate the actual true strain and  associated ram pressure in extrusion [1], [3], [6], [11], [12], and [19]. The following  empirical equation proposed by Johnson [11] for estimating extrusion strain has  gained considerable recognition: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\epsilon_{x}=a+b\\ln{r_{x}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $\\epsilon_{x}=$  extrusion strain; and $a$  and $b$  are empirical constants for a given die angle.  Typical values of these constants are:  $a=0.8$  and $b=1.2$  to 1.5. Values of $a$  and $b$  tend  to increase with increasing die angle. "
    },
    {
        "type": "text",
        "text": "The ram pressure to perform  indirect extrusion  can be estimated based on John- son’s extrusion strain formula as follows: "
    },
    {
        "type": "equation",
        "text": "\n$$\np=\\overline{{Y}}_{f}\\,\\epsilon_{x}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where   ${\\overline{{Y}}}_{f}$  is calculated based on ideal strain from Equation (18.20), rather than extru- sion strain in Equation (18.22). "
    },
    {
        "type": "text",
        "text": "In  direct extrusion , the effect of friction between the container walls and the billet  causes the ram pressure to be greater than for indirect extrusion. The following expres- sion isolates the friction force in the direct extrusion container: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\frac{p_{f}\\pi D_{o}^{2}}{4}=\\mu p_{c}\\pi D_{o}L\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $p_{f}=$  additional pressure required to overcome friction, MPa  $\\left(1\\mathbf{b}/\\mathrm{in}^{2}\\right)$ ;  $\\pi D_{o}{}^{2}/4=$ billet cross-sectional area, $\\mathrm{mm}^{2}$   $(\\mathrm{in}^{2})$ ;  $\\mu=$  coefﬁ  cient of friction at the container wall;  $p_{c}=$  pressure of the billet against the container wall, MPa  $\\left(1\\mathbf{b}/\\mathrm{in}^{2}\\right)$ ; and  $\\pi D_{o}L=$  area  of the interface between billet and container wall,  $\\mathrm{mm}^{2}$   $(\\mathrm{in}^{2})$ ). The right-hand side  of this equation indicates the billet-container friction force, and the left-hand side gives  the additional ram force to overcome that friction. In the worst case, sticking occurs at  the container wall so that friction stress equals shear yield strength of the work metal: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\mu p_{c}\\pi D_{o}L=Y_{s}\\pi D_{o}L\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $Y_{s}=$  shear yield strength, MPa  $\\mathrm{(lb/in^{2})}$ ). If it is assumed that  $Y_{s}=\\overline{{Y}}_{f}/2$ 2, then $p_{f}$ reduces to the following: "
    },
    {
        "type": "equation",
        "text": "\n$$\np_{f}=\\overline{{Y}}_{f}\\frac{2L}{D_{o}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Based on this reasoning, the following formula can be used to compute ram pressure  in direct extrusion: "
    },
    {
        "type": "equation",
        "text": "\n$$\np=\\overline{{Y}}_{f}\\left(\\epsilon_{x}+\\frac{2L}{D_{o}}\\right)\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where the term $2L/D_{o}$  accounts for the additional pressure due to friction at the  container-billet interface.  $L$  is the portion of the billet length remaining to be  "
    },
    {
        "type": "image",
        "img_path": "images/f3d9b5aad95b270e5c715f633f413a1ef98f01a238c8d651d469a3e8d973757d.jpg",
        "img_caption": "FIGURE 18.34  Typical plots of  ram pressure versus ram stroke  (and remaining billet length) for  direct and indirect extrusion. The  higher values in direct extrusion  result from friction at the  container wall. The shape of the  initial pressure buildup at the  beginning of the plot depends  on die angle (higher die angles  cause steeper pressure buildups).  The pressure increase at the end  of the stroke is related to  formation of the butt. "
    },
    {
        "type": "text",
        "text": "extruded, and  $D_{o}$  is the original diameter of the billet. Note that  $p$  is reduced as  the remaining billet length decreases during the process. Typical plots of ram pres- sure as a function of ram stroke for direct and indirect extrusion are presented in  Figure 18.34. Equation (18.23b) probably overestimates ram pressure. With good  lubrication, ram pressures would be lower than values calculated by this equation. Ram force in indirect or direct extrusion is simply pressure  $p$  from Equations  (18.23a) or (18.23b), respectively, multiplied by billet area $A_{o}$ : "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=p A_{o}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $F=\\mathrm{{rad}}$  force in extrusion, $\\mathbf{N}$  (lb). Power required to carry out the extrusion  operation is simply "
    },
    {
        "type": "equation",
        "text": "\n$$\nP=F\\nu\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $P=$  power,  $\\mathrm{J}/\\mathrm{s}$  (in-lb/min); $F=$  ram force,  $\\mathbf{N}$  (lb); and  $\\nu=\\mathrm{{ramp}}$  velocity,  $\\mathrm{m/s}$   $(\\mathrm{in}/\\mathrm{min})$ . "
    },
    {
        "type": "text",
        "text": "Example 18.3  Extrusion  pressures ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "A billet $75\\,\\mathrm{mm}$  long and $25\\,\\mathrm{mm}$  in diameter is to be extruded in a direct  extrusion operation with extrusion ratio $r_{x}=4.0$ . The extrudate has a round  cross section. The die angle (half-angle) $=90^{\\circ}$ . The work metal has a strength  coefﬁ  cient $=415\\,\\mathrm{MPa}$ , and strain hardening exponent $=0.18$ . Use the Johnson  formula with $a=0.8$  and $b=1.5$  to estimate extrusion strain. Determine the  pressure applied to the end of the billet as the ram moves forward. "
    },
    {
        "type": "text",
        "text": "Solution:  The ram pressure will be calculated at billet lengths of $L=75\\,\\mathrm{mm}$   (starting value), $L=50\\,\\mathrm{mm},L=25\\,\\mathrm{mm}$ , and $L=0$ . The ideal true strain,  extrusion strain using Johnson’s formula, and average ﬂ  ow stress are computed  as follows: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\epsilon=\\ln r_{x}=\\ln4.0=1.3863\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "image",
        "img_path": "images/48949a4efccbdf6f0258f662bfec4ba7b49ecd613f0c64611c73dc9fa99d95c4.jpg"
    },
    {
        "type": "equation",
        "text": "\n$$\n\\begin{array}{l}{{\\epsilon_{x}=0.8+1.5(1.3863)=2.8795}}\\\\ {{\\displaystyle{\\overline{{Y}}_{f}=\\frac{415(1.3863)^{0.18}}{1.18}=373\\;\\mathrm{MPa}}}}\\end{array}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "$L=75\\,\\mathrm{mm}$ : With a die angle of  $90^{\\mathrm{o}}$ , the billet metal is assumed to be forced  through the die opening almost immediately; thus, the calculation assumes  that maximum pressure is reached at the billet length of  $75\\:\\mathrm{mm}$ . For die angles  less than $90^{\\circ}$ , the pressure would build to a maximum as in Figure 18.34 as the  starting billet is squeezed into the cone-shaped portion of the extrusion die.  Using Equation (18.23b), "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\begin{array}{r l r}&{}&{p=373\\left(2.8795+2\\frac{75}{25}\\right)=3312\\;\\mathrm{MPa}}\\\\ &{}&\\\\ &{}&{L=50\\;\\mathrm{mm};p=373\\left(2.8795+2\\frac{50}{25}\\right)=2566\\;\\mathrm{MPa}}\\\\ &{}&\\\\ &{}&{L=25\\;\\mathrm{mm};p=373\\left(2.8795+2\\frac{25}{25}\\right)=1820\\;\\mathrm{MPa}}\\end{array}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "$L=0$ : Zero length is a hypothetical value in direct extrusion. In reality, it is  impossible to squeeze all of the metal through the die opening. Instead, a por- tion of the billet (the “butt”) remains unextruded and the pressure begins to  increase rapidly as $L$  approaches zero. This increase in pressure at the end of  the stroke is seen in the plot of ram pressure versus ram stroke in Figure 18.34.  Calculated below is the hypothetical minimum value of ram pressure that  would result at  $L=0$ . "
    },
    {
        "type": "equation",
        "text": "\n$$\np=373\\left(2.8795+2{\\frac{0}{25}}\\right)={\\bf1074}\\;{\\bf M P a}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "This is also the value of ram pressure that would be associated with indirect  extrusion throughout the length of the billet. "
    },
    {
        "type": "text",
        "text": "18.5.3  EXTRUSION DIES AND PRESSES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Important factors in an extrusion die are die angle and oriﬁ  ce shape. Die angle, more  precisely die half-angle, is shown as $\\alpha$  in Figure 18.35(a). For low angles, surface area of  the die is large, leading to increased friction at the die-billet interface. Higher friction  results in larger ram force. On the other hand, a large die angle causes more turbulence  in the metal ﬂ  ow during reduction, increasing the ram force required. Thus, the effect  of die angle on ram force is a U-shaped function, as in Figure 18.35(b). An optimum  die angle exists, as suggested by the hypothetical plot. The optimum angle depends on  various factors (e.g., work material, billet temperature, and lubrication) and is therefore  difﬁ  cult to determine for a given extrusion job. Die designers rely on rules of thumb  and judgment to decide the appropriate angle. "
    },
    {
        "type": "text",
        "text": "The previous equations for ram pressure, Equations (18.23a), apply to a circular  die oriﬁ  ce. The shape of the die oriﬁ  ce affects the ram pressure required to perform an  extrusion operation. A complex cross section, such as the one shown in Figure 18.36,  requires a higher pressure and greater force than a circular shape. The effect of the  "
    },
    {
        "type": "image",
        "img_path": "images/e30b3e9b496ae603a056fca58ffa5fbf6ae7f8ad26c8ac0db6e16f0114a6b393.jpg",
        "img_caption": "FIGURE 18.35  (a) Deﬁ  nition of die  angle in direct  extrusion; (b) effect of  die angle on ram force. "
    },
    {
        "type": "text",
        "text": "die oriﬁ  ce shape can be assessed by the die  shape factor , deﬁ  ned as the ratio of the  pressure required to extrude a cross section of a given shape relative to the extrusion  pressure for a round cross section of the same area. The shape factor can be expressed  as follows: "
    },
    {
        "type": "equation",
        "text": "\n$$\nK_{x}=0.98+0.02\\bigg(\\frac{C_{x}}{C_{c}}\\bigg)^{2.25}\n$$\n   ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $K_{x}=$  die shape factor in extrusion;  $C_{x}=$  perimeter of the extruded cross sec- tion, $\\mathrm{mm}$  (in); and $C_{c}=$  perimeter of a circle of the same area as the extruded shape,  "
    },
    {
        "type": "image",
        "img_path": "images/37fa5fe6dc0e99ca14ddceb6057e288af997f5316e30908488dfe6ddcb6ce167.jpg",
        "img_caption": "FIGURE 18.36  A complex extruded cross section for a heat sink. (Photo courtesy of Aluminum Company of America.) "
    },
    {
        "type": "text",
        "text": "mm (in). Equation (18.26) is based on empirical data in Altan et al. [1] over a range  of $C_{x}/C_{c}$  values from 1.0 to about 6.0. The equation may be invalid much beyond the  upper limit of this range. "
    },
    {
        "type": "text",
        "text": "As indicated by Equation (18.26), the shape factor is a function of the perimeter  of the extruded cross section divided by the perimeter of a circular cross section of  equal area. A circular shape is the simplest shape, with a value of  $K_{x}=1.0.$ . Hollow,  thin-walled sections have higher shape factors and are more difﬁ  cult to extrude. The  increase in pressure is not included in the previous pressure equations, Equations  (18.23(a) and (b)), which apply only to round cross sections. For shapes other than  round, the corresponding expression for indirect extrusion is "
    },
    {
        "type": "equation",
        "text": "\n$$\np=K_{x}\\,\\overline{{Y}}_{f}\\epsilon_{x}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "and for direct extrusion, "
    },
    {
        "type": "equation",
        "text": "\n$$\np=K_{x}\\,\\overline{{Y}}_{f}\\bigg(\\epsilon_{x}+\\frac{2L}{D_{o}}\\bigg)\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $p=$  extrusion pressure, MPa  $(\\mathsf{l b}/\\mathsf{i n}^{2});K_{x}=$ shape factor; and the other terms  have the same interpretation as before. Values of pressure given by these equations  can be used in Equation (18.24) to determine ram force. "
    },
    {
        "type": "text",
        "text": "Die materials used for hot extrusion include tool and alloy steels. Important prop- erties of these die materials include high wear resistance, high hot hardness, and  high thermal conductivity to remove heat from the process. Die materials for cold  extrusion include tool steels and cemented carbides. Wear resistance and ability to  retain shape under high stress are desirable properties. Carbides are used when high  production rates, long die life, and good dimensional control are required. "
    },
    {
        "type": "text",
        "text": "Extrusion presses are either horizontal or vertical, depending on orientation of the  work axis. Horizontal types are more common. Extrusion presses are usually hydrau- lically driven. This drive is especially suited to semi-continuous production of long  sections, as in direct extrusion. Mechanical drives are often used for cold extrusion of  individual parts, such as in impact extrusion. "
    },
    {
        "type": "text",
        "text": "18.5.4 OTHER EXTRUSION PROCESSES",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Direct and indirect extrusion are the principal methods of extrusion. Various names  are given to operations that are special cases of the direct and indirect methods  described here. Other extrusion operations are unique. This section examines some  of these special forms of extrusion and related processes. "
    },
    {
        "type": "text",
        "text": "Impact Extrusion  Impact extrusion is performed at higher speeds and shorter  strokes than conventional extrusion. It is used to make individual components. As  the name suggests, the punch impacts the work part rather than simply applying pres- sure to it. Impacting can be carried out as forward extrusion, backward extrusion,  or combinations of these. Some representative examples are shown in Figure 18.37. "
    },
    {
        "type": "text",
        "text": "Impact extrusion is usually done cold on a variety of metals. Backward impact  extrusion is most common. Products made by this process include toothpaste tubes  and battery cases. As indicated by these examples, very thin walls are possible on  impact extruded parts. The high speed characteristics of impacting permit large  reductions and high production rates, making this an important commercial process. "
    },
    {
        "type": "image",
        "img_path": "images/96b333cece1eb366052d79204bb8af986557bcb49cdaafadb18d5a48b91b2f59.jpg",
        "img_caption": "FIGURE 18.37  Several examples of impact extrusion: (a) forward, (b) backward, and (c) combination of forward and  backward. "
    },
    {
        "type": "text",
        "text": "Hydrostatic Extrusion  One of the problems in direct extrusion is friction along the  billet–container interface. This problem can be addressed by surrounding the billet  with ﬂ  uid inside the container and pressurizing the ﬂ  uid by the forward motion of the  ram, as in Figure 18.38. This way, there is no friction inside the container, and friction  at the die opening is reduced. Consequently, ram force is signiﬁ  cantly lower than in  "
    },
    {
        "type": "image",
        "img_path": "images/562323a537e04277b1b780ac511c33a28cebc4ec57c298b45b9c91d2d19556fc.jpg",
        "img_caption": "FIGURE 18.38  Hydrostatic extrusion. "
    },
    {
        "type": "text",
        "text": "direct extrusion. The ﬂ  uid pressure acting on all surfaces of the billet gives the proc- ess its name. It can be carried out at room temperature or at elevated temperatures.  Special ﬂ  uids and procedures must be used at elevated temperatures. Hydrostatic  extrusion is an adaptation of direct extrusion. "
    },
    {
        "type": "text",
        "text": "Hydrostatic pressure on the work increases the material’s ductility. Accordingly,  this process can be used on metals that would be too brittle for conventional extru- sion operations. Ductile metals can also be hydrostatically extruded, and high reduc- tion ratios are possible on these materials. One of the disadvantages of the process is  the required preparation of the starting work billet. The billet must be formed with  a taper at one end to ﬁ  t snugly into the die entry angle. This establishes a seal to pre- vent ﬂ  uid from squirting out the die hole when the container is initially pressurized. "
    },
    {
        "type": "text",
        "text": "18.5.5  DEFECTS IN EXTRUDED PRODUCTS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Owing to the considerable deformation associated with extrusion operations, a  number of defects can occur in extruded products. The defects can be classiﬁ  ed into  the following categories, illustrated in Figure 18.39:\n\n "
    },
    {
        "type": "text",
        "text": "(a)  Centerburst . This defect is an internal crack that develops as a result of tensile  stresses along the centerline of the work part during extrusion. Although tensile  stresses may seem unlikely in a compression process such as extrusion, they  tend to occur under conditions that cause large deformation in the regions of  the work away from the central axis. The signiﬁ  cant material movement in these  outer regions stretches the material along the center of the work. If stresses  are great enough, bursting occurs. Conditions that promote centerburst are high  die angles, low extrusion ratios, and impurities in the work metal that serve as  starting points for crack defects. The difﬁ  cult aspect of centerburst is its detec- tion. It is an internal defect that is usually not noticeable by visual observation.  Other names sometimes used for this defect include  arrowhead fracture ,  center  cracking , and  chevron cracking .\n\n "
    },
    {
        "type": "text",
        "text": "(b)  Piping . Piping is a defect associated with direct extrusion. As in Figure 18.39(b),  it is the formation of a sink hole in the end of the billet. The use of a dummy  block whose diameter is slightly less than that of the billet helps to avoid piping.  Other names given to this defect include  tailpipe  and  ﬁ  shtailing .\n\n "
    },
    {
        "type": "text",
        "text": "(c)  Surface cracking . This defect results from high work part temperatures that  cause cracks to develop at the surface. They often occur when extrusion speed  is too high, leading to high strain rates and associated heat generation. Other  factors contributing to surface cracking are high friction and surface chilling of  high temperature billets in hot extrusion. "
    },
    {
        "type": "image",
        "img_path": "images/62795f5fd9f261911e5b7f067c789d6dd60cd5b659218b6419249427af403d62.jpg"
    },
    {
        "type": "text",
        "text": " Wire and Bar Drawing ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "In the context of bulk deformation, drawing is an operation in which the cross  section of a bar, rod, or wire is reduced by pulling it through a die opening, as in  Figure 18.40. The general features of the process are similar to those of extrusion.  The difference is that the work is pulled through the die in drawing, whereas it  is pushed through the die in extrusion. Although the presence of tensile stresses  is obvious in drawing, compression also plays a signiﬁ  cant role because the metal is  squeezed down as it passes through the die opening. For this reason, the deformation  that occurs in drawing is sometimes referred to as indirect compression. Drawing is  a term also used in sheet metalworking (Section 19.3). The term  wire and bar draw- ing  is used to distinguish the drawing process discussed here from the sheet metal  process of the same name. "
    },
    {
        "type": "text",
        "text": "The basic difference between bar drawing and wire drawing is the stock size that  is processed.  Bar drawing  is the term used for large diameter bar and rod stock,  while  wire   drawing  applies to small diameter stock. Wire sizes down to  $0.03\\ \\mathrm{mm}$   (0.001 in) are possible in wire drawing. Although the mechanics of the process are  the same for the two cases, the methods, equipment, and even the terminology are  somewhat different. "
    },
    {
        "type": "text",
        "text": "Bar drawing is generally accomplished as a  single-draft  operation—the stock is  pulled through one die opening. Because the beginning stock has a large diameter, it  is in the form of a straight cylindrical piece rather than coiled. This limits the length  of the work that can be drawn, necessitating a batch type operation. By contrast,  wire is drawn from coils consisting of several hundred (or even several thousand)  feet of wire and is passed through a series of draw dies. The number of dies varies  typically between 4 and 12. The term  continuous drawing  is used to describe this  type of operation because of the long production runs that are achieved with the  wire coils, which can be butt-welded each to the next to make the operation truly  continuous. "
    },
    {
        "type": "text",
        "text": "In a drawing operation, the change in size of the work is usually given by the area  reduction, deﬁ  ned as follows: "
    },
    {
        "type": "equation",
        "text": "\n$$\nr=\\frac{A_{o}-A_{f}}{A_{o}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $r=$  area reduction in drawing; $A_{o}=$  original area of work, $\\mathrm{mm}^{2}\\left(\\mathrm{in}^{2}\\right)$ ; and $A_{f}=$ ﬁ  nal area, $\\mathrm{mm}^{2}\\,(\\mathrm{in}^{2}).$ . Area reduction is often expressed as a percentage. "
    },
    {
        "type": "text",
        "text": "In bar drawing, rod drawing, and in drawing of large diameter wire for upsetting and  heading operations, the term draft is used to denote the before and after difference in  "
    },
    {
        "type": "image",
        "img_path": "images/35e37fd478d60b9669ed26774f7aba6e50667b3f34709f9362ecf3359e45d9bf.jpg",
        "img_caption": "FIGURE 18.40  Drawing of bar, rod,  or wire. "
    },
    {
        "type": "text",
        "text": "size of the processed work. The  draft  is simply the difference between original and ﬁ  nal  stock diameters: "
    },
    {
        "type": "equation",
        "text": "\n$$\nd=D_{o}-D_{f}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $d=$  draft, mm (in); $D_{o}=$  original diameter of work,  $\\mathrm{mm}$  (in); and  $D_{f}=$  ﬁ  nal  work diameter, $\\mathrm{mm}$  (in). "
    },
    {
        "type": "text",
        "text": "18.6.1  ANALYSIS OF DRAWING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "This section considers the mechanics of wire and bar drawing. How are stresses  and forces computed in the process? How large a reduction is possible in a drawing  operation? "
    },
    {
        "type": "text",
        "text": "Mechanics of Drawing  If no friction or redundant work occurred in drawing,  true strain could be determined as follows: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\epsilon=\\ln{\\frac{A_{o}}{A_{f}}}=\\ln{\\frac{1}{1-r}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where $A_{o}$  and $A_{f}$  are the original and ﬁ  nal cross-sectional areas of the work, as previ- ously deﬁ  ned; and  $r=$ drawing reduction as given by Equation (18.28). The stress  that results from this ideal deformation is given by "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\sigma=\\overline{{Y}}_{f}\\epsilon=\\overline{{Y}}_{f}\\ln{\\frac{A_{o}}{A_{f}}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where   $\\overline{{Y}}_{f}=\\frac{K\\,\\epsilon^{n}}{1+n}$   average ﬂ  ow stress based on the value of strain given by Equation  (18.30). "
    },
    {
        "type": "text",
        "text": "Because friction is present in drawing and the work metal experiences inhomoge- neous deformation, the actual stress is larger than provided by Equation (18.31). In  addition to the ratio  $A_{o}/A_{f},$  other variables that inﬂ  uence draw stress are die angle  and coefﬁ  cient of friction at the work-die interface. A number of methods have been  proposed for predicting draw stress based on values of these parameters [1], [3], and  [19]. The equation suggested by Schey [19] is the following: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\sigma_{d}=\\overline{{Y}}_{f}\\left(1+\\frac{\\mu}{\\tan{\\alpha}}\\right)\\emptyset\\ln\\frac{A_{o}}{A_{f}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $\\sigma_{d}=$  draw stress, MPa  $\\mathrm{(lb/in^{2})}$ ;  $\\mu=$  die-work coefﬁ  cient of friction;  $\\alpha=\\mathrm{{d i e}}$ angle (half-angle) as deﬁ  ned in Figure 18.40; and  $\\phi$  is a factor that accounts for in- homogeneous deformation which is determined as follows for a round cross section: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\phi=0.88+0.12\\frac{D}{L_{c}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $D=$  average diameter of work during drawing, mm (in); and  $L_{c}=$  contact  length of the work with the draw die in Figure  $18.40,\\mathrm{mm}$  (in). Values of $D$  and $L_{c}$  can  be determined from the following: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\begin{array}{c}{D=\\displaystyle\\frac{D_{o}+D_{f}}{2}}\\\\ {L_{c}=\\displaystyle\\frac{D_{o}-D_{f}}{2\\sin\\alpha}}\\end{array}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The corresponding draw force is then the area of the drawn cross section multiplied  by the draw stress: "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=A_{f}\\sigma_{d}=A_{f}\\overline{{{Y}}}_{f}\\Big(1+\\frac{\\mu}{\\tan\\alpha}\\Big)\\emptyset\\ln\\frac{A_{o}}{A_{f}}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "where  $F=$  draw force,  $\\mathbf{N}$  (lb); and the other terms are deﬁ  ned above. The power  required in a drawing operation is the draw force multiplied by exit velocity of the  work. "
    },
    {
        "type": "text",
        "text": "Example 18.4 Stress and force  in wire drawing ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Wire is drawn through a draw die with entrance angle $=15^{\\circ}$ . Starting diameter  is $2.5\\,\\mathrm{mm}$  and ﬁ  nal diameter $=2.0\\:\\mathrm{mm}$ . The coefﬁ  cient of friction at the work- die interface $=0.07$ . The metal has a strength coefﬁ  cient  $K=205$  MPa and a  strain hardening exponent $n=0.20$ . Determine the draw stress and draw force  in this operation. "
    },
    {
        "type": "text",
        "text": "Solution:  The values of  $D$  and $L_{c}$  for Equation (18.33) can be determined  using Equations (18.34). $D=2.25\\:\\mathrm{mm}$  and $L_{c}=0.966\\,\\mathrm{mm}$ . Thus, "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\varnothing=0.88+0.12\\,{\\frac{2.25}{0.966}}=1.16\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The areas before and after drawing are computed as $A_{o}=4.91~\\mathrm{mm}^{2}$  and $A_{f}=$ $3.14~\\mathrm{mm}^{2}$ . The resulting true strain $\\epsilon=\\ln(4.91/3.14)=0.446$ , and the average  ﬂ  ow stress in the operation is computed: "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\overline{{Y}}_{f}=\\frac{205(0.446)^{0.20}}{1.20}=145.4\\:\\mathrm{MPa}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Draw stress is given by Equation (18.32): "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\sigma_{d}=(145.4)\\Big(1+\\frac{0.07}{\\tan{15}}\\Big)(1.16)(0.446)=\\mathbf{94.1\\,M P a}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Finally, the draw force is this stress multiplied by the cross-sectional area of the  exiting wire: "
    },
    {
        "type": "equation",
        "text": "\n$$\nF=94.1(3.14)=295.5\\:\\mathrm{N}\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "Maximum Reduction per Pass  A question that may occur to the reader is: Why  is more than one step required to achieve the desired reduction in wire drawing?  Why not take the entire reduction in a single pass through one die, as in extrusion?  The answer can be explained as follows. From the preceding equations, it is clear that  as the reduction increases, draw stress increases. If the reduction is large enough,  draw stress will exceed the yield strength of the exiting metal. When that happens,  the drawn wire will simply elongate instead of new material being squeezed through  the die opening. For wire drawing to be successful, maximum draw stress must be  less than the yield strength of the exiting metal. "
    },
    {
        "type": "text",
        "text": "It is a straightforward matter to determine this maximum draw stress and the  resulting maximum possible reduction that can be made in one pass, under certain  assumptions. Assume a perfectly plastic metal  $(n\\,=\\,0)$ ), no friction, and no redun- dant work. In this ideal case, the maximum possible draw stress is equal to the yield  strength of the work material. Expressing this using the equation for draw stress un- der conditions of ideal deformation, Equation (18.31), and setting  $\\overline{{Y}}_{f}=Y$  (because  $n=0$ ), "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "equation",
        "text": "\n$$\n\\sigma_{d}=\\overline{{Y}}_{f}\\ln\\frac{A_{o}}{A_{f}}=Y\\ln\\frac{A_{o}}{A_{f}}=Y\\ln\\frac{1}{1\\!-\\!r}=Y\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "This means that $\\ln(A_{o}/A_{f})=\\ln(1/(1-r))=1.$ . That is,  $\\epsilon_{\\mathrm{max}}=1.0.$ . In order for  $\\epsilon_{\\mathrm{max}}$  to  be zero, then $A_{o}/A_{f}=1/(1-r)$  must equal the natural logarithm base $e$ . Accordingly,  the maximum possible area ratio is "
    },
    {
        "type": "equation",
        "text": "\n$$\n\\frac{A_{o}}{A_{f}}=e=2.7183\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "and the maximum possible reduction is "
    },
    {
        "type": "equation",
        "text": "\n$$\nr_{\\operatorname*{max}}={\\frac{e\\!-\\!1}{e}}=0.632\n$$\n ",
        "text_format": "latex"
    },
    {
        "type": "text",
        "text": "The value given by Equation (18.37) is often used as the theoretical maximum  reduction possible in a single draw, even though it ignores (1) the effects of friction  and redundant work, which would reduce the maximum possible value, and (2) strain  hardening, which would increase the maximum possible reduction because the exiting  wire would be stronger than the starting metal. In practice, draw reductions per pass  are quite below the theoretical limit. Reductions of 0.50 for single-draft bar drawing  and 0.30 for multiple-draft wire drawing seem to be the upper limits in industrial  operations. "
    },
    {
        "type": "text",
        "text": "18.6.2  DRAWING PRACTICE ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Drawing is usually performed as a cold-working operation. It is most frequently used  to produce round cross sections, but squares and other shapes are also drawn. Wire  drawing is an important industrial process, providing commercial products such as  electrical wire and cable; wire stock for fences, coat hangers, and shopping carts;  and rod stock to produce nails, screws, rivets, springs, and other hardware items. Bar  drawing is used to produce metal bars for machining, forging, and other processes. "
    },
    {
        "type": "text",
        "text": "Advantages of drawing in these applications include (1) close dimensional con- trol, (2) good surface ﬁ  nish, (3) improved mechanical properties such as strength  and hardness, and (4) adaptability to economical batch or mass production. Draw- ing speeds are as high as $50\\;\\mathrm{m}/\\mathrm{s}$  ( $(10\\small{,}000\\,\\mathrm{ft/min})$ ) for very ﬁ  ne wire. In the case of bar  drawing to provide stock for machining, the operation improves the machinability  of the bar (Section 23.1). "
    },
    {
        "type": "text",
        "text": "Drawing Equipment   Bar drawing is accomplished on a machine called a  draw  bench , consisting of an entry table, die stand (which contains the draw die), carriage,  and exit rack. The arrangement is shown in Figure 18.41. The carriage is used to pull  the stock through the draw die. It is powered by hydraulic cylinders or motor-driven  chains. The die stand is often designed to hold more than one die, so that several bars  can be pulled simultaneously through their respective dies. "
    },
    {
        "type": "text",
        "text": "Wire drawing is done on continuous drawing machines that consist of multiple  draw dies, separated by accumulating drums between the dies, as in Figure 18.42.  Each drum, called a  capstan , is motor-driven to provide the proper pull force to  "
    },
    {
        "type": "image",
        "img_path": "images/0cdd0aeaae37bcabb1ec116ba35f80e866b715c4afaf1b6ec57a643ee6bfd261.jpg"
    },
    {
        "type": "image",
        "img_path": "images/55af0e67758ee45ddedae21d9f21c4b387ae29f65cb34ea54671de786ce6ebf2.jpg",
        "img_caption": "FIGURE 18.42  Continuous drawing of wire. "
    },
    {
        "type": "text",
        "text": "draw the wire stock through the upstream die. It also maintains a modest tension on  the wire as it proceeds to the next draw die in the series. Each die provides a certain  amount of reduction in the wire, so that the desired total reduction is achieved by the  series. Depending on the metal to be processed and the total reduction, annealing of  the wire is sometimes required between groups of dies in the series. "
    },
    {
        "type": "text",
        "text": "Draw Dies  Figure 18.43 identiﬁ  es the features of a typical draw die. Four regions  of the die can be distinguished: (1) entry, (2) approach angle, (3) bearing surface  (land), and (4) back relief. The  entry  region is usually a bell-shaped mouth that does  not contact the work. Its purpose is to funnel the lubricant into the die and prevent  scoring of work and die surfaces. The  approach  is where the drawing process occurs.  It is cone-shaped with an angle (half-angle) normally ranging from about $6^{\\circ}$  to  $20^{\\circ}$ .  The proper angle varies according to work material. The  bearing surface , or  land ,  determines the size of the ﬁ  nal drawn stock. Finally, the  back relief  is the exit zone.  "
    },
    {
        "type": "image",
        "img_path": "images/3f5c3499a07722d761b09ef1dd2eb1d09f4f7515caed39c815f494dac29de696.jpg",
        "img_caption": "FIGURE 18.43  Draw  die for drawing of round  rod or wire. "
    },
    {
        "type": "text",
        "text": "It is provided with a back relief angle (half-angle) of about  $30^{\\circ}$ . Draw dies are made  of tool steels or cemented carbides. Dies for high-speed wire drawing operations  frequently use inserts made of diamond (both synthetic and natural) for the wear  surfaces. "
    },
    {
        "type": "text",
        "text": "Preparation of the Work   Prior to drawing, the beginning stock must be properly  prepared. This involves three steps: (1) annealing, (2) cleaning, and (3) pointing. The  purpose of annealing is to increase the ductility of the stock to accept deformation  during drawing. As previously mentioned, annealing is sometimes needed between  steps in continuous drawing. Cleaning of the stock is required to prevent damage of  the work surface and draw die. It involves removal of surface contaminants (e.g., scale  and rust) by means of chemical pickling or shot blasting. In some cases, prelubrication  of the work surface is accomplished subsequent to cleaning. "
    },
    {
        "type": "text",
        "text": "Pointing  involves the reduction in diameter of the starting end of the stock so that  it can be inserted through the draw die to start the process. This is usually accom- plished by swaging, rolling, or turning. The pointed end of the stock is then gripped  by the carriage jaws or other device to initiate the drawing process. "
    },
    {
        "type": "text",
        "text": "18.6.3  TUBE DRAWING ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Drawing can be used to reduce the diameter or wall thickness of seamless tubes and  pipes, after the initial tubing has been produced by some other process such as extru- sion. Tube drawing can be carried out either with or without a mandrel. The simplest  method uses no mandrel and is used for diameter reduction, as in Figure 18.44. The  term  tube sinking  is sometimes applied to this operation. "
    },
    {
        "type": "image",
        "img_path": "images/1f2351138af57c8eeab8e0c5e29f5e1fd8bd9b4dc00b46d14a315d9422f0e142.jpg",
        "img_caption": "FIGURE 18.44  Tube drawing with  no mandrel (tube sinking). "
    },
    {
        "type": "image",
        "img_path": "images/542073b4c5365ccc102a2338773c981961b44178a953427e2a8b76c1046d18da.jpg",
        "img_caption": "FIGURE 18.45  Tube drawing with mandrels: (a) ﬁ  xed mandrel, (b) ﬂ  oating plug. "
    },
    {
        "type": "text",
        "text": "The problem with tube drawing in which no mandrel is used, as in Figure 18.44, is  that it lacks control over the inside diameter and wall thickness of the tube. This is  why mandrels of various types are used, two of which are illustrated in Figure 18.45.  The ﬁ  rst, Figure 18.45(a), uses a  ﬁ  xed mandrel  attached to a long support bar to  establish inside diameter and wall thickness during the operation. Practical limita- tions on the length of the support bar in this method restrict the length of the tube  that can be drawn. The second type, shown in (b), uses a  ﬂ  oating plug  whose shape  is designed so that it ﬁ  nds a “natural” position in the reduction zone of the die. This  method removes the limitations on work length present with the ﬁ  xed mandrel. "
    },
    {
        "type": "text",
        "text": "References ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": " [1] Altan, T., Oh, S-I, and Gegel, H. L.  Metal Form- ing: Fundamentals and Applications . ASM  International, Materials Park, Ohio, 1983.\n\n  [2]  ASM Handbook , Vol. 14A:  Metalworking:  Bulk Forming . ASM International, Materials  Park, Ohio, 2005.\n\n  [3] Avitzur, B.  Metal Forming: Processes and  Analysis . Robert E. Krieger Publishing Com- pany, Huntington, New York, 1979.\n\n  [4] Black, J. T., and Kohser, R. A.  DeGarmo’s  Materials and Processes in Manufacturing , 11th ed. John Wiley & Sons, Hoboken, New  Jersey, 2012.\n\n  [5] Byrer, T. G., et al. (eds.).  Forging Handbook . Forging Industry Association, Cleveland, Ohio;  and American Society for Metals, Metals Park,  Ohio, 1985.\n\n  [6] Cook, N. H.  Manufacturing Analysis . Addison- Wesley Publishing Company, Inc., Reading,  Massachusetts, 1966.\n\n  [7] Groover, M. P . “An Experimental Study of the  Work Components and Extrusion Strain in the  Cold Forward Extrusion of Steel.”  Research  Report . Bethlehem Steel Corporation, Bethle- hem, Pennsylvania, 1966.\n\n "
    },
    {
        "type": "text",
        "text": " [8] Harris, J. N.  Mechanical Working of Metals .   Pergamon Press, Oxford, UK, 1983.\n\n  [9] Hosford, W. F., and Caddell, R. M.  Metal Form- ing: Mechanics and Metallurgy , 3rd ed. Cam- bridge University Press, Cambridge, U. K., 2007.\n\n [10] Jensen, J. E. (ed.).  Forging Industry Handbook .   Forging Industry Association, Cleveland, Ohio,  1970.\n\n [11] Johnson, W. “The Pressure for the Cold Extru- sion of Lubricated Rod Through Square Dies of  Moderate Reduction at Slow Speeds.”  Journal  of the Institute of Metals . Vol. 85, 1956.\n\n [12] Kalpakjian, S.  Mechanical Processing of  Materials . D. Van Nostrand Company, Inc.,  Princeton, New Jersey, 1967.\n\n [13] Kalpakjian, S., and Schmid, S. R.  Manufactur- ing Processes for Engineering Materials , 6th ed.  Pearson Prentice Hall, Upper Saddle River, New  Jersey, 2010. "
    }
]