[
    {
        "type": "text",
        "text": "36 Nanofabrication  Technologies ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Chapter Contents ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "36.1 Nanotechnology Products and  Applications "
    },
    {
        "type": "text",
        "text": "36.1.1 Classiﬁ  cation of Products and  Applications 36.1.2 Carbon Nanostructures 36.1.3 The National Nanotechnology  Initiative\n\n "
    },
    {
        "type": "text",
        "text": "36.2 Introduction to Nanoscience "
    },
    {
        "type": "text",
        "text": "36.2.1 Size Matters 36.2.2 Scanning Probe Microscopes "
    },
    {
        "type": "text",
        "text": "36.3 Nanofabrication Processes ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "36.3.1 Top-Down Processing  Approaches 36.3.2 Bottom-Up Processing  Approaches "
    },
    {
        "type": "text",
        "text": "The trend in miniaturization is continuing beyond the  micrometer range into the nanometer (nm) scale.  Nano- technology  refers to the fabrication and application of  entities whose feature sizes range from less than  $1~\\mathrm{nm}$   to $100\\,\\mathrm{nm}$   $(1\\,\\mathrm{nm}=10^{-3}\\,\\mu\\mathrm{m}=10^{-6}\\,\\mathrm{mm}=10^{-9}\\,\\mathrm{m})$ ).  The  entities include ﬁ  lms, coatings, dots, lines, wires, tubes,  structures, and systems. The preﬁ  x “nano” is used for  these items; thus, new words such as nanotube, nano- structure, nanoscale, and nanoscience have entered the  vocabulary.  Nanoscience  is the ﬁ  eld of scientiﬁ  c study  that is concerned with objects in the same size range.  Nano  scale  refers to dimensions within this range and  slightly below, which overlaps on the lower end with the  sizes of atoms and molecules. For example, the smallest  atom is hydrogen with a diameter close to  $0.1\\,\\mathrm{\\nm}$ ,  whereas the largest of the naturally occurring atoms is  uranium with a diameter of about  $0.4\\,\\mathrm{nm}$  [4]. Molecules  tend to be larger because they consist of multiple atoms.  Molecules made up of about 30 atoms are roughly  $1\\;\\mathrm{nm}$   in size, depending on the elements involved. Thus, nano- science involves the behavior of individual molecules  and the principles that explain this behavior, and nano- technology involves the application of these principles  to create useful products. "
    },
    {
        "type": "text",
        "text": "In the previous chapter, an overview of the products  and devices in microsystem technology was provided.  This chapter gives the same type of overview for nano- technology. What are the currently available and poten- tial future products and materials? Nanotechnology  invol  ves not just a reduction in scale by three orders of  magnitude. The science is different when the sizes of the  entities approach the molecular and atomic levels. Some  of these differences are discussed in Section 36.2. Finally,  in Section 36.3, the two major categories of fabrication  processes used in nanotechnology are described. "
    },
    {
        "type": "text",
        "text": " Nanotechnology Products and Applications ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Most products in nanotechnology are not just smaller versions of microsystem  technology (MST) products; they also include new materials, coatings, and unique  entities that are not included within the scope of MST. Nanoscale products and  processes that have been around for a while include the following:\n\n "
    },
    {
        "type": "text",
        "text": "$\\succcurlyeq$ The colorful stained-glass windows of churches built during the Middle Ages  were based on gold particles of nanometer scale imbedded in the glass. Depend- ing on their size, the particles can take on a variety of different colors.\n\n $\\succcurlyeq$ Chemical photography dates back more than 150 years and depends on the for- mation of silver halide nanoparticles to create the image in the photograph.\n\n $\\succcurlyeq$ Nanoscale particles of carbon are used as reinforcing ﬁ  llers in automobile tires.\n\n $\\succcurlyeq$ Catalytic converters in the exhaust systems of modern automobiles use nano- scale coatings of platinum and palladium on a ceramic honeycomb structure.  The metal coatings act as catalysts to convert harmful emission gases into  harmless gases. "
    },
    {
        "type": "text",
        "text": "It should also be mentioned that the fabrication technology for integrated cir- cuits now includes feature sizes that are in the nanotech range. Of course, integrated  circuits have been produced since the 1960s, but only in recent years have nanoscale  features been achieved.  "
    },
    {
        "type": "text",
        "text": "Other more recent products and applications of nanotechnology include  cosmetics, sun lotions, car polishes and waxes, coatings for eyeglass lenses, and  scratch-resistant paints. All of these categories contain nanoscale particles (nano- particles), which qualiﬁ  es them as products of nanotechnology. A more complete  list of examples of present and future products and materials based on nano- technology is presented in Table 36.1. "
    },
    {
        "type": "text",
        "text": "36.1.1  CLASSIFICATION OF PRODUCTS AND APPLICATIONS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Nanotechnology products and applications can be organized into three categories:  (1) incremental, (2) evolutionary, and (3) radical [4].   Incremental nanotechnology refers to products and applications in which nanoscale particles are used in great  numbers to produce materials with unique and worthwhile properties or character- istics that could not be achieved as well by using larger particles. It is the presence  of the nanoparticles functioning in aggregate that distinguishes incremental nano- technology. All of the examples listed above are in this category, except chemical  photography and integrated circuits. "
    },
    {
        "type": "text",
        "text": "Evolutionary nanotechnology  involves the use of nanoparticles in great numbers  that each accomplishes some unique and worthwhile purpose. The presence of nano- particles functioning individually is what distinguished this category of nanotechnology.  It could be argued that chemical photography is an example of evolutionary nano- technology because of the individual responses of different regions of the ﬁ  lm to the  projected light from the image. Other examples are difﬁ  culty to identify. One might  imagine an array of trillions of nanoparticles being used in a data storage device or an  "
    },
    {
        "type": "text",
        "text": "TABLE  •  36.1  Examples of present and future products and materials that are based on nanotechnology. ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Computers . Carbon nanotubes (Section 36.1.2) are strong candidates to substitute for silicon-based electronics as  the limits of size reduction are approached in the lithography-based processes used to make integrated circuits on  silicon wafers. These limits are expected to be reached around the year 2015. "
    },
    {
        "type": "text",
        "text": "Materials . Nanoscale particles (nanodots) and ﬁ  bers (nanowires) may prove to be useful reinforcing agents  for composite materials. For example, the truck bed for one of General Motors’ Hummer vehicles is made with  nanocomposites. Entirely new material systems, not known today, may be possible with nanotechnology. "
    },
    {
        "type": "text",
        "text": "Nanoparticle catalysts . Metal nanoparticles and coatings of noble metals (e.g., gold, platinum) on ceramic sub- strates act as catalysts for certain chemical reactions. Catalytic converters in automobiles are an important example. "
    },
    {
        "type": "text",
        "text": "Cancer drugs . Nanoscale drugs are being developed that will be designed to match the speciﬁ  c genetic proﬁ  le of  the cancer cells of a patient and to attack and destroy the cells. For example, Abraxine is a nanoscale protein-based  medicine produced by American Pharmaceutical that is used to treat metastatic breast cancer. "
    },
    {
        "type": "text",
        "text": "Solar energy . Nanoscale surface ﬁ  lms have the potential to absorb more of the sun’s electromagnetic energy than  existing photovoltaic receptacles. Developments in this area may reduce reliance on fossil fuels for power generation. "
    },
    {
        "type": "text",
        "text": "Coatings . Nanoscale coatings and ultra-thin ﬁ  lms are being developed that will increase scratch resistance of  surfaces (eyeglass lenses with such coatings are already available), stain resistance of fabrics, and self-cleaning  capabilities for windows and other surfaces (the “lotus effect”). "
    },
    {
        "type": "text",
        "text": "Flat screen displays  for television and computer monitors. TV screens based on carbon nanotubes are being  developed for introduction in 2006. They are expected to be brighter, less expensive, and more energy efﬁ  cient  than current displays. They will be produced by Samsung Electronics of South Korea. "
    },
    {
        "type": "text",
        "text": "Portable medical laboratories . Instruments based on nanotechnology will provide fast analysis of a variety of  ailments such as diabetes and HIV. "
    },
    {
        "type": "text",
        "text": "Batteries . Carbon nanotubes may be future components in high-powered batteries and storage devices for hydro- gen. Hydrogen storage will no doubt play a role in converting from fossil-fuel motors to hydrogen-based engines. "
    },
    {
        "type": "text",
        "text": "Light sources . Lamps are being developed based on nanotechnology that use a fraction of the energy of an  incandescent light bulb and never burn out. "
    },
    {
        "type": "text",
        "text": "Based mostly on [1] and [24]. "
    },
    {
        "type": "text",
        "text": "ultrahigh-resolution imaging device. As a storage device, each particle stores one bit  of data that is individually addressable. As an imaging device, each particle emits its  own color and brightness that are individually controllable; taken together, an image  is formed. "
    },
    {
        "type": "text",
        "text": "Radical nanotechnology  is concerned with the construction of microscopic  machines that consist of nanoscale features and mechanisms. This nanotechnology  category sub  divides into two branches: molecular manufacturing and nanorobots.  "
    },
    {
        "type": "text",
        "text": "Molecular manufacturing  envisions the possibility of constructing some macro- scopic entity by assembl  ing the atoms that comprise it. One way of doing this is by  moving atoms or molecules one by one to controlled locations to accomplish the  assembly. This approach involves the use of scanning probe techniques, discussed in  Section 36.3.2. It is of scientiﬁ  c interest but not a practical production process. An  alternative and more realistic approach, also discussed in Section 36.3.2, involves  self-assembly, in which the atoms and/or molecules are guided by physical or  chemical laws to build the macroscopic entity. "
    },
    {
        "type": "text",
        "text": "The other branch of radical nanotechnology is more futuristic. It conceives of  nanoscale robots (i.e.,  nanorobots  or  nanobots ) that are equipped with some form  of intelligence and a gripper with which they could assemble atoms and molecules.  Such devices could be used to perform molecular manufacturing, if there were a  sufﬁ  cient number of nanorobots on the job. The scary aspect of the nanobot concept  is that these molecular machines could also self-replicate, perhaps increasing their  numbers at an exponential rate to wreak havoc on earth. "
    },
    {
        "type": "text",
        "text": "The notion of nanoscale machines, which is the basis of radical nanotechnology,  is reminiscent of micro electromechanical systems (MEMS), an important product  category in microsystem technology. MEMS have found many applications in the  computer, medical, and automotive industries (Section 35.1.2). With the advent  of nanotechnology, there is growing interest in extending the develop  ment of  these kinds of devices into the nanoscale range. The term for this is  nanoelectro- mechanical systems  (NEMS), which are the sub-micron sized counter  parts of  MEMS devices, only their smaller sizes would result in even greater potential  advantages. An important NEMS structural product currently produced is the  probe used in atomic force microscopes (Section 36.2.2). The sharp point on the  probe is of nanoscale size. Nanosensors are another developing application. Nano- sensors would be more accurate, faster responding, and operate with lower power  requirements than larger sensors. Current NEMS sensor applications include  accelerometers and chemical sensors. It has been suggested that multiple nano- sensors could be distributed throughout the subject area to collect data, thus pro- viding the beneﬁ  t of multiple readings of the variable of interest, rather than  using a single larger sensor at one location. "
    },
    {
        "type": "text",
        "text": "Formidable technical problems arise in attempting to build nanorobots and other  nanomachines , deﬁ  ned as nanosystems that consist of movable parts and at least  two different materials [8]. The problems result from the fact that the part surfaces  cannot be made smooth and part edges and corners cannot be made sharp at the  atomic and molecular sizes. Other surface characteristics also come into play, as dis- cussed in Section 36.2.1. "
    },
    {
        "type": "text",
        "text": "36.1.2 CARBON NANOSTRUCTURES",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Two structures of signiﬁ  cant scientiﬁ  c and commercial interest in nanotechnology  are carbon bucky balls and nanotubes. They are basically graphite layers that have  been formed into spheres and tubes, respectively. "
    },
    {
        "type": "text",
        "text": "Fullerenes (Bucky Balls)   The name “bucky ball” refers to the molecule $\\mathrm{{C}_{60}}$ , which  contains exactly 60 carbon atoms and is shaped like a soccer ball, as in Figure 36.1.  "
    },
    {
        "type": "text",
        "text": "The original name of the molecule was  buck minister fullerene , after the architect/ inventor R. Buckminister Fuller, who designed the geodesic dome that resembles the  $\\mathrm{{C}_{60}}$  structure. Today,  $\\mathrm{{C}_{60}}$  is simply called a  fullerene , which refers to any closed hollow  carbon molecules that consist of 12 pentagonal and various numbers of hexa  gonal  faces. In the case of $\\mathrm{{C}_{60}}$ , the 60 atoms are arranged symmetrically into 12 penta  gonal  faces and 20 hexagonal faces to form a ball. These molecular balls can be bonded  together by van der Waals forces (Section 2.2) to form crystals whose lattice struc- ture is face-centered cubic (Figure 2.8(b), Section 2.3.1). The separation between  any molecule and its closest neighbor in the  $\\mathrm{{C}_{60}}$  lattice structure is $1\\;\\mathrm{nm}$ . The bonded  assembly of multiple fullerenes is called a fullerite.  "
    },
    {
        "type": "text",
        "text": "Fullerenes and fullerites are of interest for a number of reasons. One is their  electrical properties and the capability to alter these properties. A  $\\mathrm{{C}_{60}}$  crystal has  the properties of an insulator. However, when doped with an alkaline metal such  as potassium (forming  ${\\mathrm{K}}_{3}{\\mathrm{C}}_{60,}$ ), it is transformed into an electrical conductor. More- over, it exhibits properties of a superconductor at temperatures of around  $18^{\\circ}\\mathrm{K}$ .  Another potential application area for the $\\mathrm{{C}_{60}}$  fullerenes is in the medical ﬁ  eld. The  $\\mathrm{{C}_{60}}$  molecule has many possible attachment points for focused drug treatments.  Other possible medical applications for bucky balls include antioxidants, burn  creams, and diagnostic imaging. "
    },
    {
        "type": "text",
        "text": "Carbon Nanotubes   Carbon nanotubes (CNTs) are another molecular struc- ture consisting of carbon atoms bonded together in the shape of a long tube.  The atoms can be arranged into a number of alternative conﬁ  gurations, three  of which are illustrated in Figure 36.2. The nanotubes shown in the ﬁ  gure are all  "
    },
    {
        "type": "image",
        "img_path": "images/0c84e917b16f431f9fc8c9e7d153dda483d7fcce4760761b250f239927c759ed.jpg",
        "img_caption": "FIGURE 36.2  Several  possible structures of carbon  nanotubes: (a) armchair, (b) zigzag, and (c) chiral.  (Reprinted by permission  from [18].) "
    },
    {
        "type": "text",
        "text": "single-walled nanotubes (SWNT), but multi-walled structures (MWNT) can also  be fabricated, which are tubes within a tube. A SWNT has a typical diameter of  a few nanometers (down to $\\sim1\\;\\mathrm{nm}$ ) and a length of  $\\sim100\\ \\mathrm{nm}$ , and it is closed at  both ends. Much larger SWNTs are possible, and the longest one on record is  $18~\\mathrm{mm}$   $\\sim3/4$  in) long and $20~\\mathrm{{nm}}$  in diameter [4]. That is a length–to–diameter  ratio of 900,000:1. "
    },
    {
        "type": "text",
        "text": "The electrical properties of nanotubes are unusual. Depending on the struc- ture and diameter, nanotubes can have metallic (conducting) or semiconducting  proper  ties. Conductivity of metallic nanotubes can be superior to that of copper  by six orders of magnitude [8]. The explanation for this is that nanotubes contain  few of the defects existing in metals that tend to scatter electrons, thus increasing  electrical resistance. Because nanotubes have such low resistance, high currents do  not increase their temperature the way metals heat up under the same electrical  loads. Thermal conductivity of metallic nanotubes is also very high. These electrical  and thermal properties are of signiﬁ  cant interest to manufacturers of computers  and inte  grated circuits because they may allow higher clock speeds of processors  without the heat buildup problems currently encountered as the density of compo- nents on a silicon chip increases. Clock speeds  $10^{4}$  times faster than current-day  processors may be possible [18], along with much higher densities. "
    },
    {
        "type": "text",
        "text": "Another electrical property of carbon nanotubes is ﬁ  eld emission, in which elec- trons are emitted from the ends of the tubes at very high rates when an electrical ﬁ  eld  is applied parallel to the axis of a nanotube. The possible commercial applications of  ﬁ  eld emission properties of nanotubes include ﬂ  at panel displays for televisions and  computer monitors. "
    },
    {
        "type": "text",
        "text": "Mechanical properties are another reason for the interest in single-walled  nano  tubes. Compared with steel, density is only 1/6, modulus of elasticity is ﬁ  ve  times higher, and tensile strength is  $\\sim100$  times greater [8]. Yet, when SWNTs  are bent, they exhibit great resilience to return to their previous shape without  damage. These mechanical properties present opportunities for using them in  applications ranging from reinforcing materials in polymer matrix composites  (Section 9.4) to ﬁ  ber cloths in bulletproof vests. Ironically, multiwalled nano- tubes are not as strong. "
    },
    {
        "type": "text",
        "text": "36.1.3 THE NATIONAL NANOTECHNOLOGY INITIATIVE",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "In the year 2000, a national initiative on nanotechnology was enacted by the U.S.  Congress at a funding level of $\\S400$  million starting in 2001. Funding levels have  increased in what is now called the National Nanotechnology Initiative (NNI). A  total of  $\\S3.7$  billion was allocated over the 4-year period starting in 2005, making  it the largest federally funded R&D program since the Apollo Space Program.  The NNI Act mandated the coordination of nanotechnology research and develop- ment activities in the various federal agencies that are involved in this technology,  includ  ing the Departments of Defense and Energy, the National Science Founda- tion, National Institutes of Health, National Insti  tute of Standards and Techno- logy, and the National Aeronautics and Space Administration. In addition, the Act  deﬁ  ned nine areas of nanotechnology develop  ment (referred to as the NNI Grand  Challenges) that will affect the lives of virtually all U.S. citizens. Table 36.2 brieﬂ  y  describes the nine areas of nano  technology development to provide an overview  of the future opportunities envi  sioned for this technology. "
    },
    {
        "type": "text",
        "text": "TABLE  •  36.2  Nine areas of nanotechnology development identiﬁ  ed in the National Nanotechnology Initiative (NNI). ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Nanostructured materials by design . The objective is to develop materials that are stronger, harder, lighter,  safer, and smarter; and to also devise materials that possess self-repairing characteristics. The research will focus  on (1) understanding the relationships between a material’s nanostructure and its macroscopic properties and  (2) development of new methods of fabrication and measurement. "
    },
    {
        "type": "text",
        "text": "Nanoelectronics, optoelectronics, and magnetics . The objectives include developing new devices and fabrication  technologies in these areas for integration into existing systems and new architectures (e.g., new circuit architectures  to address the limits of present trends in silicon-based integrated circuit fabrication technologies). "
    },
    {
        "type": "text",
        "text": "Advanced health care, therapeutics, and diagnosis . The objectives are to (1) improve health of humans by the  development of new biosensors and medical imaging technologies, (2) develop nano-based devices that can be  used to direct the delivery of medications to targeted sites in the human body, (3) improve biological implants  by means of nanoscale processing of the implant interface with the bone, (4) develop nanoscale-based devices to  enable sight and hearing, and (5) devise improved diagnostic techniques using gene sequencing methods. "
    },
    {
        "type": "text",
        "text": "Nanoscaled processes for environmental improvement . The objectives are to (1) ﬁ  nd new methods to measure  pollutants based on nanotechnology, (2) develop new ways of removing submicroscopic pollutants from the air  and water, and (3) extend scientiﬁ  c knowledge about nanoscale phenomena that are important to maintaining  environmental quality and reducing undesirable emissions. "
    },
    {
        "type": "text",
        "text": "Efﬁ  cient energy conversion and storage . The objectives include developing (1) more efﬁ  cient energy sources using  nanocrystal catalysts, (2) more efﬁ  cient solar cells, (3) efﬁ  cient photoactive materials for solar conversion of materials  into fuels, and (4) high-efﬁ  ciency light sources. Additional activities include exploring the use of carbon nanotubes  for high-density storage of hydrogen and improving the efﬁ  ciency of heat exchangers using ﬂ  uids with suspended  nanocrystalline particles. "
    },
    {
        "type": "text",
        "text": "Microcraft space exploration and industrialization . The objectives are to (1) reduce the size of spacecraft by  an order of magnitude, (2) utilize the light weight and high strength of nanostructured materials to reduce fuel  consumption, (3) enable autonomous decision making and increased data storage by means of nanoelectronics and  nanomagnetics, and (4) utilize self-repairing materials to extend the reach of space exploration. "
    },
    {
        "type": "text",
        "text": "Bionanosensor devices for communicable disease and biological threat detection . The objectives include  (1) improving detection of and response to threats from chemical and biological warfare and from human disease,  (2) increasing human capabilities and improving health by means of nanoscale devices, and (3) performing research  on the compatibility between nanoscale materials and living tissue. "
    },
    {
        "type": "text",
        "text": "Application to economical and safe transportation . The objectives include developing (1) more efﬁ  cient  transportation modes using nanomaterials that are lighter and have lower failure rates, (2) more durable  materials for roads and bridges, (3) smart materials and devices capable of detecting imminent failure and  performing self-repair processes, (4) nanoscale coatings with low friction and low corrosion properties, and  (5) nanoscale performance sensors. "
    },
    {
        "type": "text",
        "text": "National security . The general objective is to achieve military dominance at lower cost and manpower, and to  reduce the risks of personnel engaged in combat. Proposed research and development activities include (1) improving  knowledge superiority by increasing processor speed, storage capacity, access speed, display technology, and  communications capability, (2) use of materials with better properties for military systems, and (3) sensor technologies  to protect combat personnel and enhance their ﬁ  ghting capabilities. "
    },
    {
        "type": "text",
        "text": "Compiled from [14]. "
    },
    {
        "type": "text",
        "text": " Introduction to Nanoscience ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The ﬁ  elds of nanoscience and nanotechnology are interdisciplinary. They rely on the  synergistic contributions of chemistry, physics, various engineering disciplines, and  computer science. The ﬁ  elds of biology and medical science are also involved. Biology  operates in the nanoscale range. Proteins, basic substances in living organisms, are  large molecules ranging in size between about $4\\;\\mathrm{nm}$  and  $50~\\mathrm{nm}$ . Proteins are made  up of amino acids (organic acids containing the amino group  $\\mathrm{NH}_{2}$ ), whose mole- cular size is about $0.5\\,\\mathrm{nm}$ . Each protein molecule consists of combinations of various  amino acid molecules 3  connected together to form a long chain (call it a nano  wire).  This long macromolecule twists and turns to compact itself into a mass with a cross  section in the 4- to $50{\\mathrm{-nm}}$  range. Other biological entities of nanoscale size include  chlorophyll molecules in plants (about $1\\;\\mathrm{nm}$ ), hemoglobin in blood  $(7\\,\\mathrm{nm})$ , and ﬂ  u  viruses  $(60\\;\\mathrm{nm})$ ). Biological cells are orders of magnitude larger. For example, a red  blood cell is disk-shaped with diameter of about  $8000\\;\\mathrm{nm}$   $(8\\ \\mu\\mathrm{m})$  and thickness of  about  $1500~\\mathrm{nm}$   $(1.5\\ \\mu\\mathrm{m})$ ). The diameter of the human hair shown in Figure 35.3 is  approximately $100{,}000\\:\\mathrm{nm}\\left(0.1\\:\\mathrm{mm}\\right)$ . "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "The focus in this chapter is on nanoscale entities that are nonbiological. As in  biology, nanotechnology deals with objects that are not much bigger than the atoms  and molecules that comprise them. Section 36.2.1 discusses these “size effects” and  how material properties are affected when the dimensions of an entity are measured  in nanometers. The inability to “see” nanoscale objects has inhibited developments  in nanotechnology until recently. The advent of scanning probe microscopes in the  1980s has allowed objects at the molecular level to be visualized and measured.  These types of microscopes are described in Section 36.2.2. "
    },
    {
        "type": "text",
        "text": "36.2.1  SIZE MATTERS ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "One of the physical effects that occurs with very small objects is that their surface  properties become much more important relative to their bulk properties. Consider  the surface-to-volume ratio of a given amount of material as its dimensions are  changed. Starting with a cubic block of material that is one meter on each side, its  total surface area is $6\\;\\mathrm{m}^{2}$ , and its volume is  $1\\;\\mathrm{m}^{3}$ , giving it a surface-to-volume ratio  of 6–to–1. If that same volume of material were now compressed into a ﬂ  at square  plate that is  $1\\ \\mu\\mathrm{m}$  thick (0.00004 in, or about $1/100$  the diameter of a human hair),  its dimensions would be $1000\\,\\mathrm{m}$  on each side, and its total surface area (top, bottom,  and edges) would be  $2{,}000{,}000{.}004{\\mathrm{~m}}^{2}$   $(1,\\!000\\times1,\\!000\\:\\mathrm{m}^{2}$  on each of two sides, plus  $0.001\\;\\mathrm{m}^{2}$  on each of the four edges). This would give it a surface–to–volume ratio of  slightly greater than 2,000,000-to-1. "
    },
    {
        "type": "text",
        "text": "Next, suppose the ﬂ  at plate were sliced in two directions to create cubes that are  $1\\,\\mu\\mathrm{m}\\times1\\,\\mu\\mathrm{m}\\times1\\,\\mu\\mathrm{m}$ . The total number of cubes would be $10^{18}$ , and the surface area  of each cube would be  $6~\\mu\\mathrm{m}^{2}$  or  $6(10^{-12})~\\mathrm{m}^{2}$ . Multiplying the surface area of each  cube by the number of cubes gives a total surface area of  $6{,}000{,}000{\\:}\\mathrm{m}^{2}$ , or a surface– to–volume ratio of 6,000,000–to–1 for the original amount of material. "
    },
    {
        "type": "text",
        "text": "A cube that is  $1\\;\\mu\\mathrm{m}$  on each side is surely small, but in nanometers, it is $1000\\;\\mathrm{nm}$   on each edge. Suppose the molecules of this material are cube-shaped, and from the  earlier discussion, each molecule measures $1\\,\\mathrm{nm}$  on a side (admittedly, the molecular  cube shape is a stretch, but the 1-nm size is plausible). This means that the $1{\\mathrm{-}}\\mu\\mathrm{m}$  cube  contains  $10^{9}$  molecules, of which  $6(10^{6})$  are on the surface of the cube. This leaves  $10^{9}-6(10^{6})=994(10^{6})$  molecules that are internal (beneath the surface). The ratio  of internal to surface molecules is 994–to–6 or  $165.667\\mathrm{-to-}1$ . By comparison, the  same ratio for a cube with  $1\\textrm{m}$  on a side is about  $10^{27}$ –to–1. As the size of the cube  decreases, the ratio of internal–to–surface molecules continues to get smaller and  smaller, until ﬁ  nally, there is a cube that is $1\\;\\mathrm{nm}$  on a side (the size of the molecule  itself), and there are no internal molecules. "
    },
    {
        "type": "text",
        "text": "What this numerical exercise demonstrates is that as the size of an object decreases,  approaching nanometer dimensions, the surface molecules become increasingly impor- tant relative to the internal molecules simply because of their increasing numerical  proportion. Thus, the surface properties of the materials out of which nanometer-sized  objects are made become more inﬂ  uential in determining the behavior of the objects,  and the relative inﬂ  uence of the bulk properties of the material is reduced. "
    },
    {
        "type": "text",
        "text": "Recall from Section 2.2 that there are two types of atomic bonding: (1) pri  mary  bonds that are generally associated with combining atoms into molecules and  (2) secondary bonds that attract molecules together to form bulk materials. One  of the implications of the large surface-to-volume ratio of nanoscale objects is  that the secondary bonds that exist between molecules assume greater importance  because the shape and properties of an object not much bigger than the molecules  comprising it tend to depend on these secondary bonding forces. Accordingly, the  material properties and behaviors of nanoscale structures are different from those  of structures with dimensions in the macroscale or even microscale. These differ- ences can sometimes be exploited to create materials and products with improved  electronic, magnetic, and/or optical properties. Two examples of recently devel- oped materials in this category are (1) carbon nanotubes (Section 36.1.2), and  (2) magnetoresistive materials for use in high-density magnetic memories. Nano- technology will enable the development of entirely new classes of materials. "
    },
    {
        "type": "text",
        "text": "Another difference that arises between nanoscale objects and their macroscopic  counterparts is that material behavior tends to be inﬂ  uenced by quantum mechanics  rather than bulk properties.  Quantum mechanics  is a branch of physics that is concerned  with the notion that all forms of energy (e.g., electricity, light) occur in discrete units  when observed on a small enough scale. The discrete units are called quanta (plural of  quantum), which cannot be further subdivided. For example, electricity is conducted in  units of electrons. An electrical charge of less than one electron is not possible. In light  energy, the quanta are photons. In magnetic energy, they are called magnons. For every  type of energy there are comparable units. All physical phenomena exhibit quantum  behavior at the submicroscopic level. On a macroscopic level, the energy appears to be  continuous because it is being released in very large quantities of quanta. "
    },
    {
        "type": "text",
        "text": "The movement of electrons in microelectronics is of particular interest because  of the signiﬁ  cant reductions in size that continue to be achieved in the fabrication  of integrated circuits. The feature sizes of the devices in integrated circuits produced  in 2009 were on the order of  $50\\;\\mathrm{nm}$ . They are projected to decrease in size to about  $20~\\mathrm{{nm}}$  by around 2015. At a feature size of around  $10~\\mathrm{{nm}}$ , the effects of quantum  mechanics become signiﬁ  cant, changing the way a device operates. As feature size  continues to be reduced toward just a few nanometers, the proportion of surface  atoms in the device increases relative to those beneath the surface, which means that  the electrical characteristics are no longer determined exclusively by the bulk proper- ties of the material. As device size continues to decrease and density of components  on a chip continues to increase, the electronics industry is approaching the limits of  technological feasibility of the current fabrication processes described in Chapter 33. "
    },
    {
        "type": "text",
        "text": "36.2.2  SCANNING PROBE MICROSCOPES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Conventional optical microscopes use visible light focused through optical lenses to  provide enlarged images of very small objects. However, the wavelength of visible  light is  $400{-}700\\;\\mathrm{nm}$ , which is greater than the dimensions of nanosized objects. Thus,  these objects cannot be seen with conventional optical microscopes. The most power- ful optical microscopes provide magniﬁ  cations of about 1000 times, allowing resolu- tions of about  $0.0002\\ \\mathrm{mm}$  ( $200~\\mathrm{nm})$ ). Electron microscopes, which allow specimens  to be visualized utilizing a beam of electrons instead of light, were developed in the  1930s. The electron beam can be considered as a form of wave motion, but one that has  a much shorter effective wavelength. (Today’s electron microscopes permit magniﬁ  ca- tions of about 1,000,000 times and resolutions of about one nanometer). To obtain an  image of a surface, the electron beam is scanned across the surface of an object in a  raster pattern, similar to the way that a cathode ray scans the surface of a (tube-type  or projection-type) television screen. "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "For making observations on the nanoscale level, an improvement over the elec- tron microscope is the family of scanning probe instruments that date from the  1980s. They possess magniﬁ  cation capabilities approximately 10 times greater than  an electron microscope. In a scanning probe microscope (SPM), the probe consists  of a needle with a very sharp tip. The point size approaches the size of a single atom.  In operation, the probe is moved along the surface of the specimen at a distance of  only one nanometer or so, and any of several properties of the surface are measured,  depending on the type of scanning probe device. The two scanning probe micro- scopes of greatest interest in nanotechnology are the scanning tunneling microscope  and the atomic force microscope. "
    },
    {
        "type": "text",
        "text": "The  scanning tunneling microscope  (STM) was the ﬁ  rst scanning probe instru- ment to be developed. It is called a tunneling microscope because its operation is  based on the quantum mechanics phenomenon known as  tunneling , in which indi- vidual electrons in a solid material can jump beyond the surface of the solid into  space. The probability of electrons being in this space beyond the surface decreases  exponentially in proportion to the distance from the surface. This sensitivity to  distance is exploited in the STM by positioning the probe tip very close to the  surface (i.e., $1\\;\\mathrm{nm}$ ) and applying a small voltage between the two. This causes elec- trons of surface atoms to be attracted to the small positive charge of the tip, and  they tunnel across the gap to the probe. As the probe is moved along the surface,  varia  tions in the resulting current occur due to the positions of individual atoms on  the surface. Alternatively, if the elevation of the tip above the surface is allowed to  ﬂ  oat by maintaining a constant current, then the vertical deﬂ  ection of the tip can  be measured as it traverses the surface. These variations in current or deﬂ  ection  can be used to create images or topographical maps of the surface on an atomic or  molecular scale. "
    },
    {
        "type": "text",
        "text": "A limitation of the scanning tunneling microscope is that it can only be used  on surfaces of conducting materials. By comparison, the  atomic force microscope (AFM) can be used on any material; it uses a probe attached to a delicate cantilever  that deﬂ  ects due to the force exerted by the surface on the probe as it traverses the  specimen surface. The AFM responds to various types of forces, depending on the  application. The forces include mechanical due to physical contact of the probe with  the specimen surface, and noncontact, such as van der Waals forces (Section 2.2),  capillary forces, magnetic forces,  and others. The vertical deﬂ  ection of the probe is  measured optically, based on the interference pattern of a light beam or the reﬂ  ec- tion of a laser beam from the cantilever. Figure 36.3 shows an image generated by  an AFM. "
    },
    {
        "type": "image",
        "img_path": "images/a2f7e5ec6876a5a1c807a6eddeda287a348c0d6913fd4fbf2ab591c3ee4eb8e3.jpg",
        "img_caption": "FIGURE 36.3  An atomic  force microscope image of  silicon dioxide letters on a  silicon substrate. The oxide  lines of the letters are about  20 nm wide. (Image courtesy  of IBM Corporation.) "
    },
    {
        "type": "text",
        "text": "The discussion here has focused on the use of scanning probe microscopes for  observing surfaces. Section 36.3.2 describes several applications of these instruments  for manipulating individual atoms, molecules, and other nanoscale clusters of atoms  or molecules. "
    },
    {
        "type": "text",
        "text": " Nanofabrication Processes ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "Creating products at least some of whose feature sizes are in the nanometer range  requires fabrication techniques that are often quite different from those used to  process bulk materials and macro-sized products. The fabrication processes for  nanometer-scale materials and structures can be divided into two basic categories:\n\n "
    },
    {
        "type": "text",
        "text": "1.  Top-down approaches , which adapt some of the lithography-based microfabri- cation techniques discussed in Chapters 33 and 35 to nanoscale object sizes. They  involve mostly subtractive processes (material removal) to achieve the desired  geometry.\n\n 2.  Bottom-up approaches , in which atoms and molecules are manipulated and  combined into larger structures. These might be described as additive processes  because they construct the nanoscale entity from smaller components. "
    },
    {
        "type": "text",
        "text": "The organization in this section is based on these two approaches. Because the  processing methods associated with the top-down approaches are discussed in two  previous chapters, the coverage in Section 36.3.1 emphasizes how these processes must  be modiﬁ  ed for the nanoscale. Section 36.3.2 discusses the bottom-up approaches,  which may be of greater interest because of their special relevance to nanotechnology. "
    },
    {
        "type": "text",
        "text": "36.3.1  TOP-DOWN PROCESSING APPROACHES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "The top-down approaches for fabricating nanoscale objects involve the process- ing of bulk materials (e.g., silicon wafers) and thin ﬁ  lms using lithographic tech- niques like those used in the processing of integrated circuits and microsystems.  "
    },
    {
        "type": "text",
        "text": "The top-down approaches also include other precision machining techniques  (Section 35.2.3) that have been adapted for making nanostructures. The term  nanomachining  is used for these processes that involve material removal  when applied in the sub-micron scale. Nanostructures have been machined out  of mate  rials such as silicon, silicon carbide, diamond, and silicon nitride [24].  Nano  machining must often be coupled with thin-ﬁ  lm deposition processes such  as physical vapor deposition and chemical vapor depo  sition (Section 27.5) to  achieve the desired structure and combination of materials. "
    },
    {
        "type": "text",
        "text": "As the feature sizes of the components in an integrated circuit (IC) become  smaller and smaller, fabrication techniques based on optical lithography become  limited because of the wavelengths of visible light. Ultraviolet light is currently  used to fabricate ICs because its shorter wavelengths permit smaller features to  be fabricated, thus allowing higher densities of components in the IC. The current  technology being reﬁ  ned for IC fabrication is called extreme ultraviolet (EUV)  lithography (Section 33.3.2). It uses UV light with a wavelength as short as  $13\\;\\mathrm{nm}$ ,  which is certainly within the nanotechnology range. However, certain technical  problems must be addressed when EUV lithography is used at these very short  UV wavelengths. The problems include (1) new photoresists that are sensitive to  this wavelength must be used, (2) focusing systems must be based on all reﬂ  ective  optics, and (3) plasma sources based on laser irradiation of the element xenon [15]  must be used. "
    },
    {
        "type": "text",
        "text": "Other lithography techniques are available for use in fabricating nanoscale  structures. These include electron-beam lithography, X-ray lithography, and micro-  or nano-imprint lithography. Electron-beam and X-ray lithography are discussed  in the context of integrated circuit processing (Section 33.3.2).  Electron-beam  litho  graphy  (EBL) operates by directing a highly focused beam of electrons along  the desired pattern across the surface of a material, thus exposing the surface areas  using a sequen  tial process without the need for a mask. Although EBL is capable  of resolutions on the order of  $10~\\mathrm{{nm}}$ , its sequential operation makes it relatively  slow compared to masking techniques and thus unsuited to mass production. $X$ -ray  lithography  can produce patterns with resolutions around $20\\,\\mathrm{nm}$ , and it uses mask- ing techniques, which makes high production possible. However, X-rays are difﬁ  - cult to focus and require contact or proximity printing (Section 33.3.1). In addition,  the equipment is expensive for production applications, and X-rays are hazardous  to humans. "
    },
    {
        "type": "text",
        "text": "Two of the processes known as soft lithography are described in Section 35.2.3.  The processes are  micro-imprint lithography , in which a patterned ﬂ  at mold (simi- lar to a rubber stamp) is used to mechanically deform a thermoplastic resist on the  surface of a substrate in preparation for etching, and  micro-contact printing , in  which the stamp is dipped into a substance and then pressed against a substrate.  This transfers a very thin layer of the substance onto the substrate surface in the  pattern deﬁ  ned by the stamp. These same processes can be applied to nanofabri- cation, in which case they are called  nano-imprint lithography  and  nano-contact  printing . Nano-imprint lithography can produce pattern resolutions of approxi- mately $5\\;\\mathrm{nm}$  [24]. One of the original applications of nano-contact printing was to  transfer a thin ﬁ  lm of thiols (a family of organic compounds derived from hydrogen  sulﬁ  de) onto a gold surface. The uniqueness of the application was that the ﬁ  lm  was only one molecule thick (called a monolayer, Section 36.3.2), which certainly  qualiﬁ  es as nanoscale. "
    },
    {
        "type": "text",
        "text": "36.3.2  BOTTOM-UP PROCESSING APPROACHES ",
        "text_level": 1
    },
    {
        "type": "text",
        "text": "In the bottom-up approaches, the starting materials are atoms, molecules, and ions.  The processes bring these basic building blocks together, in some cases one at a time,  to fabricate the desired nanoscale entity. The coverage consists of four approaches  that are of considerable interest in nanotechnology: (1) production of fullerenes,  (2) production of carbon nanotubes, (3) nanofabrication by scanning probe tech- niques, and (4) self-assembly. "
    },
    {
        "type": "text",
        "text": "Production of Fullerenes   The starting material for the manufacture of fullerenes  is carbon black produced from an electric arc between two graphite electrodes. The  resulting product contains $20\\%$  or less carbon fullerenes mixed in with other forms  of carbon and hydrocarbons. Around  $75\\%$  of the fullerene content is  $\\mathrm{{C}_{60}}$  with the  rest being fullerenes of higher molecular weight. The problem is to separate the $\\mathrm{{C}_{60}}$   and other fullerenes from the mixture. It turns out that fullerenes are soluble in  certain organic solvents whereas the other carbon products are not. Thus, the entire  output is subjected to the solvent process and the insoluble carbon solids are ﬁ  l- tered out, leaving the fullerenes in solution. These are classiﬁ  ed into different sizes  using a chromatographic technique that distinguishes among molecules by their  molecular weight. "
    },
    {
        "type": "text",
        "text": "Production of Carbon Nanotubes  The remarkable properties and potential appli- cations of carbon nanotubes are discussed in Section 36.1.2. Carbon nanotubes can  be produced by several techniques. In the following paragraphs three are discussed:  (1) laser evaporation, (2) carbon arc techniques, and (3) chemical vapor deposition. "
    },
    {
        "type": "text",
        "text": "In the  laser evaporation method , the starting raw material is a graphite workpiece  containing small amounts of cobalt and nickel. These metal traces perform the role  of catalyst, acting as nucleation sites for the subsequent formation of the nanotubes.  The graphite is placed in a quartz tube ﬁ  lled with argon gas and heated to  $1200^{\\circ}\\mathrm{C}$   $(2200^{\\circ}\\mathrm{F})$ ). A pulsed laser beam is focused on the workpiece, causing the carbon atoms  to evaporate from the bulk graphite. The argon moves the carbon atoms out of the  high-temperature region of the tube and into an area in which a water-cooled copper  apparatus is located. The carbon atoms condense on the cold copper, and as they do,  they form nanotubes with diameters of 10 to  $20\\;\\mathrm{nm}$  and lengths of about $100\\,\\mu\\mathrm m$ . "
    },
    {
        "type": "text",
        "text": "The  carbon arc technique  uses two carbon electrodes that are 5 to $20\\;\\mu\\mathrm m$  in dia- meter and separated by  $1\\;\\mathrm{mm}$ . The electrodes are located in a partially evacuated  container (about $2/3$  of 1 atmospheric pressure) with helium ﬂ  owing in it. To start the  process, a voltage of about $25\\,\\mathrm{V}$  is applied across the two electrodes, causing carbon  atoms to be ejected from the positive electrode and carried to the negative electrode  where they form nanotubes. The structure of the nanotubes depends on whether a  catalyst is used. If no catalyst is used, then multiwalled nanotubes are produced.  If trace amounts of cobalt, iron, or nickel are placed in the interior of the positive  electrode, then the process creates single-walled nanotubes that are 1 to  $5~\\mathrm{nm}$  in  diameter and about $1\\;\\mu\\mathrm{m}$  long. "
    },
    {
        "type": "text",
        "text": "Chemical vapor deposition  (Section 27.5.2) can be used to produce carbon nano- tubes. In one variation of CVD, the starting work material is a hydrocarbon gas such  as methane  $\\mathrm{(CH_{4})}$ . The gas is heated to  $1100^{\\circ}\\mathrm{C}$   $(2000^{\\circ}\\mathrm{F})$ , causing it to decompose  and release carbon atoms. The atoms then condense on a cool substrate to form  nanotubes with open ends rather than the closed ends characteristic of the other  "
    },
    {
        "type": "image",
        "img_path": "images/25144a43ad9ea7dd0142da6d65884d098409c50d08fdf58ff4f125a2432f0fa3.jpg",
        "img_caption": "FIGURE 36.4  Manipulation of  individual atoms by means of scanning  tunneling microscopy techniques:  (a) Probe tip is maintained a distance  from the surface that is sufﬁ  cient to  avoid disturbance of adsorbed atom  and (b) probe tip is moved closer to  the surface so that the adsorbed atom  is attracted to the tip. "
    },
    {
        "type": "text",
        "text": "fabrication techniques. The substrate may contain iron or other metals that act as  catalysts for the process. The metal catalyst acts as a nucleation site for creation of  the nanotube, and it also controls the orientation of the structure. An alternative  CVD process called  $\\mathrm{_{HeCO^{5}}}$  starts with carbon monoxide (CO) and uses carbon  pentacarbonyl  $(\\mathrm{Fe(CO)}_{5})$ ) as the catalyst to produce high-purity, single-walled nano- tubes at 900 to $1100^{\\circ}\\mathrm{C}$   $(1700{-}2000^{\\circ}\\mathrm{F})$ ) and 30 to 50 atm [8]. Production of nanotubes  by CVD has the advantage that it can be operated continuously, which makes it  economically attractive for mass production. "
    },
    {
        "type": "text",
        "text": "Nanofabrication by Scanning Probe Techniques   Scanning probe microscopy  (SPM) techniques are described in Section 36.2.2 in the context of measuring and  observing nanometer-scale features and objects. In addition to viewing a surface,  the scanning tunneling microscope (STM) and atomic force microscope (AFM)  can also be used to manipulate individual atoms, molecules, or clusters of atoms  or molecules that adhere to a substrate surface by the forces of adsorption (weak  chemical bonds). Clusters of atoms or molecules are called  nanoclusters , and their  size is just a few nanometers. Figure 36.4(a) illustrates the variation in either cur- rent or deﬂ  ection of the STM probe tip as it is moved across a surface upon which  is located an adsorbed atom. As the tip moves over the surface immediately above  the adsorbed atom, there is an increase in the signal. Although the bonding force  that attracts the atom to the surface is weak, it is signiﬁ  cantly greater than the force  of attraction created by the tip, simply because the distance is greater. However,  if the probe tip is moved close enough to the adsorbed atom so that its force of  attraction is greater than the adsorption force, the atom will be dragged along the  surface, as suggested in Figure 36.4(b). In this way, individual atoms or molecules  can be manipulated to create various nanoscale structures. A notable STM example  accomplished at the IBM Research Labs was the fabrication of the company logo  out of xenon atoms adsorbed onto a nickel surface in an area $5\\;\\mathrm{nm}$  by  $16\\;\\mathrm{nm}$ . This  scale is considerably smaller than the lettering in Figure 36.3 (which is also nano- scale, as noted in the caption). "
    },
    {
        "type": "text",
        "text": ""
    },
    {
        "type": "text",
        "text": "The manipulation of individual atoms or molecules by scanning tunneling micro- scopy techniques can be classiﬁ  ed as lateral manipulation and vertical manipulation. In  lateral manipulation, atoms or molecules are transferred horizontally along the surface  by the attractive or repulsive forces exerted by the STM tip, as in Figure 36.4(b). In  vertical manipulation, the atoms or molecules are lifted from the surface and deposited  at a different location to form a structure. Although this kind of STM manipulation of  atoms and molecules is of scientiﬁ  c interest, there are technological limitations that  inhibit its commercial application, at least in high production of nanotech products.  One of the limitations is that it must be carried out in a very high vacuum environment  to prevent stray atoms or molecules from interfering with the process. Another limita- tion is that the surface of the substrate must be cooled to temperatures approaching  absolute zero ( $-273^{\\circ}\\mathrm{C}$  or  $-460^{\\circ}\\mathrm{F}$ ) to reduce thermal diffusion that would gradually  distort the atomic structure being formed. These limitations make it a very slow and  expensive process. "
    },
    {
        "type": "text",
        "text": "The atomic force microscope is also used for similar nanoscale manipulations. In  comparing the AFM and STM applications, the AFM is more versatile because it is  not restricted to conductive surfaces as is the STM and it can be used under normal  room conditions. On the other hand, the AFM has a lower resolution than the STM.  Consequently, the STM can be used to manipulate single atoms, while the AFM is  better suited to the manipulation of larger molecules and nanoclusters [24].  "
    },
    {
        "type": "text",
        "text": "Another scanning probe technique, one that shows promise for practical applica- tions, is called dip-pen nanolithography. In  dip-pen nanolithography  (DPN), the tip  of an atomic force microscope is used to transfer molecules to a substrate surface  by means of a solvent meniscus, as shown in Figure 36.5. The process is somewhat  analogous to using an old-fashioned quill pen to transfer ink to a paper surface via  capillary forces. In DPN, the AFM tip serves as the nib of the pen, and the substrate  becomes the surface onto which the dissolved molecules (i.e., the ink) are deposited.  The deposited molecules must have a chemical afﬁ  nity for the substrate material, just  as wet ink adheres to paper. DPN can be used to “write” patterns of molecules onto  a surface, in which the patterns are of submicron dimension. Line widths as small as  10 to $15\\,\\mathrm{nm}$  are reported [27]. In addition, DPN can be used to deposit different types  of molecules at different locations on the substrate surface. "
    },
    {
        "type": "image",
        "img_path": "images/1c1de934d4faf63cefa4392c3e0c0d0e6650bbc770220acc4acf1de6717ca3ce.jpg",
        "img_caption": "FIGURE 36.5  Dip-pen nano- lithography, in which the tip of  an atomic force microscope  is used to deposit molecules  through the water meniscus  that forms naturally between  the tip and the substrate. "
    },
    {
        "type": "text",
        "text": "Self-Assembly  Self-assembly is a fundamental process in nature. The natural for- mation of a crystalline structure during the slow cooling of molten minerals is an  example of nonliving self-assembly. The growth of living organisms is an example  of biological self-assembly. In both instances, entities at the atomic and molecular  level combine on their own into larger entities, proceeding in a constructive manner  toward the creation of some deliberate thing. If the thing is a living organism, the  inter  mediate entities are biological cells, and the organism is grown through an addi- tive process that exhibits massive replication of individual cell formations, yet the ﬁ  nal  result is often remarkably intricate and complex (e.g., a human being). "
    },
    {
        "type": "text",
        "text": "One of the promising bottom-up approaches in nanotechnology involves the  emulation of nature’s self-assembly process to produce materials and systems that  have nanometer-scale features or building blocks, but the ﬁ  nal product may be  larger than nanoscale. It may be of micro- or macro-scale size, at least in some  of its dimensions. The term  biomimetics  describes this process of building arti- ﬁ  cial, nonbiological entities by imitating nature’s methods. Desirable attributes  of atomic or molecular self-assembly processes in nanotechnology include the  following: (1) they can be carried out rapidly; (2) they occur automatically and do  not require any central control; (3) they exhibit massive replication; and (4) they  can be performed under mild environmental conditions (at or near atmospheric  pressure and room temperature). Self-assembly is likely to be the most important  of the nanofabrication processes because of its low cost, its capacity for producing  structures over a range of sizes (from nanoscale to macroscale), and its general  applicability to a wide variety of products [19]. "
    },
    {
        "type": "text",
        "text": "An underlying principle behind self-assembly is the principle of minimum energy.  Physical entities such as atoms and molecules seek out a state that minimizes the total  energy of the system of which they are components. This principle has the following  implications for self-assembly:\n\n "
    },
    {
        "type": "text",
        "text": "1.  There must be some mechanism for the movement of the entities (e.g., atoms,  molecules, ions) in the system, thus causing the entities to come into close proxi- mity with one another. Possible mechanisms for this movement include diffu- sion, convection in a ﬂ  uid, and electric ﬁ  elds.\n\n 2.  There must be some form of molecular recognition among the entities. Molecular  recognition refers to the tendency of one molecule (or atom or ion) to be attracted  to and bind with another molecule (or atom or ion), for example, the way sodium  and chlorine are attracted to each other to form table salt.\n\n 3.  The molecular recognition among the entities causes them to join in such a way  that the resulting physical arrangement of the entities achieves a state of mini- mum energy. The joining process involves chemical bonding, usually the weaker  secondary types (e.g., van der Waals bonds). "
    },
    {
        "type": "text",
        "text": "At least two instances of molecular-level self-assembly have previously been  encountered in this book: (1) crystal formation and (2) polymerization. Crystal for- mation in metals, ceramics, and certain polymers is a form of self-assembly. Growing  silicon boules in the Czochralski process (Section 33.2.2) for fabrication of integrated  circuits is a good illustration. Using a starting seed crystal, very pure molten silicon  is formed into a large cylindrical solid whose repeating lattice structure matches that  of the seed throughout its volume. The lattice spacing in the crystal structure is of  nanometer proportions, but the replication exhibits long-range order. "
    },
    {
        "type": "text",
        "text": "It can be argued that polymers are products of nanometer-scale self-assembly. The  process of polymerization (Section 8.1.1) involves the joining of individual monomers  (individual molecules such as ethylene $\\mathrm{C_{2}H_{4}}$ ) to form very large molecules (macro- molecules such as polyethylene), often in the form of a long chain with thousands of  repeating units. Copolymers (Section 8.1.2) represent a more complex self-assembly  process, in which two different types of starting monomers are joined in a regular  repeating structure. An example is the copolymer synthesized from ethylene and  propylene  $\\left(\\mathrm{C}_{3}\\mathrm{H}_{6}\\right)$ . In these polymer examples, the repeating units are of nanometer  size, and they form by a massive self-assembly process into bulk materials that have  signiﬁ  cant commercial value. "
    },
    {
        "type": "text",
        "text": "The technologies for producing silicon boules and polymers precede the cur- rent scientiﬁ  c interest in nanotechnology. Of greater relevance in this chapter  are self-assembly fabrication techniques that have been developed under the  nano  technology banner. These self-assembly processes, most of which are still in  the research stage, include the following categories: (1) fabrication of nanoscale  objects, including molecules, macromolecules, clusters of molecules, nanotubes,  and crystals; and (2) formation of two-dimensional arrays such as self-assembled  monolayers (surface ﬁ  lms that are one molecule thick) and three-dimensional  networks of molecules. "
    },
    {
        "type": "text",
        "text": "Some of the processes in category 1 have already been discussed (e.g., fuller- enes and nanotubes). The self-assembly of surface ﬁ  lms is an important example  of category 2. Surface ﬁ  lms are two-dimensional coatings formed on a solid (three- dimensional) substrate. Most surface ﬁ  lms are inherently thin, yet the thickness is  typically measured in micrometers or even millimeters (or fractions thereof), well  above the nanometer scale. Of interest here are surface ﬁ  lms whose thicknesses  are measured in nanometers. Of particular interest in nanotechnology are surface  ﬁ  lms that self-assemble, are only one molecule thick, and where the molecules are  organized in some orderly fashion. These types of ﬁ  lms are called self-assembled  monolayers (SAMs). Multilayered structures are also possible that possess order  and are two or more molecules thick. "
    },
    {
        "type": "text",
        "text": "The substrate materials for self-assembled monolayers and multilayers include  a variety of metallic and other inorganic materials. The list includes gold, silver,  copper, silicon, and silicon dioxide. Noble metals have the advantage of not form- ing an oxide surface ﬁ  lm that would interfere with the reactions that generate the  desired layer of interest. Layering materials include thiols, sulﬁ  des, and disulﬁ  des.  The layering material must be capable of being adsorbed onto the surface material.  The typical process sequence in the formation of the monolayer of a thiol on gold  is illustrated in Figure 36.6.  Layering molecules move freely above the substrate  surface and are adsorbed onto the surface. Contact occurs between adsorbed mole- cules on the surface, and they form stable islands. The islands become larger and  gradually join together through the addition of more molecules laterally on the  surface, until the substrate is completely covered. Bonding to the gold surface is  provided by the sulfur atom in the thiol, sulﬁ  de, or disulﬁ  de layer. In some applica- tions, self-assembled monolayers can be formed into desired patterns or regions on  the substrate surface using techniques such as nano-contact printing and dip-pen  nanolithography. "
    }
]